#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура бг_ПриЗаписи(Отказ, Замещение)
	бг_СформироватьДвиженияПодтверждениеОплатыПоЗаявлениямНаВвозТоваров();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_СформироватьДвиженияПодтверждениеОплатыПоЗаявлениямНаВвозТоваров() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	бг_ТекущийДокумент = Неопределено;
	
	Если ЗначениеЗаполнено(Отбор.СчетФактура.Значение) Тогда
		бг_ТекущийДокумент = Отбор.СчетФактура.Значение;
	ИначеЕсли ЗначениеЗаполнено(Отбор.ДокументРегистратор.Значение) Тогда
		бг_ТекущийДокумент = Отбор.ДокументРегистратор.Значение;
	КонецЕсли;
	
	Если ТипЗнч(бг_ТекущийДокумент) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда
		Документы.ЗаявлениеОВвозеТоваров.бг_СформироватьДвиженияПодтверждениеОплаты(бг_ТекущийДокумент);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
