#Область ПрограммныйИнтерфейс

&После("ОбработчикКоманды")
// Обработчик команд, добавленных динамически и подключенных к обработчику "Подключаемый_Команда".
// Пример добавления команды см. ОтчетыПереопределяемый.ПриСозданииНаСервере().
//
// Параметры:
//   ФормаОтчета - ФормаКлиентскогоПриложения - Форма отчета.
//   Команда     - КомандаФормы     - Команда, которая была вызвана.
//   Результат   - Булево           - Истина, если вызов команды обработан.
//
Процедура бг_ОбработчикКоманды(ФормаОтчета, Команда, Результат) Экспорт
	
	Если Команда.Имя = "бг_ОсновнаяКоманднаяПанельСоздатьЗаказыПоставщикам" Тогда
		бг_ОткрытьФормуСозданияЗаказовПоставщикам(ФормаОтчета);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ОткрытьФормуСозданияЗаказовПоставщикам(ФормаОтчета)

	АдресДанныхОтчета = бг_ОтчетыВызовСервера.ПодготовитьДанныеЗапросовИзСхемыКомпоновкиДанных(
		ФормаОтчета.Отчет.КомпоновщикНастроек, 
		ФормаОтчета.НастройкиОтчета.АдресСхемы);
			
	ОткрытьФорму(
		"Обработка.бг_ФормированиеЗаказовПоставщикам.Форма.Форма", 
		Новый Структура("АдресДанныхОтчета", АдресДанныхОтчета), 
		ФормаОтчета,,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
#КонецОбласти
