#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьРеквизитыПаллеты();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьРеквизитыПаллеты()

	УчетОстатковИРезервовВРазрезеУпаковокПаллет = Ложь;
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Номенклатура")
		И ЗначениеЗаполнено(Объект.Владелец)
		И бг_Номенклатура.ВедетсяУчетОстатковИРезервовВРазрезеУпаковокПаллет(Объект.Владелец) Тогда
		УчетОстатковИРезервовВРазрезеУпаковокПаллет = Истина;
	КонецЕсли;
	
	// Паллета упаковки.	
	ПолеФормы = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(ЭтотОбъект,
									"бг_УпаковкаПаллета",
									ЭтотОбъект,
									"Объект.бг_УпаковкаПаллета");
	ПолеФормы.АвтоМаксимальнаяШирина = Ложь;
	ПолеФормы.МаксимальнаяШирина = 12;
	ПолеФормы.Видимость = УчетОстатковИРезервовВРазрезеУпаковокПаллет;
	ПолеФормы.ТолькоПросмотр = Истина;
	
	Если УчетОстатковИРезервовВРазрезеУпаковокПаллет Тогда
		НоваяСвязьПараметровВыбора = Новый СвязьПараметраВыбора("Номенклатура", "Объект.Владелец",  РежимИзмененияСвязанногоЗначения.Очищать);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязьПараметровВыбора);
		ФиксированныйМассивСвязьПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		ПолеФормы.СвязиПараметровВыбора = ФиксированныйМассивСвязьПараметровВыбора;
	КонецЕсли;

КонецПроцедуры	
	
#КонецОбласти
