#Область СлужебныеПроцедурыИФункции 
Функция бг_ДоговорКонтрагентаПоОрганизации(Контрагент, Организация) Экспорт
	
	ДоговорПустаяСсылка = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Если Не ЗначениеЗаполнено(Контрагент) Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат ДоговорПустаяСсылка;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДанныеДоговора.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
	|ГДЕ
	|	ДанныеДоговора.Контрагент = &Контрагент
	|	И ДанныеДоговора.Организация = &Организация
	|	И ДанныеДоговора.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И НЕ ДанныеДоговора.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		Возврат ДоговорПустаяСсылка;
	КонецЕсли;
	
КонецФункции
#КонецОбласти // СлужебныеПроцедурыИФункции