#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриКопировании")
Процедура бг_ПриКопировании(ОбъектКопирования)
	
	бг_АвтоматическиФормироватьЗаявкиНаРасходованиеДС = Ложь;
	бг_ОтсрочкаПлатежа = 0;
	бг_ШаблонТекстаНазначенияПлатежа = "";
	
	бг_НастройкиОплатыЧерезФакторинговуюКомпанию.Очистить();
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ)
	бг_ПроверитьЗаполнитьСоглашения();
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура бг_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)  
	
	Если бг_КонстантыПовтИсп.ЗначениеКонстанты("КонтролироватьВидВзаиморасчетовВДоговоре") = Истина
		И Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		ПроверяемыеРеквизиты.Добавить("бг_ВидВзаиморасчетов");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура бг_ПроверитьЗаполнитьСоглашения()
	
	Если Не ЭтоНовый()
		И Не ЗначениеЗаполнено(бг_Соглашение) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоглашенияСКлиентами.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|	СоглашенияСКлиентами.бг_Договор = &бг_Договор
		|	И НЕ СоглашенияСКлиентами.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("бг_Договор", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда 			
			
			Выборка = РезультатЗапроса.Выбрать();		
			Выборка.Следующий(); 
			
			бг_Соглашение = Выборка.Ссылка; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
