#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
    бг_ЗаполнитьВариантСинхронизацииWMS();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ЗаполнитьВариантСинхронизацииWMS()
	
	Если ЗначениеЗаполнено(бг_ВариантСинхронизацииWMS) Тогда
		Возврат;
	КонецЕсли;
	
	Если бг_ОграничиватьДобавлениеИзменениеНоменклатуры Тогда
		бг_ВариантСинхронизацииWMS = Перечисления.бг_ВариантыСинхронизацииНоменклатурыWMS.КодЕК_Номенклатуры;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
