
#Область ПрограммныйИнтерфейс

// Возвращает признак наличия настройки подбора серий по контрагенту
// Параметры:
// Контрагент - СправочникСсылка.Контрагенты
// ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры
// Организация - СправочникСсылка.Организации
// Дата - Дата
// 
// Возвращаемое значение:
//   - Булево
Функция ПодбиратьСерииКратноКоробкам(Контрагент, ВидНоменклатуры, Организация, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", КонецДня(Дата));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_НастройкиИспользованияПодбораСерийКратноУпаковкамСрезПоследних.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.бг_НастройкиИспользованияПодбораСерийКратноУпаковкам.СрезПоследних(
	|		&Период,
	|		Контрагент = &Контрагент
	|		И ВидНоменклатуры = &ВидНоменклатуры
	|		И Организация = &Организация
	|		И ПравилаОкругленияДоКороба = 
	|			ЗНАЧЕНИЕ(Перечисление.бг_ПравилаОкругленияДоКороба.бг_РаспределятьСерииКратноКоробам)) КАК бг_НастройкиИспользованияПодбораСерийКратноУпаковкамСрезПоследних";

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти