
#Область ПрограммныйИнтерфейс 

Процедура ВыгрузитьСвязанныеОбъекты(НаборЗаписей) Экспорт
	
	Перем адаптер_ПодпискиНаСобытияВызовСервера;
	адаптер_ПодпискиНаСобытияВызовСервера = ОбщегоНазначения.ОбщийМодуль("адаптер_ПодпискиНаСобытияВызовСервера");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НаборЗаписей.ДополнительныеСвойства.Свойство("адаптер_ЭтоГрупповаяОбработкаДанных")
		И НаборЗаписей.ДополнительныеСвойства.адаптер_ЭтоГрупповаяОбработкаДанных = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВодительскогоУдостоверения = НаборЗаписей.Выгрузить(, "Физлицо, ВидДокумента");
	
	Если ДанныеВодительскогоУдостоверения.Количество() > 0 Тогда
		
		СтрокаДанных = ДанныеВодительскогоУдостоверения[0]; 
		
		Если СтрокаДанных.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение
			И ЗначениеЗаполнено(СтрокаДанных.Физлицо) Тогда 
			
			адаптер_ПодпискиНаСобытияВызовСервера.ЗарегистрироватьИсходящееСообщение(
				СтрокаДанных.Физлицо, 
					Неопределено, 
					Неопределено);
			
		КонецЕсли;  
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти //ПрограммныйИнтерфейс

