#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтавкаНДС(Контрагент, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтавкиНалогов.Контрагент КАК Контрагент,
	|	СтавкиНалогов.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.бг_СтавкиНалоговКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК СтавкиНалогов";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтавкаНДС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
