

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОтборОрганизация", Организация);
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
		Период.ДатаОкончания = КонецМесяца(Период.ДатаНачала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПоПериодуПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблица
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не заполнено поле Организация';
		|en = 'Не заполнено поле Организация'"));
		Возврат;
	КонецЕсли;
	
	Результат.Вставить("Организация", Организация);
	Результат.Вставить("НеУчитыватьЧастичноОплаченные", НеУчитыватьЧастичноОплаченные);
	
	Если ОтборПоПериоду Тогда
		
		Если Не ЗначениеЗаполнено(Период.ДатаНачала) Или Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не заполнен период';
			|en = 'Не заполнен период'"));
			Возврат;
		КонецЕсли;
		
		Результат.Вставить("ДатаНачала", Период.ДатаНачала);
		Результат.Вставить("ДатаОкончания", Период.ДатаОкончания);
	Иначе
		Результат.Вставить("ДатаНачала");
		Результат.Вставить("ДатаОкончания");
	КонецЕсли;
	
	ОтборКонтрагенты = Новый Массив;
	
	Для Каждого Строка Из Контрагенты Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Контрагент) Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не заполнен контрагент';
			|en = 'Не заполнен контрагент'"));
			Возврат;
		КонецЕсли;
		
		Данные = Новый Структура("Контрагент,Договор");
		ЗаполнитьЗначенияСвойств(Данные, Строка);
		
		ОтборКонтрагенты.Добавить(Данные);
		
	КонецЦикла;
	
	Результат.Вставить("Контрагенты", ОтборКонтрагенты);
	
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.Период.Доступность = ОтборПоПериоду;
	
КонецПроцедуры

#КонецОбласти