
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура КомандаЗаполнитьНаСервере()
	ТаблицаСоответствия = РегистрыСведений.бг_СоответствиеВидовТранспортныхРасходовСтатьямРасходов.ПолучитьСоответствиеСтатей();
	НаборЗаписей = РегистрыСведений.бг_СоответствиеВидовТранспортныхРасходовСтатьямРасходов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТаблицаСоответствия);
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

#КонецОбласти