
&Вместо("НазванияЭлементовСерий")
Функция бг_НазванияЭлементовСерий(ИмяРеквизита)
	СтруктураВозврата = Новый Структура("Серии, ОстаткиСерий");
	
	Если ИмяРеквизита = "бг_СерияМарки"
		ИЛИ ИмяРеквизита = "бг_НомерРулона"
		ИЛИ ИмяРеквизита = "бг_НомерДиапазонаВРулоне"
		ИЛИ ИмяРеквизита = "бг_НачальныйНомерДиапазона"
		ИЛИ ИмяРеквизита = "бг_КонечныйНомерДиапазона"
		ИЛИ ИмяРеквизита = "бг_ЗаявлениеОВыдачеФСМ"
		ИЛИ ИмяРеквизита = "бг_НакладнаяНаВыдачуФСМ" Тогда
		
		Для каждого КлючЗначение из СтруктураВозврата Цикл
			СтруктураВозврата[КлючЗначение.Ключ] = СтрШаблон("%1%2", КлючЗначение.Ключ, ИмяРеквизита);
		КонецЦикла;
		
		Возврат СтруктураВозврата;
	Иначе	
		Возврат ПродолжитьВызов(ИмяРеквизита);
	КонецЕсли;
КонецФункции
