
#Область ПрограммныйИнтерфейс

// Процедура - Фиксирует печать документов 
//
// Параметры:
//  ТабличныеДокументы - СписокЗначений 
//  ОбъектыПечати - СписокЗначений - Список документов 
//  СписокПечати - СписокЗначений - Идентификаторы макетов
//	АдресПовторноФиксируемыхДокументов - Неопределено - Адрес, по которому поместятся 
//		вторично фиксируемые документы
//
Процедура ЗафиксироватьПечатьДокументов(ТабличныеДокументы, ОбъектыПечати, 
	СписокПечати, АдресПовторноФиксируемыхДокументов) Экспорт

	РегистрыСведений.бг_ФиксацияПечатиДокументов.ЗафиксироватьПечатьДокументов(
		ТабличныеДокументы, 
		ОбъектыПечати, 
		СписокПечати, 
		АдресПовторноФиксируемыхДокументов);
	
КонецПроцедуры

// Процедура - Фиксирует печать комплекта документов
//
// Параметры:
//  КоллекцияПечатныхФормПоОбъектам - ТаблицаЗначений
//	АдресПовторноФиксируемыхДокументов - Неопределено - Адрес, по которому поместятся 
//		вторично фиксируемые документы
//
Процедура ЗафиксироватьПечатьКомплектаДокументов(КоллекцияПечатныхФормПоОбъектам, 
	АдресПовторноФиксируемыхДокументов) Экспорт

	РегистрыСведений.бг_ФиксацияПечатиДокументов.ЗафиксироватьПечатьКомплектаДокументов(
		КоллекцияПечатныхФормПоОбъектам, 
		АдресПовторноФиксируемыхДокументов);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтразитьПовторнуюПечатьДокументов(ДанныеРаспечатанныхДокументов) Экспорт
	
	ОтражаемыеДокументы = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(ДанныеРаспечатанныхДокументов);
	
	ДанныеДляЗаписи = РегистрыСведений.бг_ФиксацияПечатиДокументов.ДанныеДокументовДляЗаписи(
		ОтражаемыеДокументы);
		
	РегистрыСведений.бг_ФиксацияПечатиДокументов.ОтразитьФактПечатиДокументов(ДанныеДляЗаписи);
	
КонецПроцедуры

#КонецОбласти