
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
		
КонецПроцедуры

#КонецОбласти //ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	//Шапка документа
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Проведен");
	ВыгружаемыеРеквизиты.Добавить("Автор");
	ВыгружаемыеРеквизиты.Добавить("Валюта");
	ВыгружаемыеРеквизиты.Добавить("ВернутьМногооборотнуюТару");
	ВыгружаемыеРеквизиты.Добавить("ВидыЗапасовУказаныВручную");
	ВыгружаемыеРеквизиты.Добавить("Грузоотправитель");
	ВыгружаемыеРеквизиты.Добавить("Договор");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	ВыгружаемыеРеквизиты.Добавить("Контрагент");
	ВыгружаемыеРеквизиты.Добавить("Менеджер");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("Основание");
	ВыгружаемыеРеквизиты.Добавить("ОснованиеДата");
	ВыгружаемыеРеквизиты.Добавить("ОснованиеНомер");
	ВыгружаемыеРеквизиты.Добавить("ОсобыеУсловияПеревозки");
	ВыгружаемыеРеквизиты.Добавить("Партнер");
	ВыгружаемыеРеквизиты.Добавить("ПередачаПоЗаказам");
	ВыгружаемыеРеквизиты.Добавить("Подразделение");
	ВыгружаемыеРеквизиты.Добавить("Склад");
	ВыгружаемыеРеквизиты.Добавить("Согласован");
	ВыгружаемыеРеквизиты.Добавить("СпособДоставки");
	ВыгружаемыеРеквизиты.Добавить("УчетСырьяПоНазначениям");
	ВыгружаемыеРеквизиты.Добавить("ХозяйственнаяОперация");

	//Табличная часть "Товары"
	ВыгружаемыеРеквизиты.Добавить("Товары.Номенклатура");
	ВыгружаемыеРеквизиты.Добавить("Товары.КоличествоУпаковок");
	ВыгружаемыеРеквизиты.Добавить("Товары.Количество");
	ВыгружаемыеРеквизиты.Добавить("Товары.Склад");
	ВыгружаемыеРеквизиты.Добавить("Товары.ИдентификаторСтроки");
	ВыгружаемыеРеквизиты.Добавить("Товары.АналитикаУчетаНоменклатуры");

	//Табличная часть "ВидыЗапасов"
	ВыгружаемыеРеквизиты.Добавить("ВидыЗапасов.ВидЗапасов");
	ВыгружаемыеРеквизиты.Добавить("ВидыЗапасов.КоличествоУпаковок");
	ВыгружаемыеРеквизиты.Добавить("ВидыЗапасов.Количество");
	ВыгружаемыеРеквизиты.Добавить("ВидыЗапасов.ИдентификаторСтроки");
	ВыгружаемыеРеквизиты.Добавить("ВидыЗапасов.Склад");
	ВыгружаемыеРеквизиты.Добавить("ВидыЗапасов.АналитикаУчетаНоменклатуры");

	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

#КонецОбласти //СлужебныеПроцедурыИФункции