
#Область ОбработчикиСобытийФормы

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	
	бг_ДобавитьРеквизитыФормы();
	бг_ЗаполнитьСлужебныеДанные();
	
КонецПроцедуры

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		бг_ДобавитьРеквизитыФормы();
		бг_ЗаполнитьСлужебныеДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьПоляДвижениеМарок();
	
	бг_УстановитьВидимостьПолейАлкогольнойПродукции();
	
КонецПроцедуры

&НаСервере
Процедура бг_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	бг_УстановитьВидимостьПолейАлкогольнойПродукции();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура бг_ПроверкаПриходуемыхШтрихкодовНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		
		ОповещениеПоЗавершении = Новый ОписаниеОповещения(
			"бг_ПроверкаПриходуемыхШтрихкодовНажатиеПослеВопроса",
			ЭтотОбъект);
		
		ПоказатьВопрос(
			ОповещениеПоЗавершении,
			НСтр("ru='Документ предварительно необходимо записать. Записать?'"),
			РежимДиалогаВопрос.ДаНет);
			
	Иначе
			
		бг_ПроверкаПриходуемыхШтрихкодовНажатиеЗавершение();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ПроверкаПриходуемыхШтрихкодовНажатиеПослеВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);

	бг_ПроверкаПриходуемыхШтрихкодовНажатиеЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ПроверкаПриходуемыхШтрихкодовНажатиеЗавершение()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АктПостановкиНаБалансЕГАИС", Объект.Ссылка);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "ПриходуемыеМарки");
	
	ОткрытьФорму(
		"Отчет.бг_АнализПриходуемыхМарок.ФормаОбъекта",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьРеквизитыФормы()
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "бг_ЭтоКонтролерЕГАИС") Тогда
		
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы(
				"бг_ЭтоКонтролерЕГАИС",
				Новый ОписаниеТипов("Булево")));
	
	КонецЕсли;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПоляДвижениеМарок()
	
	ГиперссылкаПроверкиПриходуемыхШтрихкодов = бг_ГиперссылкаПроверкиПриходуемыхШтрихкодов();
	
КонецПроцедуры

&НаСервере
Процедура бг_ЗаполнитьСлужебныеДанные()
	
	ЭтотОбъект["бг_ЭтоКонтролерЕГАИС"] = РольДоступна("бг_КонтролерЕГАИС");
	
КонецПроцедуры

&НаСервере
Процедура бг_УстановитьВидимостьПолейАлкогольнойПродукции()
	
	Элементы.ГруппаСканированиеИПроверкаАлкогольнойПродукции.Видимость = Ложь;
	Элементы.ТоварыИндексАкцизнойМарки.Видимость = Ложь;
	
	бг_ГиперссылкаПроверкиПриходуемыхШтрихкодов().Видимость =
		ЗначениеЗаполнено(Объект.Ссылка)
		И бг_ИнтеграцияЕГАИСПовтИсп.ИспользоватьМеханизмДвиженийМарок(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Функция бг_ГиперссылкаПроверкиПриходуемыхШтрихкодов()
	
	ГиперссылкаПроверкиПриходуемыхШтрихкодов = Элементы.Найти("бг_ПроверкаПриходуемыхШтрихкодов");
	Если ГиперссылкаПроверкиПриходуемыхШтрихкодов <> Неопределено Тогда
		Возврат ГиперссылкаПроверкиПриходуемыхШтрихкодов;
	КонецЕсли;
	
	ГиперссылкаПроверкиПриходуемыхШтрихкодов = Элементы.Вставить(
		"бг_ПроверкаПриходуемыхШтрихкодов",
		Тип("ДекорацияФормы"),
		Элементы.СтраницаТовары,
		Элементы.ГруппаСканированиеИПроверкаАлкогольнойПродукции);
		
	ГиперссылкаПроверкиПриходуемыхШтрихкодов.Вид = ВидДекорацииФормы.Надпись;
	ГиперссылкаПроверкиПриходуемыхШтрихкодов.Гиперссылка = Истина;
	ГиперссылкаПроверкиПриходуемыхШтрихкодов.Заголовок = НСтр("ru='Проверить приходуемые штрихкоды'");
	ГиперссылкаПроверкиПриходуемыхШтрихкодов.УстановитьДействие("Нажатие", "бг_ПроверкаПриходуемыхШтрихкодовНажатие");
	
	Возврат ГиперссылкаПроверкиПриходуемыхШтрихкодов;
	
КонецФункции

#Область СканированиеАлкогольнойПродукции

&НаСервере
&После("ОбновитьИнформациюОткрытияФормыСканирования")
Процедура бг_ОбновитьИнформациюОткрытияФормыСканирования()
	
	бг_УстановитьВидимостьПолейАлкогольнойПродукции();
	
КонецПроцедуры

#КонецОбласти // Конец СканированиеАлкогольнойПродукции

#КонецОбласти
