#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	СтандартнаяОбработка = Ложь;
	ЗагружаемыйОбъект.Наименование = СтруктураОбъекта.Наименование;
	ЗагружаемыйОбъект.ЛицензионнаяКарточкаНомер = СтруктураОбъекта.НомерЛицензионнойКарточки;
	ЗагружаемыйОбъект.ЛицензионнаяКарточкаСерия = СтруктураОбъекта.СерияЛицензионнойКарточки;
	ЗагружаемыйОбъект.ЛицензионнаяКарточкаВид = СтруктураОбъекта.алкВидЛицензионнойКарточки;
	ЗагружаемыйОбъект.ЛицензионнаяКарточкаРегистрационныйНомер = СтруктураОбъекта.ЛицензионнаяКарточка;
	
	КоличествоКГВТоннах = 1000;
	Если ТипЗнч(СтруктураОбъекта.Модель) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтруктураОбъекта.Модель.Грузоподъемность) Тогда
			ЗагружаемыйОбъект.ГрузоподъемностьВТоннах = СтруктураОбъекта.Модель.Грузоподъемность / КоличествоКГВТоннах;
		КонецЕсли;
		ЗагружаемыйОбъект.ВместимостьВКубическихМетрах = СтруктураОбъекта.Модель.ОбъемКузова;
	КонецЕсли;
	
	ЗагружаемыйОбъект.Код = СтруктураОбъекта.ГосударственныйНомер;
	
	ЗагружаемыйОбъект.бг_Прицеп = адаптер_РаботаСДаннымиИБ.ПолучитьЗначениеРеквизита( 
		СтруктураОбъекта.алкПрицеп);
	
КонецПроцедуры

#КонецОбласти

