
Функция ВидМаркиПоУмолчанию() Экспорт

	Возврат бг_КонстантыПовтИсп.ЗначениеКонстанты("ВидМаркиСерииНоменклатурыПоУмолчанию");	

КонецФункции

Функция ВидМаркиСтарая() Экспорт

	Возврат бг_КонстантыПовтИсп.ЗначениеКонстанты("ВидМаркиСерииНоменклатурыСтарая");	

КонецФункции

// Функция - Это старая марка
//
// Параметры:
//  ИдентификаторМарки	 - Строка - Строковое представление идентификатора марки
// 
// Возвращаемое значение:
// Булево - Истина, если старая марка, Ложь в противном случае
//
Функция ЭтоСтараяМарка(ИдентификаторМарки) Экспорт
	
	ЭтоСтараяМарка = Ложь;
	Если ЗначениеЗаполнено(ИдентификаторМарки) 
		И ТипЗнч(ИдентификаторМарки) = Тип("Строка") И СтрДлина(ИдентификаторМарки) < 150 Тогда
		ЭтоСтараяМарка = Истина;
	КонецЕсли;
	
	Возврат ЭтоСтараяМарка;
	
КонецФункции
