
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура бг_ДобавитьЭлементыФормы()
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ГруппаПартнера",
		Элементы.ГруппаРодительБизнесРегион,
		"Объект.бг_ГруппаПартнера");
		
	Элемент.АвтоМаксимальнаяШирина = Истина;
	Элемент.РастягиватьПоГоризонтали = Ложь;
	Элемент.Ширина = 27;
					
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КатегорияМакетовПечатныхФорм",
		Элементы.ГруппаДополнительныеРеквизиты,
		"Объект.бг_КатегорияМакетовПечатныхФорм");
		
	Элемент.АвтоМаксимальнаяШирина = Истина;
	Элемент.РастягиватьПоГоризонтали = Ложь;
	Элемент.Ширина = 27; 
	
КонецПроцедуры

#КонецОбласти
