#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()
	
	ВыгружаемыеРеквизиты = Новый Массив;
	
	ВыгружаемыеРеквизиты.Добавить("Предопределенный");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("бг_КодНСИ");
	ВыгружаемыеРеквизиты.Добавить("бг_Апелласьон");
	ВыгружаемыеРеквизиты.Добавить("бг_Артикул");
	ВыгружаемыеРеквизиты.Добавить("бг_Бренд");
	ВыгружаемыеРеквизиты.Добавить("бг_БрендКУ");
	ВыгружаемыеРеквизиты.Добавить("бг_Вкус");
	ВыгружаемыеРеквизиты.Добавить("бг_ВПодарочнойУпаковке");
	ВыгружаемыеРеквизиты.Добавить("бг_Выбыл");
	ВыгружаемыеРеквизиты.Добавить("бг_ДегустационныеХарактеристики");
	ВыгружаемыеРеквизиты.Добавить("бг_Добавлен");
	ВыгружаемыеРеквизиты.Добавить("бг_ДоляСпирта");
	ВыгружаемыеРеквизиты.Добавить("бг_ДоляСпиртаДо");
	ВыгружаемыеРеквизиты.Добавить("бг_ЕдиницаИзмерения");
	ВыгружаемыеРеквизиты.Добавить("бг_КатегорияВладельца");
	ВыгружаемыеРеквизиты.Добавить("бг_КатегорияМотивации");
	ВыгружаемыеРеквизиты.Добавить("бг_Класс");
	ВыгружаемыеРеквизиты.Добавить("бг_НаименованиеПоСертификатуАнг");
	ВыгружаемыеРеквизиты.Добавить("бг_НаименованиеПоСертификатуРус");
	ВыгружаемыеРеквизиты.Добавить("бг_НаЭкспорт");
	ВыгружаемыеРеквизиты.Добавить("бг_НоменклатурнаяГруппа");
	ВыгружаемыеРеквизиты.Добавить("бг_Объем");
	ВыгружаемыеРеквизиты.Добавить("бг_Предшественник");
	ВыгружаемыеРеквизиты.Добавить("бг_ПромоНаборСобственнойСборки");
	ВыгружаемыеРеквизиты.Добавить("бг_РегионПроисхождения");
	ВыгружаемыеРеквизиты.Добавить("бг_Рейтинги");
	ВыгружаемыеРеквизиты.Добавить("бг_СкюМТ");
	ВыгружаемыеРеквизиты.Добавить("бг_СортовойСостав");
	ВыгружаемыеРеквизиты.Добавить("бг_Состояние");
	ВыгружаемыеРеквизиты.Добавить("бг_Статус");
	
	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

Функция НаименованиеНаЭкспортИстина()
	
	Возврат "да";
	
КонецФункции

Функция НаименованиеНаЭкспортЛожь()
	
	Возврат "нет";
	
КонецФункции

#КонецОбласти
