#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьСвязанныеОбъекты(НаборЗаписей) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаРегистраторов = НаборЗаписей.Выгрузить(, "Регистратор");
	ТаблицаРегистраторов.Свернуть("Регистратор");
	Регистраторы = ТаблицаРегистраторов.ВыгрузитьКолонку("Регистратор");
	
	ТипыРегистраторовКВыгрузке = ТипыРегистраторовКВыгрузке();
	
	Для Каждого Регистратор Из Регистраторы Цикл
		Если ТипыРегистраторовКВыгрузке.Найти(ТипЗнч(Регистратор)) <> Неопределено Тогда
			бг_ОбщегоНазначенияСервер.ЗарегистрироватьИсходящееСообщениеПриЗаписи(Регистратор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // Конец ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ТипыРегистраторовКВыгрузке()
	
	ТипыРегистраторовКВыгрузке = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бг_МоментальноеФормированиеПроводок.ИмяДокумента КАК ИмяДокумента
		|ИЗ
		|	РегистрСведений.бг_МоментальноеФормированиеПроводок КАК бг_МоментальноеФормированиеПроводок
		|ГДЕ
		|	бг_МоментальноеФормированиеПроводок.ФормироватьПроводкиСразу";
	
	РезультатЗапроса = Запрос.Выполнить();
	тзДокументыСМоменатльнымФормированиемПроводок = РезультатЗапроса.Выгрузить();
	тзДокументыСМоменатльнымФормированиемПроводок.Индексы.Добавить("ИмяДокумента");
	
	Если тзДокументыСМоменатльнымФормированиемПроводок.Найти("АвансовыйОтчет", "ИмяДокумента") 
		= Неопределено Тогда
		ТипыРегистраторовКВыгрузке.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	КонецЕсли;
	Если тзДокументыСМоменатльнымФормированиемПроводок.Найти("ВнутреннееПотреблениеТоваров", "ИмяДокумента") 
		= Неопределено Тогда
		ТипыРегистраторовКВыгрузке.Добавить(Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров"));
	КонецЕсли;
	Если тзДокументыСМоменатльнымФормированиемПроводок.Найти("ПриобретениеУслугПрочихАктивов", "ИмяДокумента") 
		= Неопределено Тогда
		ТипыРегистраторовКВыгрузке.Добавить(Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов"));
	КонецЕсли;
	
	Возврат ТипыРегистраторовКВыгрузке;
	
КонецФункции

#КонецОбласти // Конец СлужебныеПроцедурыИФункции
