
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	Реквизиты = ВыгружаемыеРеквизиты();
	
	адаптер_НастройкиОбмена.УстановитьРеквизиты(
		РеквизитыИСвойства, 
		РеквизитыИСвойства.МетаданныеОбъекта, 
		Реквизиты);
				
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Стандартные реквизиты
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	
	// Шапка
	ВыгружаемыеРеквизиты.Добавить("БанковскийСчет");
	ВыгружаемыеРеквизиты.Добавить("БанковскийСчетКомиссии");
	ВыгружаемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
	ВыгружаемыеРеквизиты.Добавить("БанковскийСчетПроцентов");
	ВыгружаемыеРеквизиты.Добавить("бг_ВидВзаиморасчетов");
	ВыгружаемыеРеквизиты.Добавить("ВалютаВзаиморасчетов");
	ВыгружаемыеРеквизиты.Добавить("ГруппаФинансовогоУчета");
	ВыгружаемыеРеквизиты.Добавить("ГруппаФинансовогоУчетаДенежныхСредств");
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("ДатаПервогоТранша");
	ВыгружаемыеРеквизиты.Добавить("ДатаПоследнегоПлатежа");
	ВыгружаемыеРеквизиты.Добавить("Касса");
	ВыгружаемыеРеквизиты.Добавить("КодРаздел7ДекларацииНДС");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	ВыгружаемыеРеквизиты.Добавить("Контрагент");
	ВыгружаемыеРеквизиты.Добавить("НаименованиеДляПечати");
	ВыгружаемыеРеквизиты.Добавить("НаправлениеДеятельности");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("ОплатаВВалюте");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("Ответственный");
	ВыгружаемыеРеквизиты.Добавить("Партнер");
	ВыгружаемыеРеквизиты.Добавить("Подразделение");
	ВыгружаемыеРеквизиты.Добавить("Согласован");
	ВыгружаемыеРеквизиты.Добавить("СрокДней");
	ВыгружаемыеРеквизиты.Добавить("СрокМес");
	ВыгружаемыеРеквизиты.Добавить("Статус");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДДСКомиссии");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДДСОсновногоДолга");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДДСПоступленияВыдачи");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДДСПроцентов");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДоходовРасходовКомиссии");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДоходовРасходовПроцентов");
	ВыгружаемыеРеквизиты.Добавить("СуммаКомиссии");
	ВыгружаемыеРеквизиты.Добавить("СуммаЛимита");
	ВыгружаемыеРеквизиты.Добавить("СуммаПроцентов");
	ВыгружаемыеРеквизиты.Добавить("СуммаТраншей");
	ВыгружаемыеРеквизиты.Добавить("ТипДоговора");
	ВыгружаемыеРеквизиты.Добавить("ТипКомиссии");
	ВыгружаемыеРеквизиты.Добавить("ТипПлатежаФЗ275");
	ВыгружаемыеРеквизиты.Добавить("ТипСрочности");
	ВыгружаемыеРеквизиты.Добавить("УдалитьПорядокОплаты");
	ВыгружаемыеРеквизиты.Добавить("УникальныйНомерВалютногоКонтроля");
	ВыгружаемыеРеквизиты.Добавить("ФормаОплаты");
	ВыгружаемыеРеквизиты.Добавить("ХарактерДоговора");
			
	Возврат ВыгружаемыеРеквизиты;

КонецФункции

#КонецОбласти
