#Область ОбработчикиКоманды

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбработатьКомандуНаСервере(ПараметрКоманды);
	Оповестить("ЗагрузкаДанныхИзФайлаАСУ");
КонецПроцедуры

&НаСервере
Процедура ОбработатьКомандуНаСервере(ПараметрКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.битДанныеПриборовАСИиУ") Тогда
		МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		МассивДокументов = ПараметрКоманды;
	Иначе
		Возврат;
	КонецЕсли;
	ОбработатьМассивДокументов(МассивДокументов);
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьМассивДокументов(МассивДокументов)
	Для каждого ДокументСсылка Из МассивДокументов Цикл
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Документы.битДанныеПриборовАСИиУ.ЗаполнитьДокументПоДаннымФайла(ДокументОбъект);
		ДокументОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти 
