
#Область СлужебныйПрограммныйИнтерфейс

#Область МодификацияФормы

&После("ПослеЗаписиНаСервере")
// Создан по аналогии с кодом типовой процедуры ПослеЗаписиНаСервере модуля формы
//
Процедура бг_ПослеЗаписиНаСервере(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Документ.ВозвратТоваровОтКлиента.Форма.ФормаДокумента" Тогда
	
		ТТН = Форма.бг_ТТНВходящаяЕГАИС;
		Если ЗначениеЗаполнено(ТТН)
			И Не ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТТН, "ДокументОснование")) Тогда
			
			ИнтеграцияЕГАИСВызовСервера.ЗаписатьСвязьДокументаПоступленияИТТНЕГАИС(
				ТТН,
				Форма.Объект.Ссылка);
		Иначе
			ТТН = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
