#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()
	
	ВыгружаемыеРеквизиты = Новый Массив;
	
	ВыгружаемыеРеквизиты.Добавить("Предопределенный");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("Производитель");
	ВыгружаемыеРеквизиты.Добавить("бг_КодНСИ");
	ВыгружаемыеРеквизиты.Добавить("бг_КатегорияБренда");
	ВыгружаемыеРеквизиты.Добавить("бг_Проект");
	ВыгружаемыеРеквизиты.Добавить("бг_БрендТМ");
	ВыгружаемыеРеквизиты.Добавить("бг_БрендМТ");
	ВыгружаемыеРеквизиты.Добавить("бг_БрендКУ");
	ВыгружаемыеРеквизиты.Добавить("бг_КатегорияМотивации");
	ВыгружаемыеРеквизиты.Добавить("бг_КатегорияВладельца");
	ВыгружаемыеРеквизиты.Добавить("бг_ПроектПЭО");
	
	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

#КонецОбласти
