
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись из ЭтотОбъект Цикл
		Если Запись.Получатель <> Неопределено И Запись.Получатель.Пустая() Тогда
			Запись.Получатель = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	ОтборПолучателя = Отбор.Найти("Получатель");
	Если ОтборПолучателя <> Неопределено И ОтборПолучателя.Использование Тогда
		Если ОтборПолучателя.Значение <> Неопределено И ОтборПолучателя.Значение.Пустая() Тогда
			ОтборПолучателя.Значение = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
