#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)   
	
	Если Параметры.Свойство("Автотест") Тогда
		Возврат;
	КонецЕсли;
	
	бг_ДобавитьЭлементыКонтрагентИДоговор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьЭлементыКонтрагентИДоговор()
	
	бг_Контрагент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"НачисленнаяЗарплатаИВзносы_бг_Контрагент",
		Элементы.НачисленнаяЗарплатаИВзносы,
		"Объект.НачисленнаяЗарплатаИВзносы.бг_Контрагент");  
		
	бг_ДоговорКонтрагента = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"НачисленнаяЗарплатаИВзносы_бг_ДоговорКонтрагента",
		Элементы.НачисленнаяЗарплатаИВзносы,
		"Объект.НачисленнаяЗарплатаИВзносы.бг_ДоговорКонтрагента");  

	бг_Контрагент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"НачисленныйНДФЛ_бг_Контрагент",
		Элементы.НачисленныйНДФЛ,
		"Объект.НачисленныйНДФЛ.бг_Контрагент");  
		
	бг_ДоговорКонтрагента = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"НачисленныйНДФЛ_бг_ДоговорКонтрагента",
		Элементы.НачисленныйНДФЛ,
		"Объект.НачисленныйНДФЛ.бг_ДоговорКонтрагента");  
	
КонецПроцедуры

#КонецОбласти
