#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		                                                             "СобственныеТоварыХарактеристика",
		                                                             "Видимость",
		                                                             Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
