
#Область ПрограммныйИнтерфейс

Функция НайтиСсылкуПоЗагружаемымДанным(СтруктураОбъекта) Экспорт
	
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	Если СтруктураОбъекта.ЗначениеПеречисления = "НеТребуется" Тогда
		СтруктураОбъекта.ЗначениеПеречисления = "Автосогласование";
	КонецЕсли;
	
	Возврат адаптер_РаботаСДаннымиИБ.НайтиСсылкуПоЗагружаемымДанным(СтруктураОбъекта);
	
КонецФункции

#КонецОбласти // Конец ПрограммныйИнтерфейс
