#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
    бг_ДобавитьЭлементыДанныхУПП();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеквизитыДокумента

&НаСервере
Процедура бг_ДобавитьЭлементыДанныхУПП()
	
	бг_НомерДокументаУПП = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"бг_НомерДокументаУПП",
		Элементы.ГруппаШапкаПраво,
		"Объект.бг_НомерДокументаУПП",
		"ПолеФормы");
	бг_НомерДокументаУПП.ТолькоПросмотр = Истина;
	бг_НомерДокументаУПП.АвтоМаксимальнаяШирина = Ложь;
	бг_НомерДокументаУПП.МаксимальнаяШирина = 28;
	
КонецПроцедуры

#КонецОбласти // Конец РеквизитыДокумента

#КонецОбласти