#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Покупатель не должен хранить пустых ссылок 
	Если ЭтотОбъект.Количество() > 0
		И Отбор.Найти("Покупатель") <> Неопределено Тогда
		Покупатель = Отбор.Покупатель.Значение;
		Если Не ЗначениеЗаполнено(Покупатель)
			И Покупатель <> Неопределено Тогда
			Отбор.Покупатель.Значение = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Покупатель)
			И Запись.Покупатель <> Неопределено Тогда
			Запись.Покупатель = Неопределено;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти