
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.УстановитьРеквизиты(
		РеквизитыИСвойства, 
		РеквизитыИСвойства.МетаданныеОбъекта, 
		ВыгружаемыеРеквизиты());		
			
КонецПроцедуры


#КонецОбласти // Конец ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;   
	ВыгружаемыеРеквизиты.Добавить("Наименование"); 
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления"); 
		
	Возврат ВыгружаемыеРеквизиты;

КонецФункции

#КонецОбласти // Конец СлужебныеПроцедурыИФункции