#Область ПрограммныйИнтерфейс

// Возвращает массив, ссылок на лицензии пункта назначения
// Параметры:
//  ПунктНазначения - СправочникСсылка.битПунктыНазначения;
//  ДатаЗапроса - Дата - дата для отбора лицензий по дате прекращения действия
//  ТолькоДействующие - Булево - Если Истина - в результат попадут только действующие лицензии
// 
// Возвращаемое значение:
//  Массив - лицензии привязанные к пункту назначения
//
Функция ЛицензииПунктаНазначения(ПунктНазначения, ДатаЗапроса = Неопределено, ТолькоДействующие = Истина) Экспорт
	
	Возврат бг_УчетАлкоголя.ЛицензииПунктаНазначения(ПунктНазначения, ДатаЗапроса, ТолькоДействующие);
	
КонецФункции

// Возвращает ссылку на действующую лицензию пункта назначения на дату запроса
// Параметры:
//	ПунктНазначения - СправочникСсылка.битПунктыНазначения;
//	ДатаЗапроса - Дата;
//
Функция ТекущаяЛицензияПунктаНазначения(ПунктНазначения, ДатаЗапроса = Неопределено) Экспорт
	
	Возврат бг_УчетАлкоголя.ТекущаяЛицензияПунктаНазначения(ПунктНазначения, ДатаЗапроса);
	
КонецФункции

#КонецОбласти
