#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	бг_СерииНоменклатуры.ДобавитьРеквизитыФСМ(ЭтотОбъект);
	бг_СерииНоменклатуры.ДобавитьРеквизитыФСМ(ЭтотОбъект, "ОстаткиСерий");
	бг_СерииНоменклатуры.ДобавитьПоляФСМ(ЭтотОбъект, Элементы.ГруппаСерииРеквизитыЛокализации);
	бг_СерииНоменклатуры.ДобавитьКолонкиФСМ(ЭтотОбъект, Элементы.ОстаткиСерий);
КонецПроцедуры

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	бг_ДобавитьУбратьРеквизиты();	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьУбратьРеквизиты()
	ПолеНаименование = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
				ЭтотОбъект,
				"бг_ОстаткиСерийСерияНаименование",
				Элементы.ОстаткиСерий,
				"ОстаткиСерий.Серия.Наименование",
				,
				Элементы.ОстаткиСерийДатаПроизводства);
	ПолеНаименование.Заголовок = НСтр("ru='Серия'"); 
	
	Элементы.ОстаткиСерийСправка2ЕГАИС.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти 
