#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	бг_ДобавитьЭлементыДоговора();
	бг_ДобавитьЭлементыКлючевойКлиент();
	бг_ДобавитьЭлементыДляДолгосрочныхРезервов();
	бг_ДобавитьЭлементыТрансфертныхПродаж();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьЭлементыДоговора()
		
	бг_Договор = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Договор",
		Элементы.ГруппаШапкаПраво,
		"Объект.бг_Договор");
	бг_Договор.АвтоМаксимальнаяШирина = Ложь;
	бг_Договор.МаксимальнаяШирина 	  = 28;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьЭлементыКлючевойКлиент()
		
	бг_КлючевойКлиент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КлючевойКлиент",
		Элементы.ГруппаШапкаПраво,
		"Объект.бг_КлючевойКлиент");
	бг_КлючевойКлиент.АвтоМаксимальнаяШирина = Ложь;
	бг_КлючевойКлиент.МаксимальнаяШирина 	  = 28;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьЭлементыДляДолгосрочныхРезервов()
	
	Если Не Объект.бг_ДляДолгосрочныхРезервов Тогда
		Возврат;
	КонецЕсли;
	
	бг_ДляДолгосрочныхРезервов = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ДляДолгосрочныхРезервов",
		Элементы.ГруппаШапкаПраво,
		"Объект.бг_ДляДолгосрочныхРезервов",
		,
		,
		"ПолеФлажка"
		);
		
	бг_ДляДолгосрочныхРезервов.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьЭлементыТрансфертныхПродаж()
	
	бг_ПрименятьСкидкиПриТрансфертнойПродаже = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ПрименятьСкидкиПриТрансфертнойПродаже",
		Элементы.ГруппаПрочиеУсловия,
		"Объект.бг_ПрименятьСкидкиПриТрансфертнойПродаже",
		,
		,
		"ПолеФлажка"
		);
		
	бг_ПрименятьСкидкиПриТрансфертнойПродаже.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции 