
&После("ПриЗаполненииСписковСОграничениемДоступа")
Процедура бг_ПриЗаполненииСписковСОграничениемДоступа(Списки)
	
	Списки.Вставить(Метаданные.Документы.битАктОбУничтоженииФСМ, Истина);
	Списки.Вставить(Метаданные.Документы.битДанныеПриборовАСИиУ, Истина);
	Списки.Вставить(Метаданные.Документы.битДанныеСПроизводственнойЛинии, Истина);
	Списки.Вставить(Метаданные.Документы.битДобавлениеНовойПродукцииЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.битЗаявкаКлиента, Истина);
	Списки.Вставить(Метаданные.Документы.битЗаявлениеОВыдачеФСМ, Истина);
	Списки.Вставить(Метаданные.Документы.битИнвентаризацияПродукцииЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.битКомплектацияПродукцииЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.битНакладнаяНаВыдачуФСМ, Истина);
	Списки.Вставить(Метаданные.Документы.битОтчетОбИмпортеПродукцииЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.битОтчетОПроизводствеЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.битПланируемыйВвозЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.битРасчетАвансовПоАкцизам, Истина);
	Списки.Вставить(Метаданные.Документы.битСертификацияНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Документы.битСписаниеПотерь, Истина);
	Списки.Вставить(Метаданные.Документы.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС, Истина);
	
КонецПроцедуры

&После("ПриЗаполненииВидовОграниченийПравОбъектовМетаданных")
Процедура бг_ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание)
	
	//Потенциальные RLS:
	// -Организация 	|(Организации)
	// -Подразделение 	|(Подразделения)
	// -Партнер 		|(ГруппыПартнеров)
	// -Склад 			|(Склады)
	
	Описание = Описание + "
	// битАктОбУничтоженииФСМ
	|Документ.битАктОбУничтоженииФСМ.Чтение.Организации
	|Документ.битАктОбУничтоженииФСМ.Изменение.Организации
	// битДанныеПриборовАСИиУ
	|Документ.битДанныеПриборовАСИиУ.Чтение.Организации
	|Документ.битДанныеПриборовАСИиУ.Изменение.Организации
	// битДанныеСПроизводственнойЛинии
	|Документ.битДанныеСПроизводственнойЛинии.Чтение.Организации
	|Документ.битДанныеСПроизводственнойЛинии.Изменение.Организации
	// битДобавлениеНовойПродукцииЕГАИС
	|Документ.битДобавлениеНовойПродукцииЕГАИС.Чтение.Организации
	|Документ.битДобавлениеНовойПродукцииЕГАИС.Изменение.Организации
	// битНакладнаяНаВыдачуФСМ
	|Документ.битНакладнаяНаВыдачуФСМ.Чтение.Организации
	|Документ.битНакладнаяНаВыдачуФСМ.Чтение.ГруппыПартнеров
	|Документ.битНакладнаяНаВыдачуФСМ.Чтение.Склады
	|Документ.битНакладнаяНаВыдачуФСМ.Изменение.Организации
	|Документ.битНакладнаяНаВыдачуФСМ.Изменение.ГруппыПартнеров
	|Документ.битНакладнаяНаВыдачуФСМ.Изменение.Склады
	// битЗаявлениеОВыдачеФСМ
	|Документ.битЗаявлениеОВыдачеФСМ.Чтение.Организации
	|Документ.битЗаявлениеОВыдачеФСМ.Изменение.Организации
	// битЗаявкаКлиента
	|Документ.битЗаявкаКлиента.Чтение.ГруппыПартнеров
	|Документ.битЗаявкаКлиента.Чтение.Организации
	|Документ.битЗаявкаКлиента.Изменение.ГруппыПартнеров
	|Документ.битЗаявкаКлиента.Изменение.Организации
	// битИнвентаризацияПродукцииЕГАИС
	|Документ.битИнвентаризацияПродукцииЕГАИС.Чтение.Организации
	|Документ.битИнвентаризацияПродукцииЕГАИС.Изменение.Организации
	// битКомплектацияПродукцииЕГАИС
	|Документ.битКомплектацияПродукцииЕГАИС.Чтение.Организации
	|Документ.битКомплектацияПродукцииЕГАИС.Изменение.Организации
	// битОтчетОбИмпортеПродукцииЕГАИС
	|Документ.битОтчетОбИмпортеПродукцииЕГАИС.Чтение.Организации
	|Документ.битОтчетОбИмпортеПродукцииЕГАИС.Изменение.Организации
	// битОтчетОПроизводствеЕГАИС
	|Документ.битОтчетОПроизводствеЕГАИС.Чтение.Организации
	|Документ.битОтчетОПроизводствеЕГАИС.Изменение.Организации
	// битПланируемыйВвозЕГАИС
	|Документ.битПланируемыйВвозЕГАИС.Чтение.Организации
	|Документ.битПланируемыйВвозЕГАИС.Изменение.Организации
	// битРасчетАвансовПоАкцизам
	|Документ.битРасчетАвансовПоАкцизам.Чтение.Организации
	|Документ.битРасчетАвансовПоАкцизам.Изменение.Организации
	// битСертификацияНоменклатуры
	|Документ.битСертификацияНоменклатуры.Чтение.Организации
	|Документ.битСертификацияНоменклатуры.Изменение.Организации
	// битСписаниеПотерь
	|Документ.битСписаниеПотерь.Чтение.Организации
	|Документ.битСписаниеПотерь.Чтение.Подразделения
	|Документ.битСписаниеПотерь.Чтение.Склады
	|Документ.битСписаниеПотерь.Изменение.Организации
	|Документ.битСписаниеПотерь.Изменение.Подразделения
	|Документ.битСписаниеПотерь.Изменение.Склады
	// битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС
	|Документ.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.Чтение.ГруппыПартнеров
	|Документ.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.Чтение.Организации
	|Документ.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.Изменение.ГруппыПартнеров
	|Документ.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.Изменение.Организации
	| ";
КонецПроцедуры
