Процедура ЗаполнитьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства, СтандартнаяОбработка) Экспорт
	
	Если бг_ОбщегоНазначенияСервер.ОтменитьЗагрузкуОбъекта(ЗагружаемыйОбъект, СтруктураОбъекта, Неопределено, Неопределено, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗагружаемыйОбъект.ЭтоНовый() Тогда
		ЗагружаемыйОбъект.Заполнить(Неопределено);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураОбъекта.ТипОрганизации.ЗначениеПеречисления) Тогда
		ЗагружаемыйОбъект.ТипОрганизации = Перечисления.ТипыОрганизацийЕГАИС[СтруктураОбъекта.ТипОрганизации.ЗначениеПеречисления];
	Иначе
		ЗагружаемыйОбъект.ТипОрганизации = Перечисления.ТипыОрганизацийЕГАИС.ПустаяСсылка();
	КонецЕсли;
	
	СтруктураОбъекта.ТипОрганизации = ЗагружаемыйОбъект.ТипОрганизации;
	
	Если ЗначениеЗаполнено(СтруктураОбъекта.ФорматОбмена.ЗначениеПеречисления) Тогда
		ЗагружаемыйОбъект.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС[СтруктураОбъекта.ФорматОбмена.ЗначениеПеречисления];
	Иначе
		ЗагружаемыйОбъект.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	КонецЕсли;
	
	СтруктураОбъекта.ФорматОбмена = ЗагружаемыйОбъект.ФорматОбмена;
	
КонецПроцедуры

Процедура ЗаполнитьМассивПроверяемыхРеквизитовБлокировки(МетаданныеОбъекта, МассивПроверяемыхРеквизитов, СтандартнаяОбработка) Экспорт
	
	МассивПроверяемыхРеквизитов.Добавить("Предопределенный");
	МассивПроверяемыхРеквизитов.Добавить("ПометкаУдаления");
	МассивПроверяемыхРеквизитов.Добавить("Код");
	МассивПроверяемыхРеквизитов.Добавить("Наименование");
	МассивПроверяемыхРеквизитов.Добавить("ТипОрганизации");
	МассивПроверяемыхРеквизитов.Добавить("НаименованиеПолное");
	МассивПроверяемыхРеквизитов.Добавить("ИНН");
	МассивПроверяемыхРеквизитов.Добавить("КПП");
	МассивПроверяемыхРеквизитов.Добавить("ИдентификаторОрганизацииТС");
	МассивПроверяемыхРеквизитов.Добавить("КодСтраны");
	МассивПроверяемыхРеквизитов.Добавить("КодРегиона");
	МассивПроверяемыхРеквизитов.Добавить("ПочтовыйИндекс");
	МассивПроверяемыхРеквизитов.Добавить("ПредставлениеАдреса");
	МассивПроверяемыхРеквизитов.Добавить("ФорматОбмена");
	
КонецПроцедуры

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	ИменаРеквизитов = "Наименование,Код,ПометкаУдаления,ТипОрганизации,НаименованиеПолное,ИНН,КПП,ИдентификаторОрганизацииТС,КодСтраны,КодРегиона,ПочтовыйИндекс,
					|ПредставлениеАдреса,Сопоставлено,СоответствуетОрганизации,Контрагент,ТорговыйОбъект,НаходитсяВСельскойМестности,ФорматОбмена,Адрес";
	ИменаРеквизитов = СтрЗаменить(ИменаРеквизитов, Символы.ПС, "");
	адаптер_НастройкиОбмена.ОставитьРеквизиты(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ИменаРеквизитов);
	
КонецПроцедуры
