
&ИзменениеИКонтроль("ПараметрыФормированияДокументов")
Функция бг_ПараметрыФормированияДокументов(ДополнительныеПараметры)

	ПараметрыФормирования = ПродажиВызовСервера.ПолучитьНастройкуКомплектаДокументов(ДополнительныеПараметры.КлючОбъекта);
#Вставка
    Если ДополнительныеПараметры.Свойство("Отпустил") Тогда
		ПараметрыФормирования.Вставить("Отпустил", ДополнительныеПараметры.Отпустил);
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("ОтпустилДолжность") Тогда
		ПараметрыФормирования.Вставить("ОтпустилДолжность", ДополнительныеПараметры.ОтпустилДолжность);
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("Руководитель") Тогда
		ПараметрыФормирования.Вставить("Руководитель", ДополнительныеПараметры.Руководитель);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ГлавныйБухгалтер") Тогда
		ПараметрыФормирования.Вставить("ГлавныйБухгалтер", ДополнительныеПараметры.ГлавныйБухгалтер);
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("Автор") Тогда
		ПараметрыФормирования.Вставить("Автор", ДополнительныеПараметры.Автор);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ДоверенностьНомер") Тогда
		ПараметрыФормирования.Вставить("ДоверенностьНомер", ДополнительныеПараметры.ДоверенностьНомер);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ДоверенностьДата") Тогда
		ПараметрыФормирования.Вставить("ДоверенностьДата", ДополнительныеПараметры.ДоверенностьДата);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ДоверенностьВыдана") Тогда
		ПараметрыФормирования.Вставить("ДоверенностьВыдана", ДополнительныеПараметры.ДоверенностьВыдана);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ДоверенностьЛицо") Тогда
		ПараметрыФормирования.Вставить("ДоверенностьЛицо", ДополнительныеПараметры.ДоверенностьЛицо);
	КонецЕсли;
#КонецВставки
	
	ПоОрдерам = Ложь;
	Если ДополнительныеПараметры.Свойство("ПоОрдерам") Тогда
		ПоОрдерам = ДополнительныеПараметры.ПоОрдерам;
	КонецЕсли;
	ПараметрыФормирования.Вставить("ПоОрдерам", ПоОрдерам);

	Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
	Если ДополнительныеПараметры.Свойство("Склад") Тогда
		Склад = ДополнительныеПараметры.Склад;
	КонецЕсли;
	ПараметрыФормирования.Вставить("Склад", Склад);

	ПараметрыФормирования.Вставить("УникальныйИдентификатор", ДополнительныеПараметры.Форма.УникальныйИдентификатор);

	Возврат ПараметрыФормирования;

КонецФункции
