
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	
КонецПроцедуры

#КонецОбласти    


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработатьРезультатВыбора();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийСписка

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьРезультатВыбора();

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции  

&НаКлиенте
Процедура ОбработатьРезультатВыбора()
	
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Ссылка);	
	
КонецПроцедуры

#КонецОбласти

