#Область ОбработчикиСобытий

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьРеквизитыНаФорму();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьРеквизитыНаФорму()
	
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КодБК",
		Элементы.ГруппаКонтактнаяИнформацияПредставление,
		"ФизическоеЛицо.бг_КодБК");
		
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Должность",
		Элементы.ОсновныеДанныеПраваяКолонка,
		"ФизическоеЛицо.бг_Должность",
		, // ТипЭлемента
		, // Элемент (предшествующий)
		"ПолеВвода");	
		
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Руководитель",
		Элементы.ОсновныеДанныеПраваяКолонка,
		"ФизическоеЛицо.бг_Руководитель",
		, // ТипЭлемента
		, // Элемент (предшествующий)
		"ПолеВвода");	
	
КонецПроцедуры

#КонецОбласти