#Область ПрограммныйИнтерфейс

// Заполняет таблицы выгружаемых реквизитов объектов в настройках выгрузки объектов
//
// Параметры:
//	РеквизитыИСвойства		- Структура - структура описания реквизитов и свойств выгружаемого объекта,
//								см. также адаптер_РаботаСМетаданными.РеквизитыИСвойстваОбъектаМетаданны()
//								и адаптер_РаботаСМетаданными.РеквизитыИСвойстваОбъектаМетаданныххСУчетомНастроек()
//	ФорматСообщения			- ПеречислениеСсылка.адаптер_ФорматыСообщений - формат сообщения, для которого необходимы настройки выгрузки
//	СтандартнаяОбработка	- Булево - признак необходимости дальнейшей обработки события в цепочке подписок
//
Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	Реквизиты = ВыгружаемыеРеквизиты();
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		Реквизиты);
		
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	
КонецПроцедуры

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей,
				ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Справка2_ЗначениеРеквизитаИдентификатор",
		"ВыгружаемыйОбъект.Товары.СерияОприходование.Справка2ЕГАИС
		|			КАК Справка2_ЗначениеРеквизитаИдентификатор");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Справка2_ЗначениеРеквизитаТаблицаКлючей",
		"ВыгружаемыйОбъект.Товары.СерияОприходование.Справка2ЕГАИС
		|			КАК Справка2_ЗначениеРеквизитаТаблицаКлючей");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Справка2_ЗначениеРеквизитаРегистрационныйНомер",
		"ВыгружаемыйОбъект.Товары.СерияОприходование.Справка2ЕГАИС.РегистрационныйНомер
		|			КАК Справка2_ЗначениеРеквизитаРегистрационныйНомер");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Справка1_ЗначениеРеквизитаИдентификатор",
		"ВыгружаемыйОбъект.Товары.СерияОприходование.Справка2ЕГАИС.Справка1
		|			КАК Справка1_ЗначениеРеквизитаИдентификатор");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Справка1_ЗначениеРеквизитаТаблицаКлючей",
		"ВыгружаемыйОбъект.Товары.СерияОприходование.Справка2ЕГАИС.Справка1
		|			КАК Справка1_ЗначениеРеквизитаТаблицаКлючей");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Справка1_ЗначениеРеквизитаРегистрационныйНомер",
		"ВыгружаемыйОбъект.Товары.СерияОприходование.Справка2ЕГАИС.Справка1.РегистрационныйНомер
		|			КАК Справка1_ЗначениеРеквизитаРегистрационныйНомер");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()
	
	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Шапка
	ВыгружаемыеРеквизиты.Добавить("бг_Основание");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Проведен");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("Подразделение");
	ВыгружаемыеРеквизиты.Добавить("Склад");
	ВыгружаемыеРеквизиты.Добавить("Ответственный");
	ВыгружаемыеРеквизиты.Добавить("Автор");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	
	// Товары
	ВыгружаемыеРеквизиты.Добавить("Товары.Номенклатура");
	ВыгружаемыеРеквизиты.Добавить("Товары.Серия");
	ВыгружаемыеРеквизиты.Добавить("Товары.Упаковка");
	ВыгружаемыеРеквизиты.Добавить("Товары.Количество");
	ВыгружаемыеРеквизиты.Добавить("Товары.НоменклатураОприходование");
	ВыгружаемыеРеквизиты.Добавить("Товары.СерияОприходование");
	ВыгружаемыеРеквизиты.Добавить("Товары.Цена");
	
	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства, 
		Метаданные.Документы.ТТНВходящаяЕГАИС, 
		"ДокументОснование",
		"ПеремещениеТоваров",
		Новый ОписаниеТипов("ДокументСсылка.ПеремещениеТоваров"));
	
	// Товары
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // МетаданныеОбъекта
		"Товары.Справка1",
		Новый ОписаниеТипов("СправочникСсылка.Справки1ЕГАИС"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // МетаданныеОбъекта
		"Товары.Справка2",
		Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
КонецПроцедуры

#КонецОбласти
