#Область ПрограммныйИнтерфейс

#Область ОтчетАнализЗаказовПокупателей

// Функция - Возвращает адрес с данными отчета
//
// Параметры:
//  КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных 
//  АдресСхемы - Строка 
// 
// Возвращаемое значение:
//   Строка - Адрес временного хранилища 
//
Функция ПодготовитьДанныеЗапросовИзСхемыКомпоновкиДанных(КомпоновщикНастроек, АдресСхемы) Экспорт
		
	Возврат Отчеты.бг_АнализЗаказовПокупателей.ПодготовитьДанныеЗапросовИзСхемыКомпоновкиДанных(
		КомпоновщикНастроек, 
		АдресСхемы);
	
КонецФункции

#КонецОбласти

#КонецОбласти