#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений сопоставленных видов транспортных расходов статья расходов
//
// Возвращаемое значение:
//   ТаблицаЗначение - содержит колонки:
//		*ВидТранспортныхРасходов - ПеречислениеСсылка.бг_ВидыТранспортныхРасходов - вид транспортных расходов
//		*СтатьяРасходов - ПланВидовРасходовСсылка.СтатьиРасходов - сопоставленная статья
//
Функция ПолучитьСоответствиеСтатей() Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ВидыТранспортныхРасходов.Ссылка КАК ВидТранспортныхРасходов,
	|	ЕСТЬNULL(бг_СоответствиеВидовТранспортныхРасходовСтатьямРасходов.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) КАК СтатьяРасходов
	|ИЗ
	|	Перечисление.бг_ВидыТранспортныхРасходов КАК бг_ВидыТранспортныхРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_СоответствиеВидовТранспортныхРасходовСтатьямРасходов КАК бг_СоответствиеВидовТранспортныхРасходовСтатьямРасходов
	|		ПО (бг_СоответствиеВидовТранспортныхРасходовСтатьямРасходов.ВидТранспортныхРасходов = бг_ВидыТранспортныхРасходов.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	бг_ВидыТранспортныхРасходов.Порядок";
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

#КонецОбласти