
#Область СлужебныйПрограммныйИнтерфейс

&После("ПолучитьТекущуюСтрокуСтруктурой")
Процедура бг_ПолучитьТекущуюСтрокуСтруктурой(СтруктураДействий, СтруктураПолейТЧ)
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСНДС") Тогда
		СтруктураПолейТЧ.Вставить("бг_ЦенаСоСкидкой", 0);
		СтруктураПолейТЧ.Вставить("бг_ПроцентПримененнойСкидки", 0);
		СтруктураПолейТЧ.Вставить("бг_СуммаПримененнойСкидки", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("бг_ЗаполнитьПризнакИспользоватьДатуПроизводстваСерии") Тогда
		СтруктураПолейТЧ.Вставить("бг_ИспользоватьДатуПроизводстваСерии", 0);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
