#Область ПрограммныйИнтерфейс

// Возвращает массив видов перевозки с самовывозом
//
// Параметры:
//  
// Возвращаемое значение:
//  Массив - СправочникСсылка.бг_ВидыПеревозки - виды перевозки самовывоз
//
Функция ВидыПеревозкиСамовывоз() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ВидыПеревозки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бг_ВидыПеревозки КАК бг_ВидыПеревозки
	|ГДЕ
	|	бг_ВидыПеревозки.Самовывоз";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

#КонецОбласти