#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Запись.Партнер) Тогда
		Запись.Соглашение = ПредопределенноеЗначение("Справочник.СоглашенияСПоставщиками.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУсловияЗакупокПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
	
	ЗаполнитьУсловияЗакупокПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаСервере
Процедура ЗаполнитьУсловияЗакупокПоУмолчанию()
	
	ОтборУсловийЗакупок			= Новый Структура("УчитыватьГруппыСкладов, ВыбранноеСоглашение", Истина, Запись.Соглашение);
	УсловияЗакупокПоУмолчанию	= ЗакупкиСервер.ПолучитьУсловияЗакупокПоУмолчанию(Запись.Партнер, ОтборУсловийЗакупок);
	
	Если УсловияЗакупокПоУмолчанию <> Неопределено Тогда
		
		Если Запись.Соглашение <> УсловияЗакупокПоУмолчанию.Соглашение
			И ЗначениеЗаполнено(УсловияЗакупокПоУмолчанию.Соглашение) Тогда
	
			Запись.Соглашение = УсловияЗакупокПоУмолчанию.Соглашение;
			ЗаполнитьУсловияЗакупок(УсловияЗакупокПоУмолчанию);
		
		Иначе
			
			Запись.Соглашение = УсловияЗакупокПоУмолчанию.Соглашение;
			ЗаполнитьУсловияЗакупок(УсловияЗакупокПоУмолчанию);
			
		КонецЕсли;
		
	Иначе
		
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Запись.Партнер, Запись.Контрагент);
		Запись.Соглашение = Неопределено;
		
		ХозяйственнаяОперацияДоговора = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(
			Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
		
		ДополнительныеПараметрыОтбораДоговоров = ЗакупкиСервер.ДополнительныеПараметрыОтбораДоговоров();
		Запись.Договор = ЗакупкиСервер.ПолучитьДоговорПоУмолчанию(Запись, 
			ХозяйственнаяОперацияДоговора, 
			ДополнительныеПараметрыОтбораДоговоров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловияЗакупок(Знач УсловияЗакупок)
	
	Если УсловияЗакупок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияЗакупок.Организация) И УсловияЗакупок.Организация <> Запись.Организация Тогда
		Организация = УсловияЗакупок.Организация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияЗакупок.Контрагент) Тогда
		Контрагент = УсловияЗакупок.Контрагент;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Запись.Партнер, Запись.Контрагент);
	
	ХозяйственнаяОперацияДоговора = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ХозяйственнаяОперацияДоговора = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(ХозяйственнаяОперацияДоговора);
	
	Если УсловияЗакупок.ИспользуютсяДоговорыКонтрагентов <> Неопределено
		И УсловияЗакупок.ИспользуютсяДоговорыКонтрагентов Тогда
		
		ДополнительныеПараметрыОтбораДоговоров = ЗакупкиСервер.ДополнительныеПараметрыОтбораДоговоров();
		Запись.Договор = ЗакупкиСервер.ПолучитьДоговорПоУмолчанию(Запись, 
			ХозяйственнаяОперацияДоговора, 
			ДополнительныеПараметрыОтбораДоговоров);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
