#Область ОбработчикиКомандФормы
	
&НаСервере
Процедура СформироватьНаСервере()
	ТаблицаРезультат.Очистить();  
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыБордеро = ПараметрыФормированияОтчета();
	ТаблицаРезультат = ОбработкаОбъект.ЕженедельныйБордеро(ПараметрыБордеро);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыФормированияОтчета()
	Результат = Новый Структура;
	Результат.Вставить("ДатаНачала", ПериодБордеро.ДатаНачала);
	Результат.Вставить("ДатаОкончания", ПериодБордеро.ДатаОкончания);
	Результат.Вставить("ТипРейса", ТипРейса);
	Результат.Вставить("ТипДоставки", ТипДоставки);
	Результат.Вставить("Организация", Организация);
	Результат.Вставить("Склад", Склад);
	Результат.Вставить("СтраховаяСуммаМинимум", СтраховаяСуммаМинимум);
	Результат.Вставить("СтраховаяСуммаМаксимум", СтраховаяСуммаМаксимум);
	Возврат Результат;
КонецФункции

#КонецОбласти