#Область ОбработчикиСобытий

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	бг_ДобавитьПоляНастройкиОбеспечения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьПоляНастройкиОбеспечения()
	бг_ГруппаСпособыОбеспечения = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
				ЭтотОбъект, "бг_ГруппаСпособыОбеспечения", ЭтотОбъект);
	бг_ГруппаСпособыОбеспечения.Заголовок = НСтр("ru = 'Способы обеспечения потребностей'");
	бг_ГруппаСпособыОбеспечения.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	бг_ГруппаСпособыОбеспечения.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	бг_ТаблицаСпособыОбеспечения = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьТаблицуНаФорму(
				ЭтотОбъект, "бг_ТаблицаСпособыОбеспечения", бг_ГруппаСпособыОбеспечения, "Объект.бг_СпособыОбеспеченияПотребности");
	
	бг_ТаблицаСпособыОбеспеченияСклад = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ТаблицаСпособыОбеспеченияСклад",
		бг_ТаблицаСпособыОбеспечения,
		"Объект.бг_СпособыОбеспеченияПотребности.Склад");
		
	бг_ТаблицаСпособыОбеспеченияСпособОбеспеченияПотребностей = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ТаблицаСпособыОбеспеченияСпособОбеспеченияПотребностей",
		бг_ТаблицаСпособыОбеспечения,
		"Объект.бг_СпособыОбеспеченияПотребности.СпособОбеспеченияПотребностей");
КонецПроцедуры

#КонецОбласти
