
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура бг_НоменклатураПриИзмененииПосле(Элемент)
	
	УчетОстатковИРезервовВРазрезеУпаковок = бг_ВедетсяУчетОстатковИРезервовВРазрезеУпаковокПаллет(Номенклатура);
	
	Если УчетОстатковИРезервовВРазрезеУпаковок Тогда
		Элементы.Характеристика.БыстрыйВыбор = Истина;
	Иначе	
	    Элементы.Характеристика.БыстрыйВыбор = Ложь;
	КонецЕсли;
	
	ХарактеристикиИспользуются =
	    ХарактеристикиИспользуются
		Или УчетОстатковИРезервовВРазрезеУпаковок;
	
	Элементы.Характеристика.Доступность = ХарактеристикиИспользуются;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция бг_ВедетсяУчетОстатковИРезервовВРазрезеУпаковокПаллет(Номенклатура)

	Возврат бг_Номенклатура.ВедетсяУчетОстатковИРезервовВРазрезеУпаковокПаллет(Номенклатура);
	
КонецФункции	

#КонецОбласти
