
&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	ИменаФлажков = СтрРазделить(
		"бг_КонтролироватьУстановкуМРЦ,
		|бг_КонтролироватьКрепость,
		|бг_ИспользоватьПрочуюАлкогольнуюПродукцию",
		",
		|",
		Ложь
	);
	
	Для каждого ИмяФлажка из ИменаФлажков Цикл
		ЭлементФормы = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
			ЭтаФорма,
			СокрЛП(ИмяФлажка),
			ЭтаФорма,
			"Объект." + СокрЛП(ИмяФлажка),
			, // Тип поля, строка
			, // Элемент перед которым будет вставлен создаваемый элемент
			"ПолеФлажка"
		);
		ЭлементФормы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
		ЭлементФормы.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Лево;
	КонецЦикла;
	
КонецПроцедуры
