#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа Тогда
		Наименование = СтрШаблон("%1 (%2)-%3",Строка(Поставщик),СокрЛП(НомерИзвещения),Формат(ДатаВыдачиИзвещения,"ДФ=yyyy"));
	Иначе
		Наименование = СтрШаблон("%1 (%2)(%3-%4)",СокрЛП(Номер),СокрЛП(Родитель.НомерИзвещения),Формат(ДатаНачалаСрокаДействия, "ДФ=dd.MM.yy"),Формат(ДатаОкончанияСрокаДействия, "ДФ=dd.MM.yy")); 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
