
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	бг_ДобавитьПоляДоговор();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьПоляДоговор()
		
	бг_Договор = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Договор",
		Элементы.ГруппаШапкаПраво,
		"Объект.бг_Договор");
	бг_Договор.АвтоМаксимальнаяШирина = Ложь;
	бг_Договор.МаксимальнаяШирина 	  = 28;
	
	бг_ОсновноеСоглашение = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ОсновноеСоглашение",
		Элементы.ГруппаШапкаЛево,
		"Объект.бг_ОсновноеСоглашение");
	бг_Договор.АвтоМаксимальнаяШирина = Ложь;
	бг_Договор.МаксимальнаяШирина 	  = 28;
	
КонецПроцедуры
	
#КонецОбласти // СлужебныеПроцедурыИФункции
