
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция АктивныеВарианты() Экспорт

	АктивныеВарианты = Новый Массив;
	
	АктивныеВарианты.Добавить(АктивныйВариант("АвтоСогласованиеЗаказовКлиентов"));
	АктивныеВарианты.Добавить(АктивныйВариант("АктуализироватьОбеспечениеЗаказовКлиентов"));
    	АктивныеВарианты.Добавить(АктивныйВариант("АктуализироватьРезервыПриПоступленииТовара"));
	АктивныеВарианты.Добавить(АктивныйВариант("ИзменитьДатуСвязанныхУчетныхДокументов"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОбработатьАкцизныеМарки"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОбработатьДокументыWMS"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОбработатьНовуюОрганизациюЕГАИС"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОбработатьПрисоединенныйФайлПисьма"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОтправитьЗапросыСправки1ЕГАИС"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОтразитьДополнительныеСведенияЗаказаКлиента"));
	АктивныеВарианты.Добавить(АктивныйВариант("ПередатьЗаказыКлиентовНаСборку"));
	АктивныеВарианты.Добавить(АктивныйВариант("ПерезаполнитьЗаявкиНаРасходованиеДС"));
	АктивныеВарианты.Добавить(АктивныйВариант("РассчитатьПоказателиРаботыОператоровWMS"));
	АктивныеВарианты.Добавить(АктивныйВариант("СоздатьЗаказМагазина"));
	АктивныеВарианты.Добавить(АктивныйВариант("СоздатьИзменитьПодчиненнуюРеализацию"));
	АктивныеВарианты.Добавить(АктивныйВариант("СоздатьНоменклатуруПартнера"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьДвиженияМарок"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьДокументы"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьЗаказыКлиентов"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьИнтернетЗаказыКлиентов"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьОрдераНаОтражениеПересортицы"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьПриходныйОрдерНаТовары"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьРасходныйОрдерНаТовары"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьРейсы"));
	
	Возврат АктивныеВарианты;

КонецФункции

Функция АктивныйВариант(Имя) Экспорт
	
	ДанныеВарианта = Новый Структура;
	
	ДанныеВарианта.Вставить("Имя", Имя);
	ДанныеВарианта.Вставить("Значение", Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов[Имя]);
	ДанныеВарианта.Вставить(
		"Представление",
		Метаданные.Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов.ЗначенияПеречисления[Имя].Синоним);
	
	Возврат ДанныеВарианта;
	
КонецФункции

Функция ШапкаКлючаЗадания() Экспорт
	
	Возврат "бг_ОбработатьОбъектыДляОтложеннойОбработки";
	
КонецФункции

#КонецОбласти

#КонецЕсли
