#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
	
КонецПроцедуры	

#КонецОбласти // Конец ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Реквизиты шапки
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("Проведен");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("АмортизационнаяПремияУказанаВПроцентах");
	ВыгружаемыеРеквизиты.Добавить("АналитикаДоходов");
	ВыгружаемыеРеквизиты.Добавить("АналитикаРасходовАмортизационнойПремии");
	ВыгружаемыеРеквизиты.Добавить("АналитикаРасходовНУ");
	ВыгружаемыеРеквизиты.Добавить("ВариантПримененияЦелевогоФинансирования");
	ВыгружаемыеРеквизиты.Добавить("ВидАналитикиКапитализацииРасходов");
	ВыгружаемыеРеквизиты.Добавить("ВключитьАмортизационнуюПремиюВСоставРасходов");
	ВыгружаемыеРеквизиты.Добавить("ДокументВДругомУчете");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	ВыгружаемыеРеквизиты.Добавить("НаправлениеДеятельности");
	ВыгружаемыеРеквизиты.Добавить("ОбъектСтроительства");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("Ответственный");
	ВыгружаемыеРеквизиты.Добавить("ОтражатьВРеглУчете");
	ВыгружаемыеРеквизиты.Добавить("ОтражатьВУпрУчете");
	ВыгружаемыеРеквизиты.Добавить("Подразделение");
	ВыгружаемыеРеквизиты.Добавить("ПорядокУчетаНУ");
	ВыгружаемыеРеквизиты.Добавить("СпециальныйКоэффициентНУ");
	ВыгружаемыеРеквизиты.Добавить("СрокИспользованияНУ");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДоходов");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовАмортизационнойПремии");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовНУ");
	ВыгружаемыеРеквизиты.Добавить("ЧастичнаяМодернизация");
	ВыгружаемыеРеквизиты.Добавить("СобытиеОС");

	// Реквизиты ТЧ "ОС"
	ВыгружаемыеРеквизиты.Добавить("ОС.ОсновноеСредство");
	ВыгружаемыеРеквизиты.Добавить("ОС.СуммаКапитальныхВложенийВключаемыхВРасходыНУ");
	ВыгружаемыеРеквизиты.Добавить("ОС.СуммаЦелевыхСредств");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьУУ");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьБУ");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьНУ");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьПР");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьВР");
	ВыгружаемыеРеквизиты.Добавить("ОС.ПроцентКапитальныхВложенийВключаемыхВРасходыНУ");
	ВыгружаемыеРеквизиты.Добавить("ОС.ИдентификаторСтроки");
	
	// Реквизиты ТЧ "ЦелевоеФинансирование"
	ВыгружаемыеРеквизиты.Добавить("ЦелевоеФинансирование.Счет");
	ВыгружаемыеРеквизиты.Добавить("ЦелевоеФинансирование.Сумма");
	
	Возврат СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
КонецФункции

#КонецОбласти // Конец СлужебныеПроцедурыИФункции
