
#Область ПрограммныйИнтерфейс

// Рассчитывает вариант обеспечения по умолчанию для подбора товаров исходя из входящих параметров.
//
// Параметры:
//  ТипНоменклатуры - ПеречислениеСсылка.ТипыНоменклатуры - тип номенклатуры.
//  ДопустимыеОбособленныеДействия - Массив из ПеречислениеСсылка.ВариантыОбеспечения - допустимые для выбора обособленные варианты обеспечения.
//  ДопустимыеНеобособленныеДействия - Массив из ПеречислениеСсылка.ВариантыОбеспечения - допустимые для выбора необособленные варианты обеспечения.
//  ОграничиватьВариантыОбеспечения - Булево - признак необходимости ограничения варианта обеспечения переданным в открываемую форму.
//  ВариантОбеспеченияИФлагОбособленно - Структура - структура с полями:
//   * ВариантОбеспечения - ПеречислениеСсылка.ВариантыОбеспечения - значение варианта обеспечения.
//   * Обособленно - Булево - значение признака "Обособленно".
//
// Возвращаемое значение:
//  Структура - структура с полями:
//   * ВариантОбеспечения - ПеречислениеСсылка.ВариантыОбеспечения - значение варианта обеспечения.
//   * Обособленно - Булево - значение признака "Обособленно".
//
&Вместо("ДопустимыеВариантыОбеспечения")
Функция бг_ДопустимыеВариантыОбеспечения(ТипНоменклатуры, 
									ДопустимыеОбособленныеДействия, 
									ДопустимыеНеобособленныеДействия, 
									ОграничиватьВариантыОбеспечения, 
									ВариантОбеспеченияИФлагОбособленно) Экспорт
	
	Результат = ПродолжитьВызов(
		ТипНоменклатуры, 
		ДопустимыеОбособленныеДействия, 
		ДопустимыеНеобособленныеДействия, 
		ОграничиватьВариантыОбеспечения, 
		ВариантОбеспеченияИФлагОбособленно);
	
	РезервироватьПоМереПоступления = 
		ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления");
	
	ИндексВарианта = Результат.Обособленные.Найти(РезервироватьПоМереПоступления);
	Если ИндексВарианта <> Неопределено Тогда
		Результат.Обособленные.Удалить(ИндексВарианта);
	КонецЕсли;
	
	ИндексВарианта = Результат.Необособленные.Найти(РезервироватьПоМереПоступления);
	Если ИндексВарианта <> Неопределено Тогда
		Результат.Необособленные.Удалить(ИндексВарианта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


