
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры,,"ЗакрыватьПриВыборе,ЗакрыватьПриЗакрытииВладельца,КлючНазначенияИспользования,ТолькоПросмотр");	
	ЗаполнитьОтпустилДолжность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ОтветственныеЛица());
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтветственныеЛица() 

	ОтветственныеЛица = Новый Структура();
	ОтветственныеЛица.Вставить("бг_Отпустил"			, Отпустил);
	ОтветственныеЛица.Вставить("бг_ОтпустилДолжность"	, ОтпустилДолжность);
	ОтветственныеЛица.Вставить("бг_Руководитель"		, Руководитель);
	ОтветственныеЛица.Вставить("бг_ГлавныйБухгалтер"	, ГлавныйБухгалтер);
	ОтветственныеЛица.Вставить("бг_Автор"				, Автор);
	ОтветственныеЛица.Вставить("бг_ДоверенностьНомер"	, ДоверенностьНомер);
	ОтветственныеЛица.Вставить("бг_ДоверенностьДата"	, ДоверенностьДата);
	ОтветственныеЛица.Вставить("бг_ДоверенностьВыдана"	, ДоверенностьВыдана);
	ОтветственныеЛица.Вставить("бг_ДоверенностьЛицо"	, ДоверенностьЛицо);
	
	Возврат ОтветственныеЛица;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОтпустилДолжность()
	Если ЗначениеЗаполнено(Отпустил) Тогда
		ОтпустилДолжность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отпустил, "бг_Должность");	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтпустилПриИзменении(Элемент)
	ЗаполнитьОтпустилДолжность();
КонецПроцедуры

#КонецОбласти
