#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_УстановитьВидимостьЭлементовФормы();
	бг_ИзменитьТекстОписания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_УстановитьВидимостьЭлементовФормы()
	
	Элементы.РазрешитьРедактированиеВладелец.Видимость = Ложь;
	Элементы.РазрешитьРедактированиеИспользоватьАдресноеХранение.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура бг_РазрешитьРедактированиеВместо(Команда)
	
	Результат = Новый Массив;
	
	Если бг_ЕстьПравоНаРедактированиеЛицензии() Тогда
		
		Результат.Добавить("бг_ВидыАлкогольнойПродукции");
		Результат.Добавить("бг_ВидЛицензируемойДеятельности");
		Результат.Добавить("бг_ДатаВыдачи");
		Результат.Добавить("бг_ДатаПрекращенияДействия");
		Результат.Добавить("бг_ЗаменяемаяЛицензия");
		Результат.Добавить("бг_Номер");
		Результат.Добавить("бг_НомерРАР");
		Результат.Добавить("бг_ПриостановленаСДаты");
		Результат.Добавить("бг_ПунктыНазначения");
		Результат.Добавить("бг_Регион");
		Результат.Добавить("бг_Серия");
		Результат.Добавить("бг_СлабоалкогольнаяПродукция");
		Результат.Добавить("бг_ТипЛицензии");
		Результат.Добавить("бг_Хорека");
		Результат.Добавить("Владелец");
		Результат.Добавить("ВидЛицензии");
		Результат.Добавить("ДатаНачала");
		Результат.Добавить("ДатаОкончания");
		Результат.Добавить("КемВыдана");
		
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция бг_ЕстьПравоНаРедактированиеЛицензии()
	
	Возврат Пользователи.РолиДоступны("ПолныеПрава, бг_ВводИнформацииПоЛицензиямПоставщиковАлкогольнойПродукцииБезКонтроля"); 
	
КонецФункции

&НаСервере
Процедура бг_ИзменитьТекстОписания()
	
	Элементы.ОписаниеВладелец.Заголовок = НСтр("ru = 'Не рекомендуется изменять реквизиты справочника, если он используется в документах'"); 
	
КонецПроцедуры

#КонецОбласти
