#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СостоянияСырьяВРеализованнойПродукции() Экспорт
	СостоянияСырья = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВРеализованнойПродукцииРФ());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВОжиданииПодтвержденияЭкспорта());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВРеализованнойПродукцииПодтвержденоЭкспорт());
	
	Возврат СостоянияСырья;
КонецФункции

Функция СостоянияСырьяВРеализованнойПродукцииРФ() Экспорт
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции);
	
	Возврат СостоянияСырья;
КонецФункции

Функция СостоянияСырьяВРеализованнойПродукцииПодтвержденоЭкспорт() Экспорт
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспорт);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭС);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортГарантии);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭСГарантии);
	
	Возврат СостоянияСырья;
КонецФункции

Функция СостоянияСырьяВОжиданииПодтвержденияЭкспорта() Экспорт
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспорта);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаЕАЭС);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС);
	
	Возврат СостоянияСырья;
КонецФункции

Функция СостоянияСырьяВыполненоСписание() Экспорт
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы);
	
	Возврат СостоянияСырья;
КонецФункции

#КонецОбласти

#КонецЕсли
