
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ОтключитьПолнотекстовыйПоискСписка();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ОтключитьПолнотекстовыйПоискСписка()

 	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ОтключитьПолнотекстовыйПоискСпискаФормы(
		Элементы.СписокПлатежей);
		
	Элементы.ДополнениеСтрокаПоиска.Видимость = Ложь;	
	Элементы.ДополнениеСтрокаПоиска.Доступность = Ложь;	
	Элементы.ДополнениеУправлениеПоиском.Видимость = Ложь;	
	Элементы.ДополнениеУправлениеПоиском.Доступность = Ложь;	

КонецПроцедуры

#КонецОбласти
