
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_WMS.ДобавитьПоляНаФормуДокумента(ЭтаФорма); 
	бг_ДобавитьПолеСерияОбязательнаКОтбору();
	бг_ДобавитьПолеТребуемыйВидМарки();
	бг_ДобавитьПолеУпаковкаПаллета();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьПолеСерияОбязательнаКОтбору()
	
	бг_СерияОбязательнаКОтбору = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ТоварыПоРаспоряжениямСерияОбязательнаКОтбору",
		Элементы.ТоварыПоРаспоряжениям,
		"Объект.ТоварыПоРаспоряжениям.бг_СерияОбязательнаКОтбору",
		,
		Элементы.ТоварыПоРаспоряжениямРаспоряжение);
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеТребуемыйВидМарки()

	бг_ТребуемыйВидМарки = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ТоварыПоРаспоряжениямТребуемыйВидМарки",
		Элементы.ТоварыПоРаспоряжениям,
		"Объект.ТоварыПоРаспоряжениям.бг_ТребуемыйВидМарки");
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеУпаковкаПаллета()
	
	бг_УпаковкаПаллета = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_УпаковкаПаллета",
		Элементы.ТоварыПоРаспоряжениям,
		"Объект.ТоварыПоРаспоряжениям.бг_УпаковкаПаллета",,
		Элементы.ТоварыПоРаспоряжениямРаспоряжение);
	
КонецПроцедуры

#КонецОбласти

