#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Интерфейс для отложенной обработки
//
// Параметры:
//   Документ - ДокументСсылка.ПоступлениеТоваровНаСклад
//   ВариантОбработки - ПеречислениеСсылка.бг_ВариантыОтложеннойОбработкиОбъектов, Неопределено - вариант обработки
//   Отказ - Булево - отказ от обработки
//
Процедура бг_ОтложеннаяОбработкаОбъекта(Документ, ВариантОбработки, Отказ,
	ДополнительныеСведения = Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ВариантОбработки = Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов.СоздатьИзменитьПодчиненнуюРеализацию Тогда
		Документы.РеализацияТоваровУслуг.бг_СоздатьИзменитьРеализациюПоПоступлению(Документ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
