#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьСвязанныеОбъекты(ДокументОбъект) Экспорт

	Если Не ДокументОбъект.ДополнительныеСвойства.адаптер_РежимЗаписи
		= РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из ДокументОбъект.ОС Цикл
		Справочники.адаптер_ИсходящиеСообщения.ЗарегистрироватьИсходящееСообщениеПриЗаписи(СтрокаТЧ.ОсновноеСредство);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
		
	ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства); 
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	
КонецПроцедуры	

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	ДанныеВыгружаемогоОбъекта = адаптер_РаботаСДаннымиИБ.ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения);
	
	ДанныеВыгружаемогоОбъекта.Реквизиты[0].Вставить("бг_ВидСобытияОС", 
		бг_ОбщегоНазначенияСервер.ЗначениеПеречислениеВСтруктуру(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "СобытиеОС.ВидСобытияОС")));
			
	Возврат ДанныеВыгружаемогоОбъекта;
	
КонецФункции


#КонецОбласти // Конец ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Реквизиты шапки
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("Проведен");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("АдресМестонахождения");
	ВыгружаемыеРеквизиты.Добавить("АдресМестонахожденияЗначение");
	ВыгружаемыеРеквизиты.Добавить("АмортизационнаяГруппа");
	ВыгружаемыеРеквизиты.Добавить("ВариантПримененияЦелевогоФинансирования");
	ВыгружаемыеРеквизиты.Добавить("ВариантРаздельногоУчетаНДС");
	ВыгружаемыеРеквизиты.Добавить("ВидАналитикиКапитализацииРасходов");
	ВыгружаемыеРеквизиты.Добавить("ВключитьАмортизационнуюПремиюВСоставРасходов");
	ВыгружаемыеРеквизиты.Добавить("ГодоваяНормаАмортизацииБУ");
	ВыгружаемыеРеквизиты.Добавить("ГрафикАмортизации");
	ВыгружаемыеРеквизиты.Добавить("ГруппаОС");
	ВыгружаемыеРеквизиты.Добавить("ГруппаФинансовогоУчета");
	ВыгружаемыеРеквизиты.Добавить("Договор");
	ВыгружаемыеРеквизиты.Добавить("ДокументВДругомУчете");
	ВыгружаемыеРеквизиты.Добавить("ДокументНаОсновании");
	ВыгружаемыеРеквизиты.Добавить("ДокументОснование");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	ВыгружаемыеРеквизиты.Добавить("КоэффициентУскоренияБУ");
	ВыгружаемыеРеквизиты.Добавить("КоэффициентУскоренияУУ");
	ВыгружаемыеРеквизиты.Добавить("Местонахождение");
	ВыгружаемыеРеквизиты.Добавить("МетодНачисленияАмортизацииБУ");
	ВыгружаемыеРеквизиты.Добавить("МетодНачисленияАмортизацииУУ");
	ВыгружаемыеРеквизиты.Добавить("МОЛ");
	ВыгружаемыеРеквизиты.Добавить("НалогообложениеНДС");
	ВыгружаемыеРеквизиты.Добавить("НаправлениеДеятельности");
	ВыгружаемыеРеквизиты.Добавить("НачислятьАмортизациюБУ");
	ВыгружаемыеРеквизиты.Добавить("НачислятьАмортизациюНУ");
	ВыгружаемыеРеквизиты.Добавить("НачислятьАмортизациюУУ");
	ВыгружаемыеРеквизиты.Добавить("НедвижимоеИмущество");
	ВыгружаемыеРеквизиты.Добавить("ОбъектСтроительства");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("ОрганизацияПолучательРасходов");
	ВыгружаемыеРеквизиты.Добавить("Ответственный");
	ВыгружаемыеРеквизиты.Добавить("ОтражатьВБУ");
	ВыгружаемыеРеквизиты.Добавить("ОтражатьВНУ");
	ВыгружаемыеРеквизиты.Добавить("ОтражатьВРеглУчете");
	ВыгружаемыеРеквизиты.Добавить("ОтражатьВУпрУчете");
	ВыгружаемыеРеквизиты.Добавить("ПередаватьРасходыВДругуюОрганизацию");
	ВыгружаемыеРеквизиты.Добавить("ПорядокУчетаБУ");
	ВыгружаемыеРеквизиты.Добавить("ПорядокУчетаНУ");
	ВыгружаемыеРеквизиты.Добавить("ПорядокУчетаУУ");
	ВыгружаемыеРеквизиты.Добавить("ПроцентКапитальныхВложенийВключаемыхВРасходыНУ");
	ВыгружаемыеРеквизиты.Добавить("РеквизитНедвижимоеИмуществоОбновлен");
	ВыгружаемыеРеквизиты.Добавить("СобытиеОС");
	ВыгружаемыеРеквизиты.Добавить("СпециальныйКоэффициентНУ");
	ВыгружаемыеРеквизиты.Добавить("СпособПоступления");
	ВыгружаемыеРеквизиты.Добавить("СрокИспользованияБУ");
	ВыгружаемыеРеквизиты.Добавить("СрокИспользованияНУ");
	ВыгружаемыеРеквизиты.Добавить("СрокИспользованияУУ");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДоходов");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовАмортизационнойПремии");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовБУ");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовНалог");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовНУ");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовУУ");
	ВыгружаемыеРеквизиты.Добавить("ХозяйственнаяОперация");
	ВыгружаемыеРеквизиты.Добавить("ЧастичныйВводВЭксплуатацию");
	ВыгружаемыеРеквизиты.Добавить("бг_Номенклатура");
	ВыгружаемыеРеквизиты.Добавить("бг_Склад");

	// Реквизиты ТЧ "ОС"
	ВыгружаемыеРеквизиты.Добавить("ОС.ОсновноеСредство");
	ВыгружаемыеРеквизиты.Добавить("ОС.ПоказательНаработки");
	ВыгружаемыеРеквизиты.Добавить("ОС.ОбъемНаработки");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьУУ");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьБУ");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьНУ");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьПР");
	ВыгружаемыеРеквизиты.Добавить("ОС.СтоимостьВР");
	ВыгружаемыеРеквизиты.Добавить("ОС.СуммаЦелевыхСредств");
	ВыгружаемыеРеквизиты.Добавить("ОС.ЛиквидационнаяСтоимость");
	ВыгружаемыеРеквизиты.Добавить("ОС.ЛиквидационнаяСтоимостьРегл");
	ВыгружаемыеРеквизиты.Добавить("ОС.ИдентификаторСтроки");
	
	// Реквизиты ТЧ "ЦелевоеФинансирование"
	ВыгружаемыеРеквизиты.Добавить("ЦелевоеФинансирование.Счет");
	ВыгружаемыеРеквизиты.Добавить("ЦелевоеФинансирование.Сумма");
	
	Возврат СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
КонецФункции

Процедура ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.ОбъектыЭксплуатации,
		"ИнвентарныйНомер");

КонецПроцедуры

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)

	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	// Реквизиты шапки
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		,
		"бг_ВидСобытияОС",
		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСобытийОС"));

КонецПроцедуры

#КонецОбласти // Конец СлужебныеПроцедурыИФункции
