#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьДанныеДляЧикаго() Экспорт 
	
	ОбработкаОбъект = Обработки.бг_ВыгрузкаДанныхДляЧикаго.Создать();
	ОбработкаОбъект.Пользователь = Пользователи.ТекущийПользователь();
	
	Если бг_ОбщегоНазначенияСервер.ЭтоРабочаяБаза()
		И ОбработкаОбъект.НастройкаОбменаЗагружена() Тогда 	
		ОбработкаОбъект.АвтоматическаяВыгрузкаПоРасписанию = Истина;
		ОбработкаОбъект.ВыгрузитьДанные();
	КонецЕсли;
	
КонецПроцедуры	
	
#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
