///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//         - Неопределено
//   КлючВарианта - Строка
//                - Неопределено
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.ФормироватьСразу = Ложь;
	Настройки.РазрешеноИзменятьСтруктуру = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
#Область ПриКомпоновкеРезультата_Инициализация
		
		Если ДокументРезультат = Неопределено Тогда
			ДокументРезультат = Новый ТабличныйДокумент;
		КонецЕсли;
		
		ДокументРезультат.Очистить();
		
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		
		ПериодДатаНачала = Неопределено;
		ПериодДатаОкончания = Неопределено;
		ПараметрДанныхПериод = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
		Если Не ПараметрДанныхПериод = Неопределено
			И ПараметрДанныхПериод.Использование Тогда
			ПериодДатаНачала = ПараметрДанныхПериод.Значение.ДатаНачала;
			ПериодДатаОкончания = ПараметрДанныхПериод.Значение.ДатаОкончания;
		КонецЕсли;
		
		Организация = Справочники.Организации.ПустаяСсылка();
		ПараметрОрганизация = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Организация");
		Если Не ПараметрОрганизация = Неопределено 
			И ПараметрОрганизация.Использование Тогда
			Организация = ПараметрОрганизация.Значение;
		КонецЕсли;
		
		БанковскаяГарантия = Справочники.бг_БанковскиеГарантии.ПустаяСсылка();
		ПараметрБанковскаяГарантия = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("БанковскаяГарантия");
		Если Не ПараметрБанковскаяГарантия = Неопределено
			И ПараметрБанковскаяГарантия.Использование Тогда
			БанковскаяГарантия = ПараметрБанковскаяГарантия.Значение;
		КонецЕсли;
		
		СписокНоменклатуры = Новый СписокЗначений;
		ПараметрНоменклатура = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Номенклатура");
		Если Не ПараметрНоменклатура = Неопределено
			И ПараметрНоменклатура.Использование Тогда
			Если ТипЗнч(ПараметрНоменклатура.Значение) = Тип("СписокЗначений") Тогда
				Для каждого ЭлементСписка Из ПараметрНоменклатура.Значение Цикл
					Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
						СписокНоменклатуры.Добавить(ЭлементСписка.Значение);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если ЗначениеЗаполнено(ПараметрНоменклатура.Значение) Тогда
					СписокНоменклатуры.Добавить(ПараметрНоменклатура.Значение);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
		
#КонецОбласти

#Область ПриКомпоновкеРезультата_ПроверкаПараметров

	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не указана организация'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПериодДатаНачала) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не указано начало периода'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПериодДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не указано окончание периода'"));
		Возврат;
	КонецЕсли;

#КонецОбласти

#Область ПриКомпоновкеРезультата_ФормированиеОтчета
		
		Макет = ПолучитьМакет("РегистрКонтроляИспользованияБанковскихГарантий");
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы|ОбластьОсновной");
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы|ОбластьОсновной");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы|ОбластьОсновной");
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьПодвалШапка = Макет.ПолучитьОбласть("ПодвалШапка");
		ОбластьПодвалСтрока = Макет.ПолучитьОбласть("ПодвалСтрока");
		ОбластьПодвалИтого = Макет.ПолучитьОбласть("ПодвалИтого");
		
		
		ДанныеШапки = Новый Структура;
		ДанныеШапки.Вставить("НалоговыйПериодМесяц", Формат(ПериодДатаНачала, "ДФ=MMMM"));
		ДанныеШапки.Вставить("НалоговыйПериодГод", Формат(ПериодДатаНачала, "ДФ=yyyy"));
		ДанныеШапки.Вставить("Организация", Организация);
		
		
		ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
		
		ДокументРезультат.Вывести(ОбластьШапка);
		
		ДокументРезультат.Вывести(ОбластьЗаголовокТаблицы);
		
		ДанныеСтрокаТаблицы = Новый Структура;
		ИнициализироватьДанныеСтрокаТаблицы(ДанныеСтрокаТаблицы);
				
		ДанныеПодвалТаблицы = Новый Структура;
		ИнициализироватьДанныеПодвалТаблицы(ДанныеПодвалТаблицы);
		
		Запрос = Новый Запрос;		
		
#Область ПриКомпоновкеРезультата_ФормированиеОтчета_ОсновныеДанныеОтчета
						
			Запрос.Текст = ТекстЗапросаОтчета();
			
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("НачалоПериода", ПериодДатаНачала);
			Запрос.УстановитьПараметр("КонецПериода", ПериодДатаОкончания);
			Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(ПериодДатаОкончания, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("НачалоПериодаГраница", Новый Граница(ПериодДатаНачала, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("СостоянияСырьяВРеализованнойПродукции", Перечисления.бг_СостоянияПодакцизногоСырья.СостоянияСырьяВРеализованнойПродукции());
			Запрос.УстановитьПараметр("СостоянияСырьяВыполненоСписание", Перечисления.бг_СостоянияПодакцизногоСырья.СостоянияСырьяВыполненоСписание());
			Запрос.УстановитьПараметр("ИсключаемыеТипыДокументов", ИсключаемыеИзРасчетаТипыДокументов());
			Запрос.УстановитьПараметр("БанковскаяГарантия", БанковскаяГарантия);
			Запрос.УстановитьПараметр("ОтключитьФильтрБанковскаяГарантия", Не ЗначениеЗаполнено(БанковскаяГарантия));
			Запрос.УстановитьПараметр("ВключитьНалоговуюСтавкуВОборотыАкцизов", Ложь);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			НомерПоПорядку = 0;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НомерПоПорядку = НомерПоПорядку + 1;
				
				БанковскаяГарантияИстекла  = ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодИстеченияБанковскойГарантии)
				И (ВыборкаДетальныеЗаписи.ПериодИстеченияБанковскойГарантии < ПериодДатаНачала);
				БанковскаяГарантияИстекает = ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодИстеченияБанковскойГарантии)
				И (НачалоМесяца(ВыборкаДетальныеЗаписи.ПериодИстеченияБанковскойГарантии) = ПериодДатаНачала);
				
				
				ДанныеСтрокаТаблицы.Вставить("НомерПоПорядку", Формат(НомерПоПорядку, "ЧГ="));			
				
				ДанныеСтрокаТаблицы.Вставить("СтавкаАкцизаРуб", ВыборкаДетальныеЗаписи.НалоговаяСтавка);
				ДанныеСтрокаТаблицы.Вставить("КоличествоОстатокПериодНачало", ВыборкаДетальныеЗаписи.ОстатокСпиртаВНереализованнойПродукции);
				
				// Извещение / Банковская гарантия (далее БГ) в счёт уплаты авансовых платежей акциза
				ДанныеСтрокаТаблицы.Вставить("ИзвещениеДата", Формат(ВыборкаДетальныеЗаписи.ДатаВыдачи, "ДФ=dd.MM.yy"));
				ДанныеСтрокаТаблицы.Вставить("ИзвещениеСуммаРуб", ВыборкаДетальныеЗаписи.СуммаАвансовогоПлатежаПоБанковскойГарантии);
				ДанныеСтрокаТаблицы.Вставить("ИзвещениеПериодДатаНачала", Формат(ВыборкаДетальныеЗаписи.ДатаНачалаСрокаДействия, "ДФ=dd.MM.yy"));
				ДанныеСтрокаТаблицы.Вставить("ИзвещениеПериодДатаОкончания", Формат(ВыборкаДетальныеЗаписи.ДатаОкончанияСрокаДействия, "ДФ=dd.MM.yy"));
				
				СрокДействияОстатокДни = 0;
				Если ВыборкаДетальныеЗаписи.ДатаОкончанияСрокаДействия > ПериодДатаОкончания Тогда 
					СрокДействияОстатокДни = Окр((ВыборкаДетальныеЗаписи.ДатаОкончанияСрокаДействия - ПериодДатаОкончания)/(3600*24)+1,0);
				КонецЕсли;
				ДанныеСтрокаТаблицы.Вставить("СрокДействияОстатокДни", СрокДействияОстатокДни);
				
				//Колонка таблицы 10 Колонка отчета 06
				ДанныеСтрокаТаблицы.Вставить("БанковскаяГарантияНомер", ВыборкаДетальныеЗаписи.НомерБанковскойГарантии);				
				//Колонка таблицы 11 Колонка отчета 07
				ДанныеСтрокаТаблицы.Вставить("ИзвещениеНомер", ВыборкаДетальныеЗаписи.НомерИзвещения);			
				//Колонка таблицы 12 Колонка отчета 08
				ДанныеСтрокаТаблицы.Вставить("КоличествоПриходБезФактПотерь", ВыборкаДетальныеЗаписи.КоличествоПриходЗаОтчетныйПериод);
				//Колонка таблицы 13 Колонка отчета ???
				ДанныеСтрокаТаблицы.Вставить("КоличествоВПути", ВыборкаДетальныеЗаписи.ОстатокСпиртаВПути);				
				//Колонка таблицы 14 Колонка отчета 09
				ДанныеСтрокаТаблицы.Вставить("КоличествоПриходПлан", ВыборкаДетальныеЗаписи.ОбъемСпиртаПоБанковскойГарантии);				
				//Колонка таблицы 15 Колонка отчета 10				
				Статус = "";				
				Если НЕ ВыборкаДетальныеЗаписи.ОстатокСпиртаВНереализованнойПродукцииКонецПериода = 0 Тогда
					
					//есть остатки на конец месяца

					Статус = "Используется";
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ОстатокСпиртаВНереализованнойПродукцииКонецПериода = 0
					И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодИстеченияБанковскойГарантии)
					И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачалаСрокаДействия)
					И ВыборкаДетальныеЗаписи.ДатаНачалаСрокаДействия <= ПериодДатаНачала Тогда
					
					//если на конец периода нет остатков спирта (колонка23=0)
					//и указана дата на которую приходится 100 дней (колонка25)
					//, ДатаНачала БГ меньше или равно 
					//начало текущего месяца					
					
					Статус = "Использован";			
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ОстатокСпиртаВНереализованнойПродукцииКонецПериода = 0
					И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачалаСрокаДействия)
					И ВыборкаДетальныеЗаписи.ДатаНачалаСрокаДействия >= ДобавитьМесяц(ПериодДатаНачала, 2) Тогда
					
					//если на конец периода нет остатков спирта (колонка23=0)
					//и ДатаНачала БГ больше или равно 
					//начало следуюшего месяца	

					Статус = "Планируется поступление в следующем отчетном периоде";
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ОстатокСпиртаВНереализованнойПродукцииКонецПериода = 0 
					И Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодИстеченияБанковскойГарантии) Тогда 
					
					//Если если на конец периода нет остатков спирта (колонка23=0)
					//и НЕ указана дата на которую приходится 100 дней (колонка25)

					Статус = "";
					
				ИначеЕсли Ложь Тогда
					
					Статус = "Заявлено на аннулирование";
					
				КонецЕсли;
				
				ДанныеСтрокаТаблицы.Вставить("Статус", Статус);
				
				//Колонка таблицы 16 Колонка отчета 11
				КоличествоНедопоставлено = ВыборкаДетальныеЗаписи.ОбъемСпиртаПоБанковскойГарантии - ВыборкаДетальныеЗаписи.ОбъемЗакупленногоСпирта;
				ДанныеСтрокаТаблицы.Вставить("КоличествоНедопоставлено", КоличествоНедопоставлено);				
				//Колонка таблицы 17 Колонка отчета 16
				ДанныеСтрокаТаблицы.Вставить("Поставщик", ВыборкаДетальныеЗаписи.Поставщик);				
				//Колонка таблицы 18 Колонка отчета 17
				// Использовано ЭС или КС за отчётный период, л б.с.
				ДанныеСтрокаТаблицы.Вставить("КоличествоПроизведено", ВыборкаДетальныеЗаписи.КоличествоПроизведено);
				//Колонка таблицы 19 Колонка отчета 18
				ДанныеСтрокаТаблицы.Вставить("КоличествоНзп", 0);
				//Колонка таблицы 20 Колонка отчета 19
				ДанныеСтрокаТаблицы.Вставить("КоличествоТехническиеПотериТранспортировка", 0);				
				//Колонка таблицы 21 Колонка отчета 17
				ДанныеСтрокаТаблицы.Вставить("КоличествоТехническиеПотериПроизводство", 0);				
				//Колонка таблицы 22 Колонка отчета 18
				// Реализовано АП  за отчётный период, литров б.с. 
				ДанныеСтрокаТаблицы.Вставить("КоличествоРеализовано", ВыборкаДетальныеЗаписи.ОбъемРеализованногоСпиртаЗаПериод);
				//Колонка таблицы 23 Колонка отчета 19
				ДанныеСтрокаТаблицы.Вставить("КоличествоРеализованоЭкспортВнешний", ВыборкаДетальныеЗаписи.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению);
				//Колонка таблицы 24 Колонка отчета 20
				ДанныеСтрокаТаблицы.Вставить("КоличествоРеализованоЭкспортВнутренний", ВыборкаДетальныеЗаписи.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС);		
				//Колонка таблицы 25 Колонка отчета 21
				ДанныеСтрокаТаблицы.Вставить("КоличествоРеализованоПотери", 0);
				//Колонка таблицы 26 Колонка отчета 22
				ДанныеСтрокаТаблицы.Вставить("КоличествоПотери", ВыборкаДетальныеЗаписи.ОбъемСписанногоПоНормеСпиртаЗаПериод);
				//Колонка таблицы 27 Колонка отчета 23
				ДанныеСтрокаТаблицы.Вставить("КоличествоОстатокПериодОкончание", ВыборкаДетальныеЗаписи.ОстатокСпиртаВНереализованнойПродукцииКонецПериода);				
				//Колонка таблицы 28 Колонка отчета 24
				ДанныеСтрокаТаблицы.Вставить("СуммаАкцизаПодтверждено", 0);				
				//Колонка таблицы 29 Колонка отчета 25
				ДанныеСтрокаТаблицы.Вставить("ДатаОкончанияРасчетногоСрока", Формат(ВыборкаДетальныеЗаписи.ПериодИстеченияБанковскойГарантии, "ДФ='MMMM yyyy'"));				
				//Колонка таблицы 30 Колонка отчета 26
				ДанныеСтрокаТаблицы.Вставить("СуммаАванса", ВыборкаДетальныеЗаписи.СуммаАвансаПоАкцизам);			
				//Колонка таблицы 31 Колонка отчета 27 
				СуммаАвансаКВычетуПринятая = ВыборкаДетальныеЗаписи.СуммаАвансаПоАкцизам - ВыборкаДетальныеЗаписи.СуммаНеЗачтенногоАвансаПоАкцизамНачалоПериода;
				ДанныеСтрокаТаблицы.Вставить("СуммаАвансаКВычетуПринятая", СуммаАвансаКВычетуПринятая);
				//Колонка таблицы 32 Колонка отчета ??? 
				ДанныеСтрокаТаблицы.Вставить("СуммаАвансаКВычету", ВыборкаДетальныеЗаписи.СуммаЗачтенногоАвансаПоАкцизамТекущийПериод);
				//Колонка таблицы 33 Колонка отчета ??? 
				ДанныеСтрокаТаблицы.Вставить("СуммаАвансаОстаток", ВыборкаДетальныеЗаписи.СуммаНеЗачтенногоАвансаПоАкцизам);
				ДанныеСтрокаТаблицы.Вставить("КоличествоОстаток", 0);
				
				ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеСтрокаТаблицы);		
				
				ДокументРезультат.Вывести(ОбластьСтрокаТаблицы);				
				
				Для каждого ЭлементДанных Из ДанныеПодвалТаблицы Цикл
					
					ДанныеПодвалТаблицы.Вставить(ЭлементДанных.Ключ, ЭлементДанных.Значение + ДанныеСтрокаТаблицы[ЭлементДанных.Ключ]);
					
				КонецЦикла;
				
			КонецЦикла;		
			
			ОбластьПодвалТаблицы.Параметры.Заполнить(ДанныеПодвалТаблицы);
			
			ДокументРезультат.Вывести(ОбластьПодвалТаблицы);
			
#КонецОбласти
 	
#Область ПриКомпоновкеРезультата_ФормированиеОтчета_ПодвалОтчета
		
		Если СписокНоменклатуры.Количество() > 0 Тогда
			
			Запрос.Текст = ТекстЗапросаПодвалОтчета();			
			
			ДокументРезультат.Вывести(ОбластьПодвалШапка);
			
			
			НоменклатураПодвала = Новый Соответствие;
			Если СписокНоменклатуры.Количество() > 0 Тогда
				Для каждого СписокНоменклатурыЭлемент Из СписокНоменклатуры Цикл
					НоменклатураПодвала.Вставить(СписокНоменклатурыЭлемент.Значение, СписокНоменклатурыЭлемент.Значение);
				КонецЦикла;
			КонецЕсли;
            			
			ДанныеПодвалСтрока = Новый Структура;
			
			
			Для каждого НоменклатураПодвалаЭлемент Из НоменклатураПодвала Цикл
				
				ИнициализироватьДанныеПодвалСтрока(ДанныеПодвалСтрока);
				
				ДанныеПодвалСтрока.Вставить("НоменклатураНаименование", НоменклатураПодвалаЭлемент.Ключ);	
				
				Номенклатура = НоменклатураПодвалаЭлемент.Значение;
				
				Если ЗначениеЗаполнено(Номенклатура) Тогда
					
					Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					НомерПоПорядку = 0;
					
					Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
						ДанныеПодвалСтрока.Вставить("КоличествоОстатокПериодНачало", ВыборкаДетальныеЗаписи.ОстатокСпиртаВНереализованнойПродукции);					
						ДанныеПодвалСтрока.Вставить("КоличествоПриходБезФактПотерь", ВыборкаДетальныеЗаписи.КоличествоПриходЗаОтчетныйПериод);
						
						// Использовано ЭС или КС за отчётный период, л б.с.
						ДанныеПодвалСтрока.Вставить("КоличествоПроизведено", ВыборкаДетальныеЗаписи.КоличествоПроизведено);
						//ДанныеПодвалСтрока.Вставить("КоличествоНзп", 0);
						ДанныеПодвалСтрока.Вставить("КоличествоТехническиеПотериТранспортировка", 0);
						
						// Реализовано АП  за отчётный период, литров б.с. 
						ДанныеПодвалСтрока.Вставить("КоличествоРеализовано", ВыборкаДетальныеЗаписи.ОбъемРеализованногоСпиртаЗаПериод);
						ДанныеПодвалСтрока.Вставить("КоличествоРеализованоЭкспортВнешний", ВыборкаДетальныеЗаписи.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению);
						ДанныеПодвалСтрока.Вставить("КоличествоРеализованоЭкспортВнутренний", ВыборкаДетальныеЗаписи.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС);		
						ДанныеПодвалСтрока.Вставить("КоличествоРеализованоПотери", 0);
						
						ДанныеПодвалСтрока.Вставить("КоличествоПотери", ВыборкаДетальныеЗаписи.ОбъемСписанногоПоНормеСпиртаЗаПериод);
						ДанныеПодвалСтрока.Вставить("КоличествоОстатокПериодОкончание", ВыборкаДетальныеЗаписи.ОстатокСпиртаВНереализованнойПродукцииКонецПериода);

						ДанныеПодвалСтрока.Вставить("КоличествоОстаток", 0);										
						
						Для каждого ЭлементДанных Из ДанныеПодвалТаблицы Цикл
							
							Если ДанныеПодвалСтрока.Свойство(ЭлементДанных.Ключ) Тогда 
								ДанныеПодвалТаблицы.Вставить(ЭлементДанных.Ключ, ЭлементДанных.Значение + ДанныеПодвалСтрока[ЭлементДанных.Ключ]);
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьПодвалСтрока.Параметры.Заполнить(ДанныеПодвалСтрока);
				
				ДокументРезультат.Вывести(ОбластьПодвалСтрока);
				
			КонецЦикла;
			
			ОбластьПодвалИтого.Параметры.Заполнить(ДанныеПодвалТаблицы);
			
			ДокументРезультат.Вывести(ОбластьПодвалИтого);
			
#КонецОбласти

#КонецОбласти

		ДокументРезультат.ФиксацияСверху = 9;
		ДокументРезультат.ФиксацияСлева = 3;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
Процедура ИнициализироватьДанныеСтрокаТаблицы(ДанныеСтрокаТаблицы)
	
	Если ДанныеСтрокаТаблицы = Неопределено Тогда
		ДанныеСтрокаТаблицы = Новый Структура;
	КонецЕсли;
	
	ДанныеСтрокаТаблицы.Вставить("НомерПоПорядку", 0);
	ДанныеСтрокаТаблицы.Вставить("НоменклатураНаименование", "ЭС и КС для производства АП св. 9% + НЗП + остаток АП");
	ДанныеСтрокаТаблицы.Вставить("СтавкаАкцизаРуб", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоОстатокПериодНачало", 0);
	
	// Извещение / Банковская гарантия (далее БГ) в счёт уплаты авансовых платежей акциза
	ДанныеСтрокаТаблицы.Вставить("ИзвещениеДата", 0);
	ДанныеСтрокаТаблицы.Вставить("ИзвещениеСуммаРуб", 0);
	ДанныеСтрокаТаблицы.Вставить("ИзвещениеПериодДатаНачала", 0);
	ДанныеСтрокаТаблицы.Вставить("ИзвещениеПериодДатаОкончания", 0);
	ДанныеСтрокаТаблицы.Вставить("СрокДействияОстатокДни", 0);
	ДанныеСтрокаТаблицы.Вставить("ИзвещениеНомерВнутренний", 0);
	ДанныеСтрокаТаблицы.Вставить("ИзвещениеНомер", 0);
	
	ДанныеСтрокаТаблицы.Вставить("КоличествоПриходБезФактПотерь", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоВПути", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоПриходПлан", 0);
	ДанныеСтрокаТаблицы.Вставить("Статус", "");
	ДанныеСтрокаТаблицы.Вставить("КоличествоНедопоставлено", 0);
	
	ДанныеСтрокаТаблицы.Вставить("Поставщик", 0);
	
	// Использовано ЭС или КС за отчётный период, л б.с.
	ДанныеСтрокаТаблицы.Вставить("КоличествоПроизведено", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоНзп", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоТехническиеПотериТранспортировка", 0);
	
	ДанныеСтрокаТаблицы.Вставить("КоличествоТехническиеПотериПроизводство", 0);
	
	// Реализовано АП  за отчётный период, литров б.с. 
	ДанныеСтрокаТаблицы.Вставить("КоличествоРеализовано", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоРеализованоЭкспортВнешний", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоРеализованоЭкспортВнутренний", 0);		
	ДанныеСтрокаТаблицы.Вставить("КоличествоРеализованоПотери", 0);
	
	ДанныеСтрокаТаблицы.Вставить("КоличествоПотери", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоОстатокПериодОкончание", 0);
	ДанныеСтрокаТаблицы.Вставить("СуммаАкцизаПодтверждено", 0);
	
	ДанныеСтрокаТаблицы.Вставить("ДатаОкончанияРасчетногоСрока", 0);
	ДанныеСтрокаТаблицы.Вставить("СуммаАванса", 0);
	ДанныеСтрокаТаблицы.Вставить("СуммаАвансаКВычетуПринятая", 0);
	ДанныеСтрокаТаблицы.Вставить("СуммаАвансаКВычету", 0);
	ДанныеСтрокаТаблицы.Вставить("СуммаАвансаОстаток", 0);
	ДанныеСтрокаТаблицы.Вставить("КоличествоОстаток", 0);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеПодвалТаблицы(ДанныеПодвалТаблицы)

	Если ДанныеПодвалТаблицы = Неопределено Тогда
		ДанныеПодвалТаблицы = Новый Структура;
	КонецЕсли;
	
	ДанныеПодвалТаблицы.Вставить("КоличествоОстатокПериодНачало", 0);
	ДанныеПодвалТаблицы.Вставить("ИзвещениеСуммаРуб", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоПриходБезФактПотерь", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоВПути", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоПриходПлан", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоПроизведено", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоНзп", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоТехническиеПотериТранспортировка", 0); 
	ДанныеПодвалТаблицы.Вставить("КоличествоРеализовано", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоРеализованоЭкспортВнешний", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоРеализованоЭкспортВнутренний", 0);		
	ДанныеПодвалТаблицы.Вставить("КоличествоРеализованоПотери", 0);		
	ДанныеПодвалТаблицы.Вставить("КоличествоПотери", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоОстатокПериодОкончание", 0);
	ДанныеПодвалТаблицы.Вставить("СуммаАкцизаПодтверждено", 0);		
	ДанныеПодвалТаблицы.Вставить("СуммаАванса", 0);
	ДанныеПодвалТаблицы.Вставить("СуммаАвансаКВычетуПринятая", 0);
	ДанныеПодвалТаблицы.Вставить("СуммаАвансаКВычету", 0);
	ДанныеПодвалТаблицы.Вставить("КоличествоОстаток", 0);
	
КонецПроцедуры
		
Процедура ИнициализироватьДанныеПодвалСтрока(ДанныеПодвалСтрока)
	
	Если ДанныеПодвалСтрока = Неопределено Тогда
		ДанныеПодвалСтрока = Новый Структура;
	КонецЕсли;
	
	ДанныеПодвалСтрока.Вставить("НоменклатураНаименование", "");
	ДанныеПодвалСтрока.Вставить("КоличествоОстатокПериодНачало", 0);
	ДанныеПодвалСтрока.Вставить("КоличествоПриходБезФактПотерь", 0);
	ДанныеПодвалСтрока.Вставить("КоличествоПроизведено", 0);
	ДанныеПодвалСтрока.Вставить("КоличествоТехническиеПотериТранспортировка", 0); 
	ДанныеПодвалСтрока.Вставить("КоличествоРеализовано", 0);
	ДанныеПодвалСтрока.Вставить("КоличествоРеализованоЭкспортВнешний", 0);
	ДанныеПодвалСтрока.Вставить("КоличествоРеализованоЭкспортВнутренний", 0);		
	ДанныеПодвалСтрока.Вставить("КоличествоРеализованоПотери", 0);		
	ДанныеПодвалСтрока.Вставить("КоличествоПотери", 0);
	ДанныеПодвалСтрока.Вставить("КоличествоОстатокПериодОкончание", 0);
	ДанныеПодвалСтрока.Вставить("КоличествоОстаток", 0);
	
КонецПроцедуры

#Область Запросы

Функция ТекстЗапросаОтчета()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	АкцизОбороты.Сделка КАК Сделка
	|ПОМЕСТИТЬ втБанковскиеГарантии
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И ТИПЗНАЧЕНИЯ(Сделка) = ТИП(Справочник.бг_БанковскиеГарантии)
	|				И (&ОтключитьФильтрБанковскаяГарантия
	|					ИЛИ ВЫРАЗИТЬ(Сделка КАК Справочник.бг_БанковскиеГарантии).Номер = &БанковскаяГарантия)) КАК АкцизОбороты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АкцизОстатки.Сделка
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И ТИПЗНАЧЕНИЯ(Сделка) = ТИП(Справочник.бг_БанковскиеГарантии)
	|				И (&ОтключитьФильтрБанковскаяГарантия
	|					ИЛИ ВЫРАЗИТЬ(Сделка КАК Справочник.бг_БанковскиеГарантии).Номер = &БанковскаяГарантия)) КАК АкцизОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	АкцизОбороты.Сделка КАК БанковскаяГарантия,
	|	АкцизОбороты.Регистратор КАК РегистрацияБанковскихГарантий
	|ПОМЕСТИТЬ втБанковскиеГарантииРегистраторы
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						втБанковскиеГарантии.Сделка КАК БанковскаяГарантия
	|					ИЗ
	|						втБанковскиеГарантии КАК втБанковскиеГарантии)) КАК АкцизОбороты
	|ГДЕ
	|	АкцизОбороты.Регистратор ССЫЛКА Документ.бг_РегистрацияБанковскихГарантий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втБанковскиеГарантииРегистраторы.БанковскаяГарантия КАК БанковскаяГарантия,
	|	втБанковскиеГарантииРегистраторы.РегистрацияБанковскихГарантий КАК РегистрацияБанковскихГарантий,
	|	бг_РегистрацияБанковскихГарантийРаспределениеАкциза.ВидПодакцизныхТоваров КАК ВидПодакцизныхТоваров,
	|	бг_РегистрацияБанковскихГарантийРаспределениеАкциза.ВидПодакцизныхТоваров.НалоговаяСтавка КАК ВидПодакцизныхТоваровНалоговаяСтавка
	|ПОМЕСТИТЬ втБанковскиеГарантииРегистраторыНалоговыеСтавки
	|ИЗ
	|	втБанковскиеГарантииРегистраторы КАК втБанковскиеГарантииРегистраторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бг_РегистрацияБанковскихГарантий.РаспределениеАкциза КАК бг_РегистрацияБанковскихГарантийРаспределениеАкциза
	|		ПО втБанковскиеГарантииРегистраторы.РегистрацияБанковскихГарантий = бг_РегистрацияБанковскихГарантийРаспределениеАкциза.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АкцизОбороты.Период КАК Период,
	|	АкцизОбороты.Сделка КАК БанковскаяГарантия,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	АкцизОбороты.КоличествоПриход КАК КоличествоПриход
	|ПОМЕСТИТЬ втуПериодыОтгрузкиОтПоставщика
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Организация = &Организация
	|				И СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						втБанковскиеГарантии.Сделка КАК БанковскаяГарантия
	|					ИЗ
	|						втБанковскиеГарантии КАК втБанковскиеГарантии)) КАК АкцизОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втБанковскиеГарантии.Сделка КАК БанковскаяГарантия,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодИстеченияБанковскойГарантии,
	|	НЕОПРЕДЕЛЕНО КАК КодПодакцизногоТовара,
	|	0 КАК СуммаБанковскойГарантии,
	|	0 КАК ОбъемСпиртаПоБанковскойГарантии,
	|	НЕОПРЕДЕЛЕНО КАК РегистрацияБанковскихГарантий,
	|	НЕОПРЕДЕЛЕНО КАК ВидПодакцизныхТоваров,
	|	0 КАК ВидПодакцизныхТоваровНалоговаяСтавка
	|ПОМЕСТИТЬ втуДанныеПредварительно
	|ИЗ
	|	втБанковскиеГарантии КАК втБанковскиеГарантии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втуПериодыОтгрузкиОтПоставщика.БанковскаяГарантия,
	|	МИНИМУМ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(втуПериодыОтгрузкиОтПоставщика.Период, МЕСЯЦ, 1), ДЕНЬ, втуПериодыОтгрузкиОтПоставщика.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом.РасчетныйСрокБГ)),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0
	|ИЗ
	|	втуПериодыОтгрузкиОтПоставщика КАК втуПериодыОтгрузкиОтПоставщика
	|ГДЕ
	|	Не втуПериодыОтгрузкиОтПоставщика.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом.РасчетныйСрокБГ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втуПериодыОтгрузкиОтПоставщика.БанковскаяГарантия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втБанковскиеГарантии.Сделка,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	РегистрацияРаспределениеАкциза.ВидПодакцизныхТоваров.Код,
	|	0,
	|	0,
	|	РегистрацияРаспределениеАкциза.Ссылка,
	|	РегистрацияРаспределениеАкциза.ВидПодакцизныхТоваров,
	|	РегистрацияРаспределениеАкциза.ВидПодакцизныхТоваров.НалоговаяСтавка
	|ИЗ
	|	втБанковскиеГарантии КАК втБанковскиеГарантии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бг_РегистрацияБанковскихГарантий.РаспределениеАкциза КАК РегистрацияРаспределениеАкциза
	|		ПО втБанковскиеГарантии.Сделка = РегистрацияРаспределениеАкциза.БанковскаяГарантия
	|			И (РегистрацияРаспределениеАкциза.Ссылка.Проведен)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БанковскиеГарантииОбороты.БанковскаяГарантия,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО,
	|	БанковскиеГарантииОбороты.СуммаПриход,
	|	БанковскиеГарантииОбороты.КоличествоПриход,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0
	|ИЗ
	|	РегистрНакопления.бг_БанковскиеГарантии.Обороты(
	|			,
	|			,
	|			,
	|			БанковскаяГарантия В
	|				(ВЫБРАТЬ
	|					втБанковскиеГарантии.Сделка КАК Сделка
	|				ИЗ
	|					втБанковскиеГарантии КАК втБанковскиеГарантии)) КАК БанковскиеГарантииОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуДанныеПредварительно.БанковскаяГарантия КАК БанковскаяГарантия,
	|	СУММА(втуДанныеПредварительно.СуммаБанковскойГарантии) КАК СуммаБанковскойГарантии,
	|	СУММА(втуДанныеПредварительно.ОбъемСпиртаПоБанковскойГарантии) КАК ОбъемСпиртаПоБанковскойГарантии,
	|	МАКСИМУМ(втуДанныеПредварительно.ПериодИстеченияБанковскойГарантии) КАК ПериодИстеченияБанковскойГарантии,
	|	МАКСИМУМ(втуДанныеПредварительно.КодПодакцизногоТовара) КАК КодПодакцизногоТовара,
	|	МАКСИМУМ(втуДанныеПредварительно.РегистрацияБанковскихГарантий) КАК РегистрацияБанковскихГарантий,
	|	МАКСИМУМ(втуДанныеПредварительно.ВидПодакцизныхТоваров) КАК ВидПодакцизныхТоваров,
	|	МАКСИМУМ(втуДанныеПредварительно.ВидПодакцизныхТоваровНалоговаяСтавка) КАК ВидПодакцизныхТоваровНалоговаяСтавка
	|ПОМЕСТИТЬ втуДанные
	|ИЗ
	|	втуДанныеПредварительно КАК втуДанныеПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	втуДанныеПредварительно.БанковскаяГарантия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуДанные.БанковскаяГарантия КАК БанковскаяГарантия,
	|	втБанковскиеГарантии.Номер КАК НомерБанковскойГарантии,
	|	втуДанные.ПериодИстеченияБанковскойГарантии КАК ПериодИстеченияБанковскойГарантии,
	|	втБанковскиеГарантии.ДатаВыдачи КАК ДатаВыдачи,
	|	втБанковскиеГарантии.ДатаНачалаСрокаДействия КАК ДатаНачалаСрокаДействия,
	|	втБанковскиеГарантии.ДатаОкончанияСрокаДействия КАК ДатаОкончанияСрокаДействия,
	|	втуДанные.СуммаБанковскойГарантии КАК СуммаБанковскойГарантии,
	|	втуДанные.СуммаБанковскойГарантии КАК СуммаАвансовогоПлатежаПоБанковскойГарантии,
	|	ЕСТЬNULL(втБанковскиеГарантии.Родитель.Поставщик.ИНН, """""""") КАК ИННОрганизации,
	|	ЕСТЬNULL(втБанковскиеГарантии.Родитель.Поставщик.КПП, """""""") КАК КППОрганизации,
	|	втуДанные.ОбъемСпиртаПоБанковскойГарантии * 10 КАК ОбъемСпиртаПоБанковскойГарантии,
	|	втуДанные.КодПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
	|	втуДанные.РегистрацияБанковскихГарантий КАК РегистрацияБанковскихГарантий,
	|	втуДанные.ВидПодакцизныхТоваров КАК ВидПодакцизныхТоваров,
	|	втуДанные.ВидПодакцизныхТоваровНалоговаяСтавка КАК ВидПодакцизныхТоваровНалоговаяСтавка
	|ПОМЕСТИТЬ втДанныеБанковскихГарантий
	|ИЗ
	|	втуДанные КАК втуДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_БанковскиеГарантии КАК втБанковскиеГарантии
	|		ПО втуДанные.БанковскаяГарантия = втБанковскиеГарантии.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуПериодыОтгрузкиОтПоставщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуДанныеПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АкцизОбороты.ПериодМесяц КАК Период,
	|	АкцизОбороты.Сделка КАК Сделка,
	|	АкцизОбороты.СостояниеСырья КАК СостояниеСырья,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Продукция = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоПродукция,
	|	СУММА(АкцизОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(АкцизОбороты.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(ВЫБОР
	|			КОГДА (АкцизОбороты.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2 
	|					)//ИЛИ АкцизОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров)
	|					И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВГотовойПродукции)
	|					И АкцизОбороты.ПериодМесяц >= &НачалоПериода	
	|				ТОГДА АкцизОбороты.КоличествоПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПроизведено,
	|	СУММА(ВЫБОР
	|			КОГДА АкцизОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровНаСклад
	|					И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВМестахХранения)
	|					И АкцизОбороты.ПериодМесяц >= &НачалоПериода
	|				ТОГДА АкцизОбороты.КоличествоПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПриходЗаОтчетныйПериод
	|ПОМЕСТИТЬ втАкцизыОборотыПредварительно
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			,
	|			&КонецПериода,
	|			Авто,
	|			Организация = &Организация
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						втБанковскиеГарантии.Сделка КАК Сделка
	|					ИЗ
	|						втБанковскиеГарантии КАК втБанковскиеГарантии)
	|				И Не СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции)) КАК АкцизОбороты
	|ГДЕ
	|	(ЛОЖЬ
	|				И Не ТИПЗНАЧЕНИЯ(АкцизОбороты.Регистратор) В (&ИсключаемыеТипыДокументов)
	|			ИЛИ ВЫБОР
	|				КОГДА АкцизОбороты.Регистратор ССЫЛКА Документ.битРасчетАвансовПоАкцизам
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцизОбороты.ПериодМесяц,
	|	АкцизОбороты.Сделка,
	|	АкцизОбороты.СостояниеСырья,
	|	АкцизОбороты.СтатусАкциза,
	|	АкцизОбороты.Номенклатура,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Продукция = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизОбороты.Сделка КАК БанковскаяГарантия,
	|	АкцизОбороты.Период КАК Период,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	АкцизОбороты.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВМестахХранения)
	|				И Не АкцизОбороты.ЭтоПродукция
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БылВМестахХранения,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемЗакупленногоСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПоступившегоСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И (АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|					ИЛИ АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы))
	|						И АкцизОбороты.ЭтоПродукция)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии))
	|			ТОГДА АкцизОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период < &НачалоПериода
	|				И (АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|					ИЛИ АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы))
	|						И АкцизОбороты.ЭтоПродукция)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период < &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|				И Не АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоПоНормеСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|				И Не АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоСверхНормыСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|				И Не АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|				И Не АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод,
	|	АкцизОбороты.КоличествоПроизведено КАК КоличествоПроизведено,
	|	АкцизОбороты.КоличествоПриходЗаОтчетныйПериод КАК КоличествоПриходЗаОтчетныйПериод
	|ПОМЕСТИТЬ втуАкцизыОбороты
	|ИЗ
	|	втАкцизыОборотыПредварительно КАК АкцизОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	Период
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(втАкцизыОборотыПредварительно.Сделка КАК  Справочник.бг_БанковскиеГарантии) КАК БанковскаяГарантия,
	|	ВЫРАЗИТЬ(втАкцизыОборотыПредварительно.Сделка КАК  Справочник.бг_БанковскиеГарантии).ДатаВыдачиИзвещения КАК ДатаВыдачиИзвещения,
	|	втАкцизыОборотыПредварительно.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом
	|ПОМЕСТИТЬ втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом
	|ИЗ
	|	втАкцизыОборотыПредварительно КАК втАкцизыОборотыПредварительно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	ДатаВыдачиИзвещения
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом.БанковскаяГарантия КАК БанковскаяГарантия,
	|	втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом.ДатаВыдачиИзвещения КАК ДатаВыдачиИзвещения,
	|	втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	МАКСИМУМ(КодыВидовОперацийНалогообложения.Период) КАК ПериодНалоговыеСтавки
	|ПОМЕСТИТЬ втуБанковскаяГарантияНалоговыеСтавкиПероды
	|ИЗ
	|	втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом КАК втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом.ДатаВыдачиИзвещения >= КодыВидовОперацийНалогообложения.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом.БанковскаяГарантия,
	|	втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом.ДатаВыдачиИзвещения,
	|	втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом.ВидОперацииНалогообложенияАкцизом
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	ПериодНалоговыеСтавки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуБанковскаяГарантияНалоговыеСтавкиПероды.БанковскаяГарантия КАК БанковскаяГарантия,
	|	втуБанковскаяГарантияНалоговыеСтавкиПероды.ДатаВыдачиИзвещения КАК ДатаВыдачиИзвещения,
	|	втуБанковскаяГарантияНалоговыеСтавкиПероды.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров КАК ВидПодакцизныхТоваров,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров.НалоговаяСтавка КАК ВидПодакцизныхТоваровНалоговаяСтавка
	|ПОМЕСТИТЬ втуБанковскаяГарантияНалоговыеСтавки
	|ИЗ
	|	втуБанковскаяГарантияНалоговыеСтавкиПероды КАК втуБанковскаяГарантияНалоговыеСтавкиПероды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО втуБанковскаяГарантияНалоговыеСтавкиПероды.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И втуБанковскаяГарантияНалоговыеСтавкиПероды.ПериодНалоговыеСтавки = КодыВидовОперацийНалогообложения.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуБанковскаяГарантияНалоговыеСтавкиПероды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуБанковскаяГарантияВидОперацииНалогообложенияАкцизом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуАкцизыОбороты.Период КАК Период,
	|	втуАкцизыОбороты.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	МАКСИМУМ(КодыВидовОперацийНалогообложения.Период) КАК ПериодНалоговыеСтавки
	|ПОМЕСТИТЬ втуАкцизыОборотыНалоговыеСтавкиПериоды
	|ИЗ
	|	втуАкцизыОбороты КАК втуАкцизыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО втуАкцизыОбороты.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И втуАкцизыОбороты.Период >= КодыВидовОперацийНалогообложения.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	втуАкцизыОбороты.Период,
	|	втуАкцизыОбороты.ВидОперацииНалогообложенияАкцизом
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	ПериодНалоговыеСтавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ  
	|	втуАкцизыОборотыНалоговыеСтавкиПериоды.Период КАК Период,
	|	втуАкцизыОборотыНалоговыеСтавкиПериоды.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров.НалоговаяСтавка КАК НалоговаяСтавка
	|ПОМЕСТИТЬ втуАкцизыОборотыНалоговыеСтавки
	|ИЗ
	|	втуАкцизыОборотыНалоговыеСтавкиПериоды КАК втуАкцизыОборотыНалоговыеСтавкиПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО втуАкцизыОборотыНалоговыеСтавкиПериоды.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И втуАкцизыОборотыНалоговыеСтавкиПериоды.ПериодНалоговыеСтавки = КодыВидовОперацийНалогообложения.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуАкцизыОбороты.БанковскаяГарантия КАК БанковскаяГарантия,
	|	ВЫБОР
	|		КОГДА &ВключитьНалоговуюСтавкуВОборотыАкцизов
	|			ТОГДА ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК НалоговаяСтавка,
	|	МАКСИМУМ(втуАкцизыОбороты.БылВМестахХранения) КАК БылВМестахХранения,
	|	СУММА(втуАкцизыОбороты.ОбъемЗакупленногоСпирта) * 10 КАК ОбъемЗакупленногоСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемЗакупленногоСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьЗакупленногоСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемПоступившегоСпирта) * 10 КАК ОбъемПоступившегоСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемПоступившегоСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьПоступившегоСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериод * 10) КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериод * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению * 10) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодПодтверждено) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодПодтверждено * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериодПодтверждено,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды) * 10 КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды * 10) КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоПоНормеСпирта * 10) КАК ОбъемСписанногоПоНормеСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоПоНормеСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьСписанногоПоНормеСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * 10) КАК ОбъемСписанногоСверхНормыСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьСписанногоСверхНормыСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод * 10) КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоПоНормеСпиртаЗаПериод * 10) КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоПоНормеСпиртаЗаПериод * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьСписанногоПоНормеСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоСверхНормыСпиртаЗаПериод) * 10 КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьСписанногоСверхНормыСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.КоличествоПроизведено) * 1 КАК КоличествоПроизведено,
	|	СУММА(втуАкцизыОбороты.КоличествоПриходЗаОтчетныйПериод) * 1 КАК КоличествоПриходЗаОтчетныйПериод
	|ПОМЕСТИТЬ втДанныеПоОборотамПоКонецПериода
	|ИЗ
	|	втуАкцизыОбороты КАК втуАкцизыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втуАкцизыОборотыНалоговыеСтавки КАК втуАкцизыОборотыНалоговыеСтавки
	|		ПО втуАкцизыОбороты.ВидОперацииНалогообложенияАкцизом = втуАкцизыОборотыНалоговыеСтавки.ВидОперацииНалогообложенияАкцизом
	|			И втуАкцизыОбороты.Период = втуАкцизыОборотыНалоговыеСтавки.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	втуАкцизыОбороты.БанковскаяГарантия,
	|	ВЫБОР
	|		КОГДА &ВключитьНалоговуюСтавкуВОборотыАкцизов
	|			ТОГДА ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуАкцизыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуАкцизыОборотыНалоговыеСтавкиПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуАкцизыОборотыНалоговыеСтавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка КАК Сделка,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья КАК СостояниеСырья,
	|	АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза КАК СтатусАкциза,
	|	АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстаток КАК КоличествоОстатокНачалоПериода,
	|	0 КАК КоличествоОстатокКонецПериода
	|ПОМЕСТИТЬ втОстаткиОборотыПоАкцизам
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Остатки(
	|			&НачалоПериодаГраница,
	|			Организация = &Организация
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						втБанковскиеГарантии.Сделка КАК Сделка
	|					ИЗ
	|						втБанковскиеГарантии КАК втБанковскиеГарантии)
	|				И Не СтатусАкциза В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции)
	|				)) КАК АкцизПоПриобретеннымЦенностямОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья,
	|	АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза,
	|	0,
	|	АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						втБанковскиеГарантии.Сделка КАК Сделка
	|					ИЗ
	|						втБанковскиеГарантии КАК втБанковскиеГарантии)
	|				И Не СтатусАкциза В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции)
	|				)) КАК АкцизПоПриобретеннымЦенностямОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка КАК БанковскаяГарантия,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	ВЫБОР
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|			ТОГДА АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстатокКонецПериода
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокСпиртаВПути,
	|	ВЫБОР
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспорт)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭСГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспорта)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|			ТОГДА 0	
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет)
	|			ТОГДА 0
	|		КОГДА ЛОЖЬ
	|				И (АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВРеализованнойПродукции)
	|					ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВыполненоСписание)
	|					ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет))
	|			ТОГДА 0
	|		ИНАЧЕ АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстатокНачалоПериода
	|	КОНЕЦ КАК ОстатокСпиртаВНереализованнойПродукции,
	|	ВЫБОР
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспорт)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭСГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспорта)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|			ТОГДА 0	
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет)
	|			ТОГДА 0
	|		КОГДА ЛОЖЬ
	|				И (АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВРеализованнойПродукции)
	|					ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВыполненоСписание)
	|					ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет))
	|			ТОГДА 0
	|		ИНАЧЕ АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстатокКонецПериода
	|	КОНЕЦ КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода
	|ПОМЕСТИТЬ втуОстаткиПоАкцизамПредварительно
	|ИЗ
	|	втОстаткиОборотыПоАкцизам КАК АкцизПоПриобретеннымЦенностямОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров КАК ВидПодакцизныхТоваров
	|ПОМЕСТИТЬ втуВидыПодакцизныхТоваров
	|ИЗ
	|	РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом.СрезПоследних(
	|			&КонецПериода,
	|			ВидОперацииНалогообложенияАкцизом В
	|				(ВЫБРАТЬ
	|					втуОстаткиПоАкцизамПредварительно.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом
	|				ИЗ
	|					втуОстаткиПоАкцизамПредварительно КАК втуОстаткиПоАкцизамПредварительно)) КАК КодыВидовОперацийНалогообложения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуОстаткиПоАкцизамПредварительно.БанковскаяГарантия КАК БанковскаяГарантия,
	|	ЕСТЬNULL(втуВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0) КАК НалоговаяСтавка,
	|	СУММА(втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукции) * 10 КАК ОстатокСпиртаВНереализованнойПродукции,
	|	СУММА(втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукцииКонецПериода) * 10 КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода,
	|	СУММА(втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукцииКонецПериода * ЕСТЬNULL(втуВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0) * 10) КАК СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода,
	|	СУММА(втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВПути) * 10 КАК ОстатокСпиртаВПути
	|ПОМЕСТИТЬ втОстаткиАкцизов
	|ИЗ
	|	втуОстаткиПоАкцизамПредварительно КАК втуОстаткиПоАкцизамПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ втуВидыПодакцизныхТоваров КАК втуВидыПодакцизныхТоваров
	|		ПО втуОстаткиПоАкцизамПредварительно.ВидОперацииНалогообложенияАкцизом = втуВидыПодакцизныхТоваров.ВидОперацииНалогообложенияАкцизом
	|ГДЕ
	|	(Не втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукции = 0
	|			ИЛИ Не втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукцииКонецПериода = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	втуОстаткиПоАкцизамПредварительно.БанковскаяГарантия,
	|	ЕСТЬNULL(втуВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуОстаткиПоАкцизамПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуВидыПодакцизныхТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втБанковскиеГарантии.Сделка КАК БанковскаяГарантия,
	|	АкцизПоПриобретеннымЦенностям.Период КАК Период,
	|	АкцизПоПриобретеннымЦенностям.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностям.Сделка КАК ДокументНачисленияАванса,
	|	АкцизПоПриобретеннымЦенностям.Количество КАК Количество,
	|	АкцизПоПриобретеннымЦенностям.СостояниеОплатыАванса КАК СостояниеОплатыАванса
	|ПОМЕСТИТЬ втуАвансыВычеты
	|ИЗ
	|	втБанковскиеГарантии КАК втБанковскиеГарантии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям КАК АкцизПоПриобретеннымЦенностям
	|		ПО втБанковскиеГарантии.Сделка = АкцизПоПриобретеннымЦенностям.Сделка
	|			И (ТИПЗНАЧЕНИЯ(АкцизПоПриобретеннымЦенностям.Регистратор) = ТИП(Документ.битРасчетАвансовПоАкцизам))
	|			И (АкцизПоПриобретеннымЦенностям.Организация = &Организация)
	|			И (АкцизПоПриобретеннымЦенностям.Период <= &КонецПериода)
	|			И (АкцизПоПриобретеннымЦенностям.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуАвансыВычеты.БанковскаяГарантия КАК БанковскаяГарантия,
	|	СУММА(ВЫБОР
	|			КОГДА СостоянияОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.НачисленАванс)
	|				ТОГДА втуАвансыВычеты.Количество * СостоянияОплатыАванса.НалоговаяСтавка * 10
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаАвансаПоАкцизам,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(втуАвансыВычеты.Период, МЕСЯЦ) = &НачалоПериода
	|					И СостоянияОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.ОформленВычет)
	|				ТОГДА втуАвансыВычеты.Количество * СостоянияОплатыАванса.НалоговаяСтавка * 10
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРассчитанВычетТекущийПериод,
	|	СУММА(ВЫБОР
	|			КОГДА Не НАЧАЛОПЕРИОДА(втуАвансыВычеты.Период, МЕСЯЦ) = &НачалоПериода
	|					И СостоянияОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.ОформленВычет)
	|				ТОГДА втуАвансыВычеты.Количество * СостоянияОплатыАванса.НалоговаяСтавка * 10
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРассчитанВычетПрошлыеПериоды
	|ПОМЕСТИТЬ втАвансыВычетыПобанковскимГарантиям
	|ИЗ
	|	втуАвансыВычеты КАК втуАвансыВычеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_СостоянияОплатыАванса КАК СостоянияОплатыАванса
	|		ПО втуАвансыВычеты.СостояниеОплатыАванса = СостоянияОплатыАванса.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	втуАвансыВычеты.БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуАвансыВычеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеБанковскихГарантий.БанковскаяГарантия КАК БанковскаяГарантия,
	|	втДанныеБанковскихГарантий.НомерБанковскойГарантии КАК НомерБанковскойГарантии,
	|	втДанныеБанковскихГарантий.ПериодИстеченияБанковскойГарантии КАК ПериодИстеченияБанковскойГарантии,
	|	втДанныеБанковскихГарантий.ДатаВыдачи КАК ДатаВыдачи,
	|	втДанныеБанковскихГарантий.ДатаНачалаСрокаДействия КАК ДатаНачалаСрокаДействия,
	|	втДанныеБанковскихГарантий.ДатаОкончанияСрокаДействия КАК ДатаОкончанияСрокаДействия,
	|	втДанныеБанковскихГарантий.СуммаБанковскойГарантии КАК СуммаБанковскойГарантии,
	|	втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.РегистрационныйНомерИзвещения КАК РегистрационныйНомерИзвещения,
	|	втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.НомерИзвещения КАК НомерИзвещения,
	|	втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.ДатаРегистрацииИзвещения КАК ДатаРегистрацииИзвещения,
	|	втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения КАК КорНомерИзвещения,
	|	втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорДатаИзвещения КАК КорДатаИзвещения,
	|	ЕСТЬNULL(втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Поставщик,
	|	ВЫБОР
	|		КОГДА втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"""""
	|			ТОГДА втДанныеБанковскихГарантий.ИННОрганизации
	|		ИНАЧЕ """"""""
	|	КОНЕЦ КАК КорИННОрганизации,
	|	ВЫБОР
	|		КОГДА втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"""""
	|			ТОГДА втДанныеБанковскихГарантий.КППОрганизации
	|		ИНАЧЕ """"""""
	|	КОНЕЦ КАК КорКППОрганизации,
	|	ВЫБОР
	|		КОГДА втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"""""
	|			ТОГДА ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемЗакупленногоСпирта, 0)
	|		ИНАЧЕ """"""""
	|	КОНЕЦ КАК КорОбъемЭтиловогоСпирта,
	|	ВЫБОР
	|		КОГДА втДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"""""
	|			ТОГДА ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьЗакупленногоСпирта, 0)
	|		ИНАЧЕ """"""""
	|	КОНЕЦ КАК КорСуммаАвансовогоПлатежаАкциза,
	|	втДанныеБанковскихГарантий.СуммаАвансовогоПлатежаПоБанковскойГарантии КАК СуммаАвансовогоПлатежаПоБанковскойГарантии,
	|	втДанныеБанковскихГарантий.ИННОрганизации КАК ИННОрганизации,
	|	втДанныеБанковскихГарантий.КППОрганизации КАК КППОрганизации,
	|	втДанныеБанковскихГарантий.ОбъемСпиртаПоБанковскойГарантии КАК ОбъемСпиртаПоБанковскойГарантии,
	|	втДанныеБанковскихГарантий.КодВидаПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемЗакупленногоСпирта, 0) КАК ОбъемЗакупленногоСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьЗакупленногоСпирта, 0) КАК СтоимостьЗакупленногоСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемПоступившегоСпирта, 0) КАК ОбъемПоступившегоСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьПоступившегоСпирта, 0) КАК СтоимостьПоступившегоСпирта,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукции, 0) КАК ОстатокСпиртаВНереализованнойПродукции,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0) КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0) КАК СтоимостьРеализованногоСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодПодтверждено, 0) КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодПодтверждено, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодПодтверждено,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0) КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0) КАК СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпирта, 0) КАК ОбъемСписанногоПоНормеСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпирта, 0) КАК СтоимостьСписанногоПоНормеСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпирта, 0) КАК ОбъемСписанногоСверхНормыСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоСверхНормыСпирта, 0) КАК СтоимостьСписанногоСверхНормыСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемПоступившегоСпирта, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпирта, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпирта, 0) КАК ОстатокСпиртаРасчетный,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0) + ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК ОбщаяСтоимостьРеализованногоСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпирта, 0) КАК СтоимостьСписанногоПоНормеСпиртаИтого,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукцииКонецПериода, 0) КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода,
	|	ЕСТЬNULL(втОстаткиАкцизов.СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода, 0) + ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукции, 0) КАК ОстатокСпиртаВНереализованнойПродукцииРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0) КАК ОбъемРеализованногоСпиртаЗаПериодРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭСРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭСРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпиртаЗаПериод, 0) КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпиртаЗаПериод, 0) КАК СтоимостьСписанногоПоНормеСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпиртаЗаПериод, 0) КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоСверхНормыСпиртаЗаПериод, 0) КАК СтоимостьСписанногоСверхНормыСпиртаЗаПериод,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукцииКонецПериода, 0) КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериодаРаздел4,
	|	ЕСТЬNULL(втАвансыВычетыПобанковскимГарантиям.СуммаАвансаПоАкцизам, 0) КАК СуммаАвансаПоАкцизам,
	|	ЕСТЬNULL(втАвансыВычетыПобанковскимГарантиям.СуммаАвансаПоАкцизам, 0) - ЕСТЬNULL(втАвансыВычетыПобанковскимГарантиям.СуммаРассчитанВычетПрошлыеПериоды, 0) КАК СуммаНеЗачтенногоАвансаПоАкцизамНачалоПериода,
	|	ЕСТЬNULL(втАвансыВычетыПобанковскимГарантиям.СуммаРассчитанВычетТекущийПериод, 0) КАК СуммаЗачтенногоАвансаПоАкцизамТекущийПериод,
	|	ЕСТЬNULL(втАвансыВычетыПобанковскимГарантиям.СуммаАвансаПоАкцизам, 0) - ЕСТЬNULL(втАвансыВычетыПобанковскимГарантиям.СуммаРассчитанВычетПрошлыеПериоды, 0) - ЕСТЬNULL(втАвансыВычетыПобанковскимГарантиям.СуммаРассчитанВычетТекущийПериод, 0) КАК СуммаНеЗачтенногоАвансаПоАкцизам,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.БылВМестахХранения, 0) КАК БылВМестахХранения,
	|	ВЫБОР
	|		КОГДА Не втуБанковскаяГарантияНалоговыеСтавки.ВидПодакцизныхТоваровНалоговаяСтавка ЕСТЬ NULL
	|			ТОГДА втуБанковскаяГарантияНалоговыеСтавки.ВидПодакцизныхТоваровНалоговаяСтавка
	|		КОГДА Не втДанныеБанковскихГарантий.ВидПодакцизныхТоваровНалоговаяСтавка ЕСТЬ NULL
	|			ТОГДА втДанныеБанковскихГарантий.ВидПодакцизныхТоваровНалоговаяСтавка
	|		КОГДА Не втДанныеПоОборотамПоКонецПериода.НалоговаяСтавка ЕСТЬ NULL
	|			ТОГДА втДанныеПоОборотамПоКонецПериода.НалоговаяСтавка
	|		КОГДА Не втОстаткиАкцизов.НалоговаяСтавка ЕСТЬ NULL
	|			ТОГДА втОстаткиАкцизов.НалоговаяСтавка
	|		ИНАЧЕ ""???""
	|	КОНЕЦ КАК НалоговаяСтавка,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.КоличествоПроизведено, 0) * 10 КАК КоличествоПроизведено,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.КоличествоПриходЗаОтчетныйПериод, 0) * 10 КАК КоличествоПриходЗаОтчетныйПериод,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВПути, 0) КАК ОстатокСпиртаВПути,
	|	втДанныеБанковскихГарантий.РегистрацияБанковскихГарантий КАК РегистрацияБанковскихГарантий,
	|	втДанныеБанковскихГарантий.ВидПодакцизныхТоваров КАК ВидПодакцизныхТоваров,
	|	втДанныеБанковскихГарантий.ВидПодакцизныхТоваровНалоговаяСтавка КАК ВидПодакцизныхТоваровНалоговаяСтавка
	|ИЗ
	|	втДанныеБанковскихГарантий КАК втДанныеБанковскихГарантий
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеПоОборотамПоКонецПериода КАК втДанныеПоОборотамПоКонецПериода
	|		ПО втДанныеБанковскихГарантий.БанковскаяГарантия = втДанныеПоОборотамПоКонецПериода.БанковскаяГарантия
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиАкцизов КАК втОстаткиАкцизов
	|		ПО втДанныеБанковскихГарантий.БанковскаяГарантия = втОстаткиАкцизов.БанковскаяГарантия
	|		ЛЕВОЕ СОЕДИНЕНИЕ втАвансыВычетыПобанковскимГарантиям КАК втАвансыВычетыПобанковскимГарантиям
	|		ПО втДанныеБанковскихГарантий.БанковскаяГарантия = втАвансыВычетыПобанковскимГарантиям.БанковскаяГарантия
	|		ЛЕВОЕ СОЕДИНЕНИЕ втуБанковскаяГарантияНалоговыеСтавки КАК втуБанковскаяГарантияНалоговыеСтавки
	|		ПО втДанныеБанковскихГарантий.БанковскаяГарантия = втуБанковскаяГарантияНалоговыеСтавки.БанковскаяГарантия
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерИзвещения,
	|	НомерБанковскойГарантии";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПодвалОтчета()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	СправочникНоменклатура.Наименование КАК НоменклатураНаименование
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В(&Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АкцизОбороты.ПериодМесяц КАК Период,
	|	АкцизОбороты.Сделка КАК Сделка,
	|	АкцизОбороты.СостояниеСырья КАК СостояниеСырья,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Продукция = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоПродукция,
	|	СУММА(АкцизОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(АкцизОбороты.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(ВЫБОР
	|			КОГДА АкцизОбороты.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|					И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВГотовойПродукции)
	|					И (АкцизОбороты.ПериодМесяц МЕЖДУ &НачалоПериода И &КонецПериода)
	|				ТОГДА АкцизОбороты.КоличествоПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПроизведено,
	|	СУММА(ВЫБОР
	|			КОГДА АкцизОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровНаСклад
	|					И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВМестахХранения)
	|					И АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизВСырье)
	|					И (АкцизОбороты.ПериодМесяц МЕЖДУ &НачалоПериода И &КонецПериода)
	|				ТОГДА АкцизОбороты.КоличествоПриход
	|			КОГДА АкцизОбороты.Регистратор ССЫЛКА Документ.ТаможеннаяДекларацияИмпорт
	|					И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВМестахХранения)
	|					И АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ)
	|					И (АкцизОбороты.ПериодМесяц МЕЖДУ &НачалоПериода И &КонецПериода)
	|				ТОГДА АкцизОбороты.КоличествоПриход
	|			КОГДА АкцизОбороты.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|					И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВМестахХранения)
	|					И АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоНеОплаченнымМЦ)
	|					И (АкцизОбороты.ПериодМесяц МЕЖДУ &НачалоПериода И &КонецПериода)
	|				ТОГДА АкцизОбороты.КоличествоПриход	
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПриходЗаОтчетныйПериод
	|ПОМЕСТИТЬ втАкцизыОборотыПредварительно
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			,
	|			&КонецПериода,
	|			Авто,
	|			Организация = &Организация
	|				И НЕ Сделка ССЫЛКА Справочник.бг_БанковскиеГарантии
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						втНоменклатура.Номенклатура КАК Сделка
	|					ИЗ
	|						втНоменклатура КАК втНоменклатура)
	|				И НЕ СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции)) КАК АкцизОбороты
	|ГДЕ
	|	(ЛОЖЬ
	|				И НЕ ТИПЗНАЧЕНИЯ(АкцизОбороты.Регистратор) В (&ИсключаемыеТипыДокументов)
	|			ИЛИ ВЫБОР
	|				КОГДА АкцизОбороты.Регистратор ССЫЛКА Документ.битРасчетАвансовПоАкцизам
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцизОбороты.ПериодМесяц,
	|	АкцизОбороты.Сделка,
	|	АкцизОбороты.СостояниеСырья,
	|	АкцизОбороты.СтатусАкциза,
	|	АкцизОбороты.Номенклатура,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Продукция = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизОбороты.Сделка КАК Сделка,
	|	АкцизОбороты.Период КАК Период,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	АкцизОбороты.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВМестахХранения)
	|				И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БылВМестахХранения,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемЗакупленногоСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПоступившегоСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И (АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|					ИЛИ АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы))
	|						И АкцизОбороты.ЭтоПродукция)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии))
	|			ТОГДА АкцизОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период < &НачалоПериода
	|				И (АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|					ИЛИ АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы))
	|						И АкцизОбороты.ЭтоПродукция)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период < &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|				И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоПоНормеСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|				И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоСверхНормыСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|				И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|				И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод,
	|	АкцизОбороты.КоличествоПроизведено КАК КоличествоПроизведено,
	|	АкцизОбороты.КоличествоПриходЗаОтчетныйПериод КАК КоличествоПриходЗаОтчетныйПериод
	|ПОМЕСТИТЬ втуАкцизыОбороты
	|ИЗ
	|	втАкцизыОборотыПредварительно КАК АкцизОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втуАкцизыОбороты.Период КАК Период,
	|	втуАкцизыОбороты.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	МАКСИМУМ(КодыВидовОперацийНалогообложения.Период) КАК ПериодНалоговыеСтавки
	|ПОМЕСТИТЬ втуАкцизыОборотыНалоговыеСтавкиПериоды
	|ИЗ
	|	втуАкцизыОбороты КАК втуАкцизыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО втуАкцизыОбороты.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И втуАкцизыОбороты.Период >= КодыВидовОперацийНалогообложения.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	втуАкцизыОбороты.Период,
	|	втуАкцизыОбороты.ВидОперацииНалогообложенияАкцизом
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	ПериодНалоговыеСтавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втуАкцизыОборотыНалоговыеСтавкиПериоды.Период КАК Период,
	|	втуАкцизыОборотыНалоговыеСтавкиПериоды.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров.НалоговаяСтавка КАК НалоговаяСтавка
	|ПОМЕСТИТЬ втуАкцизыОборотыНалоговыеСтавки
	|ИЗ
	|	втуАкцизыОборотыНалоговыеСтавкиПериоды КАК втуАкцизыОборотыНалоговыеСтавкиПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО втуАкцизыОборотыНалоговыеСтавкиПериоды.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И втуАкцизыОборотыНалоговыеСтавкиПериоды.ПериодНалоговыеСтавки = КодыВидовОперацийНалогообложения.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуАкцизыОбороты.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(втуАкцизыОбороты.БылВМестахХранения) КАК БылВМестахХранения,
	|	СУММА(втуАкцизыОбороты.ОбъемЗакупленногоСпирта) * 10 КАК ОбъемЗакупленногоСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемЗакупленногоСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьЗакупленногоСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемПоступившегоСпирта) * 10 КАК ОбъемПоступившегоСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемПоступившегоСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьПоступившегоСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериод * 10) КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериод * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению * 10) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодПодтверждено) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодПодтверждено * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериодПодтверждено,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды) * 10 КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды * 10) КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоПоНормеСпирта * 10) КАК ОбъемСписанногоПоНормеСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоПоНормеСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьСписанногоПоНормеСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * 10) КАК ОбъемСписанногоСверхНормыСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьСписанногоСверхНормыСпирта,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод * 10) КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоПоНормеСпиртаЗаПериод * 10) КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоПоНормеСпиртаЗаПериод * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьСписанногоПоНормеСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоСверхНормыСпиртаЗаПериод) * 10 КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * ЕСТЬNULL(втуАкцизыОборотыНалоговыеСтавки.НалоговаяСтавка, 0)) * 10 КАК СтоимостьСписанногоСверхНормыСпиртаЗаПериод,
	|	СУММА(втуАкцизыОбороты.КоличествоПроизведено) * 1 КАК КоличествоПроизведено,
	|	СУММА(втуАкцизыОбороты.КоличествоПриходЗаОтчетныйПериод) * 1 КАК КоличествоПриходЗаОтчетныйПериод
	|ПОМЕСТИТЬ втДанныеПоОборотамПоКонецПериода
	|ИЗ
	|	втуАкцизыОбороты КАК втуАкцизыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втуАкцизыОборотыНалоговыеСтавки КАК втуАкцизыОборотыНалоговыеСтавки
	|		ПО втуАкцизыОбороты.ВидОперацииНалогообложенияАкцизом = втуАкцизыОборотыНалоговыеСтавки.ВидОперацииНалогообложенияАкцизом
	|			И втуАкцизыОбороты.Период = втуАкцизыОборотыНалоговыеСтавки.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	втуАкцизыОбороты.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуАкцизыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка КАК Сделка,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья КАК СостояниеСырья,
	|	АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза КАК СтатусАкциза,
	|	АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстаток КАК КоличествоОстатокНачалоПериода,
	|	0 КАК КоличествоОстатокКонецПериода
	|ПОМЕСТИТЬ втОстаткиОборотыПоАкцизам
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Остатки(
	|			&НачалоПериодаГраница,
	|			Организация = &Организация
	|				И НЕ Сделка ССЫЛКА Справочник.бг_БанковскиеГарантии
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						втНоменклатура.Номенклатура КАК Сделка
	|					ИЗ
	|						втНоменклатура КАК втНоменклатура)
	|				И НЕ СтатусАкциза В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути))) КАК АкцизПоПриобретеннымЦенностямОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья,
	|	АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза,
	|	0,
	|	АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И НЕ Сделка ССЫЛКА Справочник.бг_БанковскиеГарантии
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						втНоменклатура.Номенклатура КАК Сделка
	|					ИЗ
	|						втНоменклатура КАК втНоменклатура)
	|				И НЕ СтатусАкциза В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции), ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути))) КАК АкцизПоПриобретеннымЦенностямОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка КАК Сделка,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	ВЫБОР
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|			ТОГДА АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстатокКонецПериода
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокСпиртаВПути,
	|	ВЫБОР
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспорт)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭСГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспорта)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет)
	|			ТОГДА 0
	|		КОГДА ЛОЖЬ
	|				И (АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВРеализованнойПродукции)
	|					ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВыполненоСписание)
	|					ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет))
	|			ТОГДА 0
	|		ИНАЧЕ АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстатокНачалоПериода
	|	КОНЕЦ КАК ОстатокСпиртаВНереализованнойПродукции,
	|	ВЫБОР
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспорт)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭСГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспорта)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет)
	|			ТОГДА 0
	|		КОГДА ЛОЖЬ
	|				И (АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВРеализованнойПродукции)
	|					ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВыполненоСписание)
	|					ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет))
	|			ТОГДА 0
	|		ИНАЧЕ АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстатокКонецПериода
	|	КОНЕЦ КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода
	|ПОМЕСТИТЬ втуОстаткиПоАкцизамПредварительно
	|ИЗ
	|	втОстаткиОборотыПоАкцизам КАК АкцизПоПриобретеннымЦенностямОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров КАК ВидПодакцизныхТоваров
	|ПОМЕСТИТЬ втуВидыПодакцизныхТоваров
	|ИЗ
	|	РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом.СрезПоследних(
	|			&КонецПериода,
	|			ВидОперацииНалогообложенияАкцизом В
	|				(ВЫБРАТЬ
	|					втуОстаткиПоАкцизамПредварительно.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом
	|				ИЗ
	|					втуОстаткиПоАкцизамПредварительно КАК втуОстаткиПоАкцизамПредварительно)) КАК КодыВидовОперацийНалогообложения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втуОстаткиПоАкцизамПредварительно.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(втуВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0) КАК НалоговаяСтавка,
	|	СУММА(втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукции) * 10 КАК ОстатокСпиртаВНереализованнойПродукции,
	|	СУММА(втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукцииКонецПериода) * 10 КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода,
	|	СУММА(втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукцииКонецПериода * ЕСТЬNULL(втуВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0) * 10) КАК СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода,
	|	СУММА(втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВПути) * 10 КАК ОстатокСпиртаВПути
	|ПОМЕСТИТЬ втОстаткиАкцизов
	|ИЗ
	|	втуОстаткиПоАкцизамПредварительно КАК втуОстаткиПоАкцизамПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ втуВидыПодакцизныхТоваров КАК втуВидыПодакцизныхТоваров
	|		ПО втуОстаткиПоАкцизамПредварительно.ВидОперацииНалогообложенияАкцизом = втуВидыПодакцизныхТоваров.ВидОперацииНалогообложенияАкцизом
	|ГДЕ
	|	(НЕ втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукции = 0
	|			ИЛИ НЕ втуОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукцииКонецПериода = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	втуОстаткиПоАкцизамПредварительно.Номенклатура,
	|	ЕСТЬNULL(втуВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуОстаткиПоАкцизамПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втуВидыПодакцизныхТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.Номенклатура КАК Номенклатура,
	|	втНоменклатура.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемЗакупленногоСпирта, 0) КАК ОбъемЗакупленногоСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьЗакупленногоСпирта, 0) КАК СтоимостьЗакупленногоСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемПоступившегоСпирта, 0) КАК ОбъемПоступившегоСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьПоступившегоСпирта, 0) КАК СтоимостьПоступившегоСпирта,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукции, 0) КАК ОстатокСпиртаВНереализованнойПродукции,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0) КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0) КАК СтоимостьРеализованногоСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодПодтверждено, 0) КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодПодтверждено, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодПодтверждено,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0) КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0) КАК СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпирта, 0) КАК ОбъемСписанногоПоНормеСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпирта, 0) КАК СтоимостьСписанногоПоНормеСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпирта, 0) КАК ОбъемСписанногоСверхНормыСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоСверхНормыСпирта, 0) КАК СтоимостьСписанногоСверхНормыСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемПоступившегоСпирта, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпирта, 0) - ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпирта, 0) КАК ОстатокСпиртаРасчетный,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0) + ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК ОбщаяСтоимостьРеализованногоСпирта,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпирта, 0) КАК СтоимостьСписанногоПоНормеСпиртаИтого,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукцииКонецПериода, 0) КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода,
	|	ЕСТЬNULL(втОстаткиАкцизов.СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода, 0) + ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукции, 0) КАК ОстатокСпиртаВНереализованнойПродукцииРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0) КАК ОбъемРеализованногоСпиртаЗаПериодРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭСРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭСРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпиртаЗаПериод, 0) КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпиртаЗаПериод, 0) КАК СтоимостьСписанногоПоНормеСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпиртаЗаПериод, 0) КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоСверхНормыСпиртаЗаПериод, 0) КАК СтоимостьСписанногоСверхНормыСпиртаЗаПериод,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукцииКонецПериода, 0) КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериодаРаздел4,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.БылВМестахХранения, 0) КАК БылВМестахХранения,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.КоличествоПроизведено, 0) * 10 КАК КоличествоПроизведено,
	|	ЕСТЬNULL(втДанныеПоОборотамПоКонецПериода.КоличествоПриходЗаОтчетныйПериод, 0) * 10 КАК КоличествоПриходЗаОтчетныйПериод,
	|	ЕСТЬNULL(втОстаткиАкцизов.ОстатокСпиртаВПути, 0) КАК ОстатокСпиртаВПути
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеПоОборотамПоКонецПериода КАК втДанныеПоОборотамПоКонецПериода
	|		ПО втНоменклатура.Номенклатура = втДанныеПоОборотамПоКонецПериода.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиАкцизов КАК втОстаткиАкцизов
	|		ПО втНоменклатура.Номенклатура = втОстаткиАкцизов.Номенклатура";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

 
Функция ИсключаемыеИзРасчетаТипыДокументов()
	
	ИсключаемыеТипыДокументов = Новый Массив;
	ИсключаемыеТипыДокументов.Добавить(Тип("ДокументСсылка.битРасчетАвансовПоАкцизам"));
	
	Возврат ИсключаемыеТипыДокументов;
	
КонецФункции

Функция СостоянияСырьяВРеализованнойПродукции() Экспорт
	
	СостоянияСырья = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВРеализованнойПродукцииРФ());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВОжиданииПодтвержденияЭкспорта());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВРеализованнойПродукцииПодтвержденоЭкспорт());
	
	Возврат СостоянияСырья;
	
КонецФункции

Функция СостоянияСырьяВРеализованнойПродукцииРФ() Экспорт
	
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции);
	
	Возврат СостоянияСырья;
	
КонецФункции

Функция СостоянияСырьяВРеализованнойПродукцииПодтвержденоЭкспорт() Экспорт
	
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспорт);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭС);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортГарантии);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭСГарантии);
	
	Возврат СостоянияСырья;
	
КонецФункции

Функция СостоянияСырьяВОжиданииПодтвержденияЭкспорта() Экспорт
	
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспорта);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаЕАЭС);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС);
	
	Возврат СостоянияСырья;
	
КонецФункции
                                
Функция СостоянияСырьяВыполненоСписание() Экспорт
	
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы);
	
	Возврат СостоянияСырья;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
