#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ОшибкиПоискаСоответствийНоменклатуры") Тогда
		Возврат;
	КонецЕсли;
	
	ПредставленияОшибок = Новый Массив;
	
	Для Каждого НаборОшибок Из Параметры.ОшибкиПоискаСоответствийНоменклатуры Цикл
		
		ИмяФайлаВладельца = НаборОшибок.Ключ;
		
		Ошибки = ИмяФайлаВладельца + Символы.ПС + СтрСоединить(НаборОшибок.Значение, Символы.ПС);
		
		ПредставленияОшибок.Добавить(Ошибки);
		
	КонецЦикла;
	
	Если ПредставленияОшибок.Количество() <> 0 Тогда
		
		ШаблонРазделения = 
		"
		|
		|%1
		|
		|";
		
		ПомещаемыйТекст = СтрСоединить(ПредставленияОшибок, СтрШаблон(ШаблонРазделения, ";")); 
		ПредставлениеОшибок.ВставитьСтроку(1, ПомещаемыйТекст);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
