#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбработатьОбъект(Команда)
	ОбработатьВыделенныеСтрокиНаСервере(Элементы.Список.ВыделенныеСтроки);
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВыделенныеСтрокиНаСервере(Знач ВыделенныеСтроки)
	Для каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		ОбработатьОбъектНаСервере(ТекущаяСтрока.Объект, ТекущаяСтрока.ВариантОбработки, ТекущаяСтрока.ВремяРегистрации);
	КонецЦикла;
КонецПроцедуры
	
&НаСервереБезКонтекста
Процедура ОбработатьОбъектНаСервере(Объект, ВариантОбработки, ВремяРегистрации)
	РегистрыСведений.бг_ОбъектыДляОтложеннойОбработки.ОбработатьОбъект(Объект, ВариантОбработки, , ВремяРегистрации);
КонецПроцедуры

#КонецОбласти