
#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ОтборГУИДПриИзменении(Элемент)
	
	ЭлементыОтбораУдалить = Новый Массив;
	
	Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "ОтборГУИД" Тогда
			ЭлементыОтбораУдалить.Добавить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ЭлементОтбораУдалить Из ЭлементыОтбораУдалить Цикл
		Список.Отбор.Элементы.Удалить(ЭлементОтбораУдалить);
	КонецЦикла;
	
	Если Не ПустаяСтрока(ОтборГУИД) И СтрДлина(ОтборГУИД) = 36 Тогда
		
		Попытка
			ГУИД = Новый УникальныйИдентификатор(ОтборГУИД);
		Исключение
			Возврат;
		КонецПопытки;
		
		НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.Представление = "ОтборГУИД";
		НовыйОтбор.Использование = Истина;
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГУИДМарки");
		НовыйОтбор.ПравоеЗначение = ГУИД;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
