
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_WMS.ДобавитьПоляНаФормуДокумента(ЭтаФорма);
	бг_ДобавитьПолеНеАктуализироватьЗаказыКлиентовПоРезервам();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ДобавитьПолеНеАктуализироватьЗаказыКлиентовПоРезервам()
	
	бг_НеАктуализироватьЗаказыКлиентовПоРезервам = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НеАктуализироватьЗаказыКлиентовПоРезервам",
		Элементы.ГруппаДополнительно,
		"Объект.бг_НеАктуализироватьЗаказыКлиентовПоРезервам",,,
		"ПолеФлажка");
	
КонецПроцедуры

#КонецОбласти

