#Область ПрограммныИнтерфейс
	
Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	Реквизиты = ВыгружаемыеРеквизиты();
	
	адаптер_НастройкиОбмена.УстановитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		Реквизиты);	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Реквизиты шапки
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("Проведен");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("Автор");
	ВыгружаемыеРеквизиты.Добавить("СуммаПоДокументу");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
		
	// Реквизиты ТЧ "Оплаты"
	ВыгружаемыеРеквизиты.Добавить("Оплаты.Контрагент");
	ВыгружаемыеРеквизиты.Добавить("Оплаты.Договор");
	ВыгружаемыеРеквизиты.Добавить("Оплаты.СуммаВРозницу");
	ВыгружаемыеРеквизиты.Добавить("Оплаты.Сумма");
	ВыгружаемыеРеквизиты.Добавить("Оплаты.ДокументОтгрузки");
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

#КонецОбласти 
