
#Область ПрограммныйИнтерфейс

// Записывает в регистр сведений информацию осоответствии объектов
// Параметры:
//  ОбъектERP - СправочникСсылка
//  ОбъектУПП - Строка
//
Процедура УстановитьСоответствие(ОбъектERP, ОбъектУПП) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.бг_СоответствиеОбъектовУПП.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ОбъектERP = ОбъектERP;
	МенеджерЗаписи.ОбъектУПП = ОбъектУПП;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ОбъектУПП(ОбъектERP) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	бг_СоответствиеОбъектовУПП.ОбъектУПП КАК ОбъектУПП
	|ИЗ
	|	РегистрСведений.бг_СоответствиеОбъектовУПП КАК бг_СоответствиеОбъектовУПП
	|ГДЕ
	|	бг_СоответствиеОбъектовУПП.ОбъектERP = &ОбъектERP";
	Запрос.УстановитьПараметр("ОбъектERP", ОбъектERP);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 2 Тогда
		Возврат Неопределено;
	Иначе
		Выборка.Следующий();
		Возврат Выборка.ОбъектУПП;
	КонецЕсли;
	
КонецФункции

Функция ОбъектERP(ОбъектУПП) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	бг_СоответствиеОбъектовУПП.ОбъектERP КАК ОбъектERP
	|ИЗ
	|	РегистрСведений.бг_СоответствиеОбъектовУПП КАК бг_СоответствиеОбъектовУПП
	|ГДЕ
	|	бг_СоответствиеОбъектовУПП.ОбъектУПП = &ОбъектУПП";
	Запрос.УстановитьПараметр("ОбъектУПП", ОбъектУПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 2 Тогда
		Возврат Неопределено;
	Иначе
		Выборка.Следующий();
		Возврат Выборка.ОбъектERP;
	КонецЕсли;
	
КонецФункции

#КонецОбласти