 
 &После("ДобавитьКомандыПечати")
Процедура бг_ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
  	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.бг_ПечатьОС";
	КомандаПечати.Идентификатор = "ОС1_Георгиевский";
	КомандаПечати.Представление = НСтр("ru = 'ОС-1 (Акт о приеме-передаче ОС) ООО ""Георгиевский""';
										|en = 'FA-1 (Certificate of FA handover) LLC ""Georgievsky""'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ФункциональныеОпции = "ИспользоватьРеглУчет";
	
КонецПроцедуры