#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПунктНазначенияОкончаниеВыбора", ЭтаФорма);
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("РежимВыбора", Истина);
	ДопПараметры.Вставить("Контрагент", Запись.Контрагент);
	
	ОткрытьФорму("РегистрСведений.бг_КредитныеЛимиты.Форма.ФормаПодбораПунктаНазначения", 
												ДопПараметры, 
												ЭтаФорма,
												,,, 
												ОписаниеОповещения, 
												РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
												
КонецПроцедуры

&НаКлиенте
Процедура ПунктНазначенияОкончаниеВыбора(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.ПунктНазначения = Результат;
		
КонецПроцедуры

#КонецОбласти 


