
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьЭлементОснование();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьЭлементОснование()
	
	Если Не ЗначениеЗаполнено(Объект.бг_Основание) Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"бг_Основание",
		,
		"Объект.бг_Основание");
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти
