
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТабличныйДокумент") Тогда
		ТабличныйДокумент = Параметры.ТабличныйДокумент;				
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаказКлиента") Тогда
		ЗаказКлиента = Параметры.ЗаказКлиента;				
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаСервере
Процедура СформироватьНаСервере()
	
	ТабличныйДокумент.Очистить();	
	ТабличныйДокумент = Обработки.бг_СогласованиеПродаж.ОтчетДляСогласованияСБПоЗаказуКлиента(ЗаказКлиента);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	ОбновитьОтображениеДанных(Элементы.ТабличныйДокумент);

КонецПроцедуры

#КонецОбласти 