
&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьКомандуЗапросНаОтменуПроведения();
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьКомандуЗапросНаОтменуПроведения()
	
	ИмяКоманды       = "бг_ЗапросНаОтменуПроведения";
	ЗаголовокКоманды = НСтр("ru = 'Отменить акт списания';
								|en = 'Cancellation request'");
	
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьКнопкуНаФорму(ЭтотОбъект, ИмяКоманды,
								Элементы.СписокКоманднаяПанель, ЗаголовокКоманды,
								ИмяКоманды, ИмяКоманды, , ВидКнопкиФормы.КнопкаКоманднойПанели);
								
КонецПроцедуры


&НаКлиенте
Процедура бг_ЗапросНаОтменуПроведения(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите документ для отмены проведения");
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.СтатусЕГАИС = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиАктаСписанияЕГАИС.ПроведенЕГАИС") Тогда
		ПоказатьПредупреждение(, "Выберите документ со статусом ""Проведен ЕГАИС""");
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
		ТекущиеДанные.Ссылка,
		ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ЗапроситеОтменуПроведения"),
		ЭтотОбъект.УникальныйИдентификатор);

КонецПроцедуры

