
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ЗначениеЗаполнено(Менеджер) Тогда
		ВызватьИсключение НСтр("ru = 'Выберите менеджера'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
		ВызватьИсключение НСтр("ru = 'Укажите дату начала действия'");
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Менеджер", Менеджер);
	Результат.Вставить("ДатаНачалаДействия", ДатаНачалаДействия);
	
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти