#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список штрихкодов.
//
// Параметры:
//  Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
//
// Возвращаемое значение:
//  Массив
//
Функция бг_Штрихкоды(Упаковка) Экспорт
	
	Если Не ЗначениеЗаполнено(Упаковка) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ДанныеУпаковки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Упаковка,
		"Владелец, Владелец.ВидНоменклатуры.бг_ВариантСинхронизацииWMS");
		
	ВариантСинхронизацииWMS = ДанныеУпаковки.ВладелецВидНоменклатурыбг_ВариантСинхронизацииWMS;
	
	Если ВариантСинхронизацииWMS = Перечисления.бг_ВариантыСинхронизацииНоменклатурыWMS.КодЕК_Номенклатуры Тогда
		
		Штрихкоды = Справочники.бг_Штрихкоды_ЕК_Номенклатуры.ШтрихкодыУпаковки(Упаковка);
		
	Иначе
		
		Штрихкоды = РегистрыСведений.ШтрихкодыНоменклатуры.ШтрихкодыНоменклатуры(
			ДанныеУпаковки.Владелец,
			Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),
			Упаковка);
			
	КонецЕсли;
	
	Возврат Штрихкоды;
	
КонецФункции

#КонецОбласти

#КонецЕсли
