#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ВыполнитьПроверкуУникальности(Отказ);
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПроверкуУникальности(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыВладенияТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бг_ДоговорыВладенияТС КАК ДоговорыВладенияТС
	|ГДЕ
	|	ДоговорыВладенияТС.Перевозчик = &Перевозчик
	|	И ДоговорыВладенияТС.Наименование = &Наименование
	|	И НЕ ДоговорыВладенияТС.ПометкаУдаления
	|	И ДоговорыВладенияТС.Ссылка <> &ТекущийДоговор";
	Запрос.УстановитьПараметр("Перевозчик", Перевозчик);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ТекущийДоговор", Ссылка);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Для перевозчика %1 уже существует договор %2'"), Перевозчик, Наименование);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
