
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПроверятьПаллетыПриИзменении(Элемент)
	
	Если Не Объект.ПроверятьПаллеты Тогда
		Объект.КоличествоПроверяемыхКоробокВПаллете = 0;	
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьКоробкиПриИзменении(Элемент)
	
	Если Не Объект.ПроверятьКоробки Тогда
		Объект.КоличествоПроверяемыхБутылокВКоробке = 0;	
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступность(Форма)
	
	Форма.Элементы.ГруппаПараметрыПриемки.Доступность = Не ЭтоПредопределенныйТипПриемки(Форма.Объект.Ссылка);
	
	Форма.Элементы.КоличествоПроверяемыхКоробокВПаллете.Доступность = Форма.Объект.ПроверятьПаллеты;
	Форма.Элементы.КоличествоПроверяемыхБутылокВКоробке.Доступность = Форма.Объект.ПроверятьКоробки;	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПредопределенныйТипПриемки(Ссылка)

	Возврат Ссылка = Справочники.битТипыПриемкиWMS.БезПроверки
		Или Ссылка = Справочники.битТипыПриемкиWMS.Полная;

КонецФункции

#КонецОбласти

