
#Область ОбработчикиСобытий

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьПоляMSНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьПоляMSНаСервере()

	Перем бг_МодификацияИнтерфейсовОбщегоНазначенияСервер; // Используем модуль из расширения БИТMDT.
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер = ОбщегоНазначения.ОбщийМодуль("бг_МодификацияИнтерфейсовОбщегоНазначенияСервер");
		
	// Группа "Mobile smarts".
	ГруппаMS = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтаФорма, 
		"бг_ГруппаMS", 
		Элементы.СтраницаДополнительныеРеквизиты);
		
	ГруппаMS.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаMS.ОтображатьЗаголовок = Истина;
	ГруппаMS.Заголовок = НСтр("ru = 'Mobile Smarts'");
	
	// Поле "Идентификатор пользователя (Mobile Smarts)". 
	ПолеИдентификаторПользователяMS = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"бг_ИдентификаторПользователяMS",
		ГруппаMS,
		"Объект.бг_ИдентификаторПользователяMS");
		
	ПолеИдентификаторПользователяMS.ТолькоПросмотр = Истина;

КонецПроцедуры

#КонецОбласти
