
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьПолеПартнерПеревыставлениеНаСервере();
	
	бг_ДобавитьПолеАвизо();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьПолеПартнерПеревыставлениеНаСервере()

	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма, 
		"бг_ПартнерПеревыставление", 
		Элементы.ГруппаДополнительныеРеквизиты, 
		"Объект.бг_ПартнерПеревыставление");
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеАвизо()
	
	бг_Авизо = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"бг_Авизо",
		Элементы.ГруппаДополнительныеРеквизиты, 
		"Объект.бг_Авизо",
		,
		,
		"ПолеФлажка");
	бг_Авизо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
