
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьПолеВладельца();
	
КонецПроцедуры

#КонецОбласти //ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции  

&НаСервере
Процедура бг_ДобавитьПолеВладельца()
	
	бг_Владелец = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ВладелецСертификата",
		Элементы.ГруппаОсновныеРеквизиты,
		"Объект.бг_ВладелецСертификата",
		,
		Элементы.ГруппаСрокДействия);
	бг_Владелец.АвтоМаксимальнаяШирина = Ложь;  
	
КонецПроцедуры

#КонецОбласти //СлужебныеПроцедурыИФункции