#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	ИменаРеквизитов = ВыгружаемыеРеквизиты();
	адаптер_НастройкиОбмена.ОставитьРеквизиты(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ИменаРеквизитов);
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства, ФорматСообщения);
	
КонецПроцедуры

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ЗаказКлиента_ЗначениеРеквизитаИдентификатор,",
		"Выразить(ВыгружаемыйОбъект.Распоряжение.ДокументОснование КАК Документ.ЗаказКлиента) КАК ЗаказКлиента_ЗначениеРеквизитаИдентификатор,");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ЗаказКлиента_ЗначениеРеквизитаТаблицаКлючей,",
		"Выразить(ВыгружаемыйОбъект.Распоряжение.ДокументОснование КАК Документ.ЗаказКлиента).Ссылка КАК ЗаказКлиента_ЗначениеРеквизитаТаблицаКлючей,");

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()
	Результат = "Дата,Номер,Проведен,ПометкаУдаления,Распоряжение,Статус,Спецификация,Этап,Подразделение,Организация,
				|Ответственный,Комментарий,ФактическоеНачалоЭтапа,ФактическоеОкончаниеЭтапа,ДатаОтгрузки,ДатаПроизводства,
				|ХозяйственнаяОперация,Исполнитель,Валюта,
				|ВыходныеИзделия.Номенклатура,ВыходныеИзделия.Характеристика,ВыходныеИзделия.Серия,
				|ВыходныеИзделия.Упаковка,ВыходныеИзделия.Количество,ВыходныеИзделия.КоличествоУпаковок,
				|ВыходныеИзделия.Получатель,ВыходныеИзделия.ДоляСтоимости,ВыходныеИзделия.Подразделение,
				|ВыходныеИзделия.Произведено,ВыходныеИзделия.ДатаПроизводства,
				|ПобочныеИзделия.Номенклатура,ПобочныеИзделия.Характеристика,ПобочныеИзделия.Серия,
				|ПобочныеИзделия.Упаковка,ПобочныеИзделия.Количество,ПобочныеИзделия.КоличествоУпаковок,
				|ПобочныеИзделия.Получатель,ПобочныеИзделия.Подразделение,
				|ОбеспечениеМатериаламиИРаботами.Номенклатура,ОбеспечениеМатериаламиИРаботами.Характеристика,
				|ОбеспечениеМатериаламиИРаботами.Серия,ОбеспечениеМатериаламиИРаботами.Упаковка,
				|ОбеспечениеМатериаламиИРаботами.Количество,ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок,
				|ОбеспечениеМатериаламиИРаботами.Склад,ОбеспечениеМатериаламиИРаботами.Спецификация,
				|ОбеспечениеМатериаламиИРаботами.Подразделение,
				|РасходМатериаловИРабот.Номенклатура,РасходМатериаловИРабот.Характеристика,
				|РасходМатериаловИРабот.Серия,РасходМатериаловИРабот.Упаковка,
				|РасходМатериаловИРабот.Количество,РасходМатериаловИРабот.КоличествоУпаковок,
				|РасходМатериаловИРабот.Подразделение
				|";
	Возврат СтрЗаменить(Результат, Символы.ПС, "");
КонецФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства, ФорматСообщения)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, 
		"ЗаказКлиента",
		Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
		
КонецПроцедуры

#КонецОбласти 
