#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьТаблицуРейсов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТаблицуРейсов", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РейсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "РейсыРейс"
		И ЗначениеЗаполнено(Элементы.Рейсы.ТекущиеДанные.Рейс) Тогда
		ПоказатьЗначение( , Элементы.Рейсы.ТекущиеДанные.Рейс);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьТаблицуРейсов()
	Ссылка = Элементы.Список.ТекущаяСтрока;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Рейсы, "Ссылка", Ссылка, Истина);
	Элементы.Рейсы.Обновить();
КонецПроцедуры

#КонецОбласти
