
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	Реквизиты = ВыгружаемыеРеквизиты();
	
	адаптер_НастройкиОбмена.УстановитьРеквизиты(
		РеквизитыИСвойства, 
		РеквизитыИСвойства.МетаданныеОбъекта, 
		Реквизиты);
				
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Стандартные реквизиты
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	
	// Шапка
	ВыгружаемыеРеквизиты.Добавить("АналитикаРасходовПроценты");
	ВыгружаемыеРеквизиты.Добавить("АналитикаРасходовУслуги");
	ВыгружаемыеРеквизиты.Добавить("Балансодержатель");
	ВыгружаемыеРеквизиты.Добавить("БанковскийСчет");
	ВыгружаемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
	ВыгружаемыеРеквизиты.Добавить("бг_ВидВзаиморасчетов");
	ВыгружаемыеРеквизиты.Добавить("ВалютаВзаиморасчетов");
	ВыгружаемыеРеквизиты.Добавить("ГруппаФинансовогоУчета");
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("ДатаНачалаДействия");
	ВыгружаемыеРеквизиты.Добавить("ДатаОкончанияДействия");
	ВыгружаемыеРеквизиты.Добавить("ДатаПоследнегоПлатежа");
	ВыгружаемыеРеквизиты.Добавить("ЕстьАвансированиеВыкупнойСтоимости");
	ВыгружаемыеРеквизиты.Добавить("ЕстьВыкупПредметовАренды");
	ВыгружаемыеРеквизиты.Добавить("ЕстьОбеспечительныйПлатеж");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	ВыгружаемыеРеквизиты.Добавить("КонтактноеЛицо");
	ВыгружаемыеРеквизиты.Добавить("Контрагент");
	ВыгружаемыеРеквизиты.Добавить("НаименованиеДляПечати");
	ВыгружаемыеРеквизиты.Добавить("НаправлениеДеятельности");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("ОплатаВВалюте");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("Ответственный");
	ВыгружаемыеРеквизиты.Добавить("Партнер");
	ВыгружаемыеРеквизиты.Добавить("Подразделение");
	ВыгружаемыеРеквизиты.Добавить("ПодразделениеПроценты");
	ВыгружаемыеРеквизиты.Добавить("ПодразделениеУслуги");
	ВыгружаемыеРеквизиты.Добавить("Согласован");
	ВыгружаемыеРеквизиты.Добавить("СпособОпределенияСтоимостиАктивов");
	ВыгружаемыеРеквизиты.Добавить("Статус");
	ВыгружаемыеРеквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовПроценты");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходовУслуги");
	ВыгружаемыеРеквизиты.Добавить("ТипДоговора");
	ВыгружаемыеРеквизиты.Добавить("УчитыватьПредметыАрендыВРеглУчете");
	ВыгружаемыеРеквизиты.Добавить("УчитыватьПредметыАрендыВУпрУчете");
	ВыгружаемыеРеквизиты.Добавить("ХарактерДоговора");
			
	Возврат ВыгружаемыеРеквизиты;

КонецФункции

#КонецОбласти
