
#Область ПрограммныйИнтерфейс

&После("ПриПолученииПредставления")
Процедура бг_ПриПолученииПредставления(ТипДанных, Данные, Представление, СтандартнаяОбработка)
	
	Если ТипДанных = Тип("ДокументСсылка.ТТНИсходящаяЕГАИС")
		Или ТипДанных = Тип("ДокументСсылка.ТТНВходящаяЕГАИС") Тогда
		
		ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Данные.Ссылка);

		Представление = СтрЗаменить(Данные.Представление,
						НСтр("ru = 'Товарно-транспортная накладная'"),
						НСтр("ru = 'ТТН'"));
		
		Если (Данные.СуммаДокумента <> 0) И (Данные.СуммаДокумента <> NULL) Тогда
			Представление = Представление
				+ " " + НСтр("ru = 'на сумму';
							|en = 'in the amount of'")
				+ " " + Данные.СуммаДокумента
				+ " " + Данные.Валюта
				+ " " + СтрШаблон(НСтр("ru = '(%1)'"),
						ТекущееСостояние.Статус);
		КонецЕсли;

		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
