
&После("НастроитьВариантыОтчетов")
Процедура бг_НастроитьВариантыОтчетов(Настройки) Экспорт

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.бг_ВедомостьПоОС_Консервация);	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "бг_ВедомостьПоОС_Консервация");
	ОписаниеВарианта.Описание = НСтр("ru = 'Ведомость по ОС с группировкой по признаку ""На консервации"" и подразделению';
									|en = 'Fixed Asset List with grouping by fields ""On conservation"" and subdivision'")

КонецПроцедуры
