#Область ПрограммныйИнтерфейс 
 
Функция НайтиСсылкуПоЗагружаемымДанным(СтруктураОбъекта) Экспорт
	
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	Если СтруктураОбъекта = Неопределено Тогда
		Возврат Справочники.КлассификаторБанков.ПустаяСсылка();
	КонецЕсли; 
	
	Банк = адаптер_РаботаСДаннымиИБ.НайтиСсылкуПоЗагружаемымДанным(СтруктураОбъекта);
	
	Если ОбщегоНазначения.СсылкаСуществует(Банк) Тогда
		Возврат Банк;
	Иначе
		Возврат Справочники.КлассификаторБанков.НайтиПоКоду(СтруктураОбъекта.Код); 
	КонецЕсли;
		
КонецФункции

#КонецОбласти