&После("ПриОпределенииОбъектовСКомандамиСозданияНаОсновании")
// Определяет список объектов конфигурации, в модулях менеджеров которых предусмотрена процедура 
// ДобавитьКомандыСозданияНаОсновании, формирующая команды создания на основании объектов.
// Синтаксис процедуры ДобавитьКомандыСозданияНаОсновании см. в документации.
//
// Параметры:
//   Объекты - Массив - объекты метаданных (ОбъектМетаданных) с командами создания на основании.
//
// Пример:
//  Объекты.Добавить(Метаданные.Справочники.Организации);
//
Процедура бг_ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт
	
	//++ ЕГАИС
	Объекты.Добавить(Метаданные.Документы.битАктОбУничтоженииФСМ);
	//-- ЕГАИС
	
	Объекты.Добавить(Метаданные.Документы.битФакторинг);
	
КонецПроцедуры

