#Область бг_ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьИВывестиПоляНСИ();
	
КонецПроцедуры

#КонецОбласти

#Область бг_СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьИВывестиПоляНСИ()
	
	Если ТипЗнч(Параметры.ПрисоединенныйФайл) <> Тип("СправочникСсылка.битТоварныеКатегорииПрисоединенныеФайлы") Тогда
		Возврат;
	КонецЕсли;
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(
		Новый РеквизитФормы(
			"бг_НазначениеИзображения",
			Новый ОписаниеТипов("СправочникСсылка.битТоварныеКатегорииПрисоединенныеФайлы"),
			"ОбъектПрототип",
			НСтр("ru = 'Назначение изображения'")));
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НазначениеИзображения0",
		Элементы.ГруппаСведенияЧасть1,
		"ОбъектПрототип[0].бг_НазначениеИзображения");
	
КонецПроцедуры

#КонецОбласти
