
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	бг_ДобавитьЭлементДокументОснование();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьЭлементДокументОснование()
	
	бг_ДокументОснование = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ДокументОснование",
		Элементы.ГруппаИнформация,
		"Объект.бг_ДокументОснование",,
		Элементы.ДатаНомер,
		"ПолеНадписи");
	бг_ДокументОснование.Заголовок = НСтр("ru = 'Основание'");
	бг_ДокументОснование.Гиперссылка = Истина;
	
КонецПроцедуры

#КонецОбласти

