Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	ИменаРеквизитов = "Дата,Номер,Проведен,ПометкаУдаления,Организация,ХозяйственнаяОперация,Валюта,
				|НомерВходящегоДокумента,ДатаВходящегоДокумента,Контрагент,Договор,Ответственный,Комментарий,
				|ДенежныеДокументы.ДенежныйДокумент,ДенежныеДокументы.Количество,ДенежныеДокументы.Сумма,ДенежныеДокументы.Цена,ДенежныеДокументы.Валюта";
	ИменаРеквизитов = СтрЗаменить(ИменаРеквизитов, Символы.ПС, "");
	адаптер_НастройкиОбмена.ОставитьРеквизиты(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ИменаРеквизитов);
	
КонецПроцедуры
