#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура бг_ЗаполнитьСертификатНоменклатурыПоУмолчанию(Товары) Экспорт
	
	СертификатыНоменклатуры = бг_СертификатыНоменклатурыКЗаполнениюПоУмолчанию(Товары);
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		Отбор = Новый Структура("Номенклатура", СтрокаТоваров.Номенклатура); 
		НайденныеСертификаты = СертификатыНоменклатуры.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(НайденныеСертификаты) Тогда
			СтрокаТоваров.бг_Сертификат = НайденныеСертификаты[0].СертификатНоменклатуры;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область СлужебныеПроцедурыИФункции

Функция бг_СертификатыНоменклатурыКЗаполнениюПоУмолчанию(Товары)
		
	НоменклатурыБезСертификатаТаблица = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
		Товары,
		Новый Структура("бг_Сертификат", Справочники.СертификатыНоменклатуры.ПустаяСсылка()),
		"Номенклатура");
	НоменклатурыБезСертификата = НоменклатурыБезСертификатаТаблица.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбластиДействияСертификатовНоменклатуры.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры) КАК СертификатНоменклатуры,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры) КАК КоличествоСертификатов
		|ИЗ
		|	РегистрСведений.ОбластиДействияСертификатовНоменклатуры КАК ОбластиДействияСертификатовНоменклатуры
		|ГДЕ
		|	ОбластиДействияСертификатовНоменклатуры.Номенклатура В(&НоменклатурыБезСертификата)
		|	И (ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Бессрочный
		|			ИЛИ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ДатаОкончанияСрокаДействия > &ТребуемаяДатаАктуальностиСертификата)
		|	И ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСертификатовНоменклатуры.Действующий)
		|	И НЕ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбластиДействияСертификатовНоменклатуры.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры) = 1";	
	Запрос.УстановитьПараметр("НоменклатурыБезСертификата", НоменклатурыБезСертификата);
	Запрос.УстановитьПараметр("ТребуемаяДатаАктуальностиСертификата", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти