#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обработать(Команда)
	
	ОбработатьВыделенныеСтрокиНаСервере(Элементы.Список.ВыделенныеСтроки);
	Элементы.Список.Обновить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВыделенныеСтрокиНаСервере(Знач ВыделенныеСтроки)
	
	Для каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		ОбработатьЗаявкуКлиентаНаСервере(ТекущаяСтрока.ЗаявкаКлиента);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьЗаявкуКлиентаНаСервере(ЗаявкаКлиента)
	
	РегистрыСведений.бг_ОчередьЗаявокКлиентовКОтправкеOrderSP.ОбработатьЗаявкуКлиента(ЗаявкаКлиента);

КонецПроцедуры

#КонецОбласти
