#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СогласованиеФК = Истина;
	СогласованиеКК = Истина;
	СогласованиеСБ = Истина;

	Если Параметры.РезультатСогласования <> Перечисления.бг_РезультатыСогласования.НеСогласовано Тогда
		Если Параметры.РезультатСогласования <> Перечисления.бг_РезультатыСогласования.СогласованоПринудительно Тогда
			Элементы.Комментарий.Видимость = Ложь;
		Иначе
			СогласованиеФК = Ложь;
			СогласованиеСБ = Ложь;
		КонецЕсли;
		Элементы.СогласованиеФК.Видимость = Ложь;
		Элементы.СогласованиеКК.Видимость = Ложь;
		Элементы.СогласованиеСБ.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьСогласование(Команда)
	СтруктураПараметров = Новый Структура("ФК, КК, СБ, Комментарий", 
		СогласованиеФК, СогласованиеКК, СогласованиеСБ, Комментарий);
	Закрыть(СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяОтИзменения(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
