#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_обработчикиСобытийСтандартный;
	адаптер_обработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_обработчикиСобытийСтандартный");
	
	ДанныеОбъекта = адаптер_обработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения);
	РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];
	Если РеквизитыОбъекта.Свойство("ДокументыОснования") Тогда
		GUID_ПоступлениеТоваровНаСклад = ДокументПоступлениеТоваровНаСклад(Объект.ДокументыОснования[0].ДокументОснование);
		Если ЗначениеЗаполнено(GUID_ПоступлениеТоваровНаСклад) Тогда
			РеквизитыОбъекта.Вставить("бг_ДокументПоступленияНаСклад", GUID_ПоступлениеТоваровНаСклад);
		КонецЕсли;	
	КонецЕсли;
	Возврат ДанныеОбъекта;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументПоступлениеТоваровНаСклад(Документ)
	GUID_ПоступлениеТоваровНаСклад = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|ПриобретениеТоваровУслуг.бг_ДокументПоступленияНаСклад КАК ПоступлениеТоваровНаСклад
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Ссылка = &Ссылка
	|	И НЕ ПриобретениеТоваровУслуг.бг_ДокументПоступленияНаСклад = 
	|	ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаСклад.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Ссылка", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		GUID_ПоступлениеТоваровНаСклад = Строка(Выборка.ПоступлениеТоваровНаСклад.УникальныйИдентификатор());	
	КонецЕсли;	
	Возврат GUID_ПоступлениеТоваровНаСклад;
КонецФункции

#КонецОбласти