
#Область ПрограммныйИнтерфейс

&После("ДополнитьСведенияОЮрФизЛицеВСпискеПолей")
Процедура бг_ДополнитьСведенияОЮрФизЛицеВСпискеПолей(СписокПолей)
	СписокПолей = СписокПолей + ", КодОКВЭД2";
КонецПроцедуры

&После("ДополнитьСведенияОЮрФизЛице")
Процедура бг_ДополнитьСведенияОЮрФизЛице(Сведения, Реквизиты, ЮрФизЛицо, ДатаПериода)
	
	Если ЗначениеЗаполнено(ЮрФизЛицо)
		   И ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		   
		   Сведения.Вставить("КодОКВЭД2", Реквизиты.КодОКВЭД2);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
