#Область ПрограммныйИнтерфейс

// Действующая страховая ставка 0%
//
// Возвращаемое значение:	
//	СправочникСсылка.бг_СтавкиСтраховыхКомпаний, Неопределено - Ставка 0%, если не найдена, то Неопределено
//
Функция БезСтраховки() Экспорт
	Результат = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бг_СтавкиСтраховыхКомпаний.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бг_СтавкиСтраховыхКомпаний КАК бг_СтавкиСтраховыхКомпаний
	|ГДЕ
	|	бг_СтавкиСтраховыхКомпаний.Ставка = 0
	|	И НЕ бг_СтавкиСтраховыхКомпаний.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти