
#Область ОбработчикиСобытий

&Перед("ПередНачаломРаботыСистемы")
Процедура бг_ПередНачаломРаботыСистемы()
	
	бг_ОбщегоНазначенияСервер.ОтключитьНастройкиОбменаЕГАИСВПеремещеннойИнформационнойБазе();
	
	бг_ОбщегоНазначенияСервер.ОчиститьНастройкиЗагрузкиДанныхСПроизводственнойЛинии();
	
КонецПроцедуры

&После("ПриНачалеРаботыСистемы")
Процедура бг_ПриНачалеРаботыСистемы()
	
	бг_ОткрытьНавигационнуюСсылкуПриНачалеРаботыСистемы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ОткрытьНавигационнуюСсылкуПриНачалеРаботыСистемы()
	
	НавигационнаяСсылка = бг_КонстантыПовтИсп.ЗначениеКонстанты("НавигационнаяСсылкаОткрываемаяПриСтартеСистемы");
	Если ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		Попытка
			ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
