#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура бг_ОчиститьСоответствиеНоменклатурыЕГАИС(СооответствияНоменклатурыЕГАИС) Экспорт
	Для Каждого СтрокаСоответствие Из СооответствияНоменклатурыЕГАИС Цикл
		НаборЗаписей = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.АлкогольнаяПродукция.Установить(СтрокаСоответствие.АлкогольнаяПродукция);
		НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаСоответствие.Номенклатура);
		НаборЗаписей.Отбор.Характеристика.Установить(СтрокаСоответствие.Характеристика);
		НаборЗаписей.Отбор.Серия.Установить(СтрокаСоответствие.Серия);
		НаборЗаписей.Отбор.Справка2.Установить(СтрокаСоответствие.Справка2);
		
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
