
#Область ОбработчикиСобытий

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьКомандуЗапроситьССПНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ЗапроситьССП(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция",     ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.бг_ЗапросССП"));
	ПараметрыФормы.Вставить("ИмяПараметра", "КОД");
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормированиеИсходящегоЗапросаЕГАИС",
		ПараметрыФормы,
		ЭтотОбъект,
		ЭтотОбъект,
		,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьКомандуЗапроситьССПНаСервере()
	
	Перем бг_МодификацияИнтерфейсовОбщегоНазначенияСервер;
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер = ОбщегоНазначения.ОбщийМодуль("бг_МодификацияИнтерфейсовОбщегоНазначенияСервер");
		
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьКнопкуНаФорму(
		ЭтотОбъект, "ЗапроситьССП",	Элементы.ПодменюЗапроситьАлкогольнуюПродукцию, 
		"запросить ССП по коду", "ЗапроситьССП", "Подключаемый_ЗапроситьССП");

КонецПроцедуры

#КонецОбласти
