#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьНоменклатуру(Код) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", Код);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыНоменклатурыСПУМ.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.бг_КодыНоменклатурыСПУМ КАК КодыНоменклатурыСПУМ
	|ГДЕ
	|	КодыНоменклатурыСПУМ.Код = &Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Код = &Код";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Номенклатура = Выборка.Номенклатура;
	Иначе
		Номенклатура = Неопределено;
	КонецЕсли;
	
	Возврат Номенклатура;
	
КонецФункции

#КонецОбласти

#КонецЕсли
