
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ОписаниеДокументов = ОписаниеВидовСопроводительныхДокументов();
	
	Для Каждого ОписаниеДокумента Из ОписаниеДокументов Цикл
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Справочник.бг_СопроводительныеДокументы";
		КомандаПечати.Идентификатор  = ОписаниеДокумента.Идентификатор;
		КомандаПечати.Представление  = СтрШаблон(НСтр("ru = '%1 с группировкой'"), ОписаниеДокумента.Наименование);
		КомандаПечати.Порядок 		 = 40;
		КомандаПечати.РазборПоКопиямЗапрещен = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("Группировать", Истина);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Справочник.бг_СопроводительныеДокументы";
		КомандаПечати.Идентификатор  = ОписаниеДокумента.Идентификатор;
		КомандаПечати.Представление  = СтрШаблон(НСтр("ru = '%1 без группировки'"), ОписаниеДокумента.Наименование);
		КомандаПечати.Порядок 		 = 40;
		КомандаПечати.РазборПоКопиямЗапрещен = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("Группировать", Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеВидовСопроводительныхДокументов() Экспорт

	Виды = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Наименование
	|ИЗ
	|	Справочник.бг_ВидыСопроводительныхДокументов КАК Т";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Виды.Добавить(Новый Структура("Идентификатор, Вид, Наименование",
			XMLСтрока(Выборка.Ссылка), Выборка.Ссылка, Выборка.Наименование));
	КонецЦикла;
	
	Возврат Виды;
	
КонецФункции

#КонецОбласти

#КонецЕсли