
#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("СтруктураИзменения")
Функция бг_СтруктураИзменения() Экспорт

	СтруктураИзменения = Новый Структура;
	СтруктураИзменения.Вставить("ОрганизацияЕГАИС");
	СтруктураИзменения.Вставить("Операция");
	СтруктураИзменения.Вставить("ФорматОбмена");

	СтруктураИзменения.Вставить("ТекстОшибки",           "");
	СтруктураИзменения.Вставить("ПодготовленоКПередаче", Ложь);
	СтруктураИзменения.Вставить("ПереданоВУТМ",          Ложь);
	СтруктураИзменения.Вставить("Принято",               Ложь);

	СтруктураИзменения.Вставить("ИсходящееСообщение");
#Вставка
	СтруктураИзменения.Вставить("ИсходящееСообщениеВерсияДанных", "");
#КонецВставки
	СтруктураИзменения.Вставить("ВходящееСообщение");

	СтруктураИзменения.Вставить("Объект");
	СтруктураИзменения.Вставить("ДокументОснование");
	СтруктураИзменения.Вставить("НовыйСтатус");
	СтруктураИзменения.Вставить("ОбъектИзменен", Ложь);

	// Результат чека ЕГАИС
	СтруктураИзменения.Вставить("ИдентификаторЗапроса");
	СтруктураИзменения.Вставить("Подпись");

	Возврат СтруктураИзменения;

КонецФункции

&Вместо("СтруктураДанныхСправки2")
Функция бг_СтруктураДанныхСправки2()
	Результат = ПродолжитьВызов();
	Результат.Вставить("бг_ДокументОснование", Неопределено);

	Возврат Результат;
КонецФункции

#КонецОбласти
