
#Область ПрограммныйИнтерфейс

// Возвращает параметры ожидания для длительной операции актуализации обеспечения заказов клиентов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, из которой запускается длительная операция 
//
// Возвращаемое значение:
//  Структура - см. ДлительныеОперацииКлиент.ПараметрыОжидания
//
Функция ПараметрыОжиданияАктуализацииОбеспечения(Форма) Экспорт
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Актуализация обеспечения';
										|en = 'Актуализация обеспечения'");
	
	Возврат ПараметрыОжидания;
	
КонецФункции

#КонецОбласти


