#Область ПрограммныйИнтерфейс 
 
Функция НайтиСсылкуПоЗагружаемымДанным(СтруктураОбъекта) Экспорт
	
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	Если СтруктураОбъекта = Неопределено Тогда
		Возврат Справочники.Валюты.ПустаяСсылка();
	КонецЕсли; 
	
	Валюта = адаптер_РаботаСДаннымиИБ.НайтиСсылкуПоЗагружаемымДанным(СтруктураОбъекта);
	
	Если ОбщегоНазначения.СсылкаСуществует(Валюта) Тогда
		Возврат Валюта;
	Иначе
		Возврат Справочники.Валюты.НайтиПоКоду(СтруктураОбъекта.Код); 
	КонецЕсли;
		
КонецФункции

#КонецОбласти