
#Область ПрограммныйИнтерфейс

Функция ОтменитьСогласование(ДокументЗаказ, Дата) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЗаказ, "Дата, Организация, бг_ПунктНазначения.КаналПродаж");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента"	, НачалоДня(Дата));
	Запрос.УстановитьПараметр("КаналПродаж"		, РеквизитыДокумента.бг_ПунктНазначенияКаналПродаж);
	Запрос.УстановитьПараметр("Организация"		, РеквизитыДокумента.Организация);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистра.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.бг_НастройкиКорректировкиЗаказовБезСнятияСогласования.СрезПоследних(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И КаналПродаж = &КаналПродаж
		|				И &ДатаДокумента <= КонецПериода) КАК ДанныеРегистра";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
		
КонецФункции

#КонецОбласти 

