#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНастройкиСозданияЗаказа(ДокументЗаказ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бг_НастройкаСозданияЗаказов.Инициатор КАК Инициатор,
	|	бг_НастройкаСозданияЗаказов.Получатель КАК Получатель,
	|	бг_НастройкаСозданияЗаказов.ПартнерИнициатор КАК ПартнерИнициатор,
	|	бг_НастройкаСозданияЗаказов.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	|	бг_НастройкаСозданияЗаказов.СоглашениеСИнициатором КАК СоглашениеСИнициатором
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_НастройкаСозданияЗаказов КАК бг_НастройкаСозданияЗаказов
	|		ПО ЗаказКлиента.Организация = бг_НастройкаСозданияЗаказов.Инициатор
	|			И ЗаказКлиента.Контрагент = бг_НастройкаСозданияЗаказов.Получатель
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ДокументЗаказ";
	Запрос.УстановитьПараметр("ДокументЗаказ", ДокументЗаказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("Партнер", Выборка.ПартнерИнициатор);
		СтруктураНастройки.Вставить("Организация", Выборка.ОрганизацияПолучатель);
		СтруктураНастройки.Вставить("Соглашение", Выборка.СоглашениеСИнициатором);
		
		Возврат СтруктураНастройки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли