#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("НеОпределятьКоординаты") И Долгота = 0 И Широта = 0 Тогда
		Попытка
			Если АдресГеокодирования = "" Тогда
				АдресГеокодирования = Адрес;
			КонецЕсли;
			Справочники.битПунктыНазначения.ГеокодироватьАдрес(АдресГеокодирования, Широта, Долгота);		
		Исключение                                                                                                      
			ЗаписьЖурналаРегистрации("ГеокодированиеАдреса", 
				УровеньЖурналаРегистрации.Ошибка,, 
				Ссылка, 
				ОписаниеОшибки(), 
				РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&После("ПриКопировании")
Процедура бг_ПриКопировании(ОбъектКопирования)
	
	КаналПродаж = Неопределено;
	КодТТSY 	= "";
	Территория 	= Неопределено;
	
КонецПроцедуры

#КонецОбласти
