#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект);
	
	Если Параметры.Свойство("СтруктураБыстрогоОтбора") Тогда
		УстановитьБыстрыеОтборы(Параметры.СтруктураБыстрогоОтбора);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура УстановитьБыстрыеОтборы(СтруктураБыстрогоОтбора)
	Если СтруктураБыстрогоОтбора.Свойство("Номенклатура")
		И ЗначениеЗаполнено(СтруктураБыстрогоОтбора.Номенклатура) Тогда
		НоменклатураОтбор = СтруктураБыстрогоОтбора.Номенклатура;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура", НоменклатураОтбор, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если СтруктураБыстрогоОтбора.Свойство("Организация")
		И ЗначениеЗаполнено(СтруктураБыстрогоОтбора.Организация) Тогда
		ОрганизацияОтбор = СтруктураБыстрогоОтбора.Организация;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОрганизацияОтбор, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура", НоменклатураОтбор,
											ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(НоменклатураОтбор));
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОрганизацияОтбор,
											ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОрганизацияОтбор));
КонецПроцедуры

#КонецОбласти
