#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция бг_ДопустимаяДлинаНаименования() Экспорт
	ПространствоИмен = "http://fsrar.ru/WEGAIS/ProductRef_v2";
	ТипОписаниеПродукции = ФабрикаXDTO.Тип(ПространствоИмен, "ProductInfo_v2");
	
	Фасеты = ТипОписаниеПродукции.Свойства.Получить("ShortName").Тип.Фасеты;
	ФасетМаксДлина = Фасеты.Получить(ВидФасетаXDTO.МаксДлина);
	
	Если ФасетМаксДлина = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	Возврат ОписаниеТипаЧисло.ПривестиЗначение(ФасетМаксДлина.Значение);
КонецФункции

#КонецОбласти

#КонецЕсли
