
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("бг_РежимВыбора") Тогда
		Элементы.СертификатыНоменклатуры.РежимВыбора = Параметры.бг_РежимВыбора;
		СертификатыНоменклатуры.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("бг_ТолькоДействующиеНаДату") И Параметры.бг_ТолькоДействующиеНаДату Тогда
		ТолькоДействующиеНаДату = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("бг_Номенклатура") Тогда
		Параметры.Свойство("бг_Номенклатура", НоменклатураОтбор);
		ВидНоменклатурыОтбор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураОтбор, "ВидНоменклатуры");
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура бг_ПриОткрытииПосле(Отказ)
	
	Если ТолькоДействующиеНаДату Тогда
		УстановитьОтборПоТолькоДействующимНаДату();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСертификатыНоменклатуры

&НаКлиенте
Процедура бг_СертификатыНоменклатурыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.СертификатыНоменклатуры.РежимВыбора Тогда	
		Закрыть(ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бг_СертификатыНоменклатурыВыборЗначенияПосле(Элемент, Значение, СтандартнаяОбработка)	
	
	Если Элементы.СертификатыНоменклатуры.РежимВыбора Тогда	
		Закрыть(Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

