
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ДобавитьЭлементыФормы()
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"бг_Комментарий",
		ЭтаФорма,
		"Объект.бг_Комментарий"
	);
	Элемент.Ширина = 50;
	Элемент.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры

#КонецОбласти