#Область ПрограммныИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
		
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	
КонецПроцедуры

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт
	ТекстЗапросаЗаменить = "NULL КАК ЗначениеПоказателяНаименование";
	ТекстЗапросаЗамена   = "ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ВыгружаемыйОбъект.Анализы.Значение) = ТИП(Справочник.бг_ЗначенияПоказателейАнализовНоменклатуры)
	|				ТОГДА ВыгружаемыйОбъект.Анализы.Значение.Наименование
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК ЗначениеПоказателяНаименование";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗапросаЗаменить, ТекстЗапросаЗамена);
	
	ТекстЗапросаЗаменить = "NULL КАК ЗначениеПоказателяЗначение";
	ТекстЗапросаЗамена   = "ВЫБОР
	|			КОГДА Не ТИПЗНАЧЕНИЯ(ВыгружаемыйОбъект.Анализы.Значение) = ТИП(Справочник.бг_ЗначенияПоказателейАнализовНоменклатуры)
	|				ТОГДА ВыгружаемыйОбъект.Анализы.Значение
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЗначениеПоказателяЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗапросаЗаменить, ТекстЗапросаЗамена);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Реквизиты шапки
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("Проведен");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("Номенклатура");
	ВыгружаемыеРеквизиты.Добавить("ТиповойАнализ");
	ВыгружаемыеРеквизиты.Добавить("Серия");
	ВыгружаемыеРеквизиты.Добавить("РезультатСертификации");
	ВыгружаемыеРеквизиты.Добавить("НормативныйДокумент");
	ВыгружаемыеРеквизиты.Добавить("ДатаСертификата");
	ВыгружаемыеРеквизиты.Добавить("СрокОкончанияДействияСертификата");
	ВыгружаемыеРеквизиты.Добавить("Ответственный");
	ВыгружаемыеРеквизиты.Добавить("НомерПартии");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	
	// Реквизиты ТЧ "Анализы"
	ВыгружаемыеРеквизиты.Добавить("Анализы.Показатель");
	ВыгружаемыеРеквизиты.Добавить("Анализы.СоответствуетНормативу");
	ВыгружаемыеРеквизиты.Добавить("Анализы.МинимальноеНормативноеЗначение");
	ВыгружаемыеРеквизиты.Добавить("Анализы.МаксимальноеНормативноеЗначение");
	
	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;

КонецФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		,
		"Анализы.ЗначениеПоказателяНаименование",
		Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150)));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		,
		"Анализы.ЗначениеПоказателяЗначение",
		Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 5)));

КонецПроцедуры

#КонецОбласти
