
#Область СлужебныеПроцедурыИФункции

// Возвращает информацияю о том, применяется ли на складе Тип политики указания серий = Управление остатками серий
//
// Параметры:
//	ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры
//	Склад			 - СправочникСсылка.Склады
// 
// Тип возвращаемого значения
//	Булево
//
&НаСервере
Функция бг_НаСкладеИспользуетсяПолитикаУправлениеОстаткамиСерий(ВидНоменклатуры, Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПолитикиУчетаСерий.ПолитикаУчетаСерий.ТипПолитики,
	|			ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУправлениеОстаткамиСерий
	|ИЗ
	|	Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|ГДЕ
	|	ПолитикиУчетаСерий.Склад = &Склад
	|	И ПолитикиУчетаСерий.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", ВидНоменклатуры);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].ЭтоУправлениеОстаткамиСерий;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

// Функция - Возвращает организацию ЕГАИС склада
//
// Параметры:
//  Склад	 - СправочникСсылка.Склады - склад, для которого требуется найти организацию ЕГАИС
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторОрганизацийЕГАИС - Организация ЕГАИС склада
//
Функция бг_ОрганизацияЕГАИС(Склад) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "бг_ПунктНазначения.ОрганизацияЕГАИС");
	
КонецФункции

#КонецОбласти
