#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеОбработкиЗагрузки", ЭтаФорма);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Источник", ИмяФормы);	
	
	ОткрытьФорму("Обработка.бг_ЗагрузкаЛимитовИОтсрочекПокупателям.Форма.Форма", 
					ПараметрыОткрытияФормы, 
					ЭтаФорма,,,,, 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ПослеОбработкиЗагрузки(Результата, ДопПараметры) Экспорт
	ОбновитьОтображениеДанных();	
КонецПроцедуры

#КонецОбласти
