
&ИзменениеИКонтроль("УстановитьАвтораОбъектаПередЗаписью")
Процедура бг_УстановитьАвтораОбъектаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
#Вставка
    	Если Источник.ДополнительныеСвойства.Свойство("бг_НеЗаполнятьАвтораПоСтатистике") Тогда
		Возврат;
	КонецЕсли;
#КонецВставки
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Источник.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

КонецПроцедуры
