
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьВыделенные(Команда)
	ОбработатьВыделенныеНаСервере(Элементы.Список.ВыделенныеСтроки);
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бг_ВходящиеДокументыУТМ"));
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНовые(Команда)
	ОбработатьНовыеНаСервере();
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бг_ВходящиеДокументыУТМ"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбработатьВыделенныеНаСервере(Знач ВыделенныеСтроки)
	бг_ИнтеграцияЕГАИС.ОбработатьУказанныеВходящиеДокументыУТМ(ВыделенныеСтроки);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьНовыеНаСервере()
	бг_ОбменСЕГАИС.ЗагрузитьДокументы();
КонецПроцедуры

#КонецОбласти
