
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура бг_ДобавитьЭлементыФормы()
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КодНоменклатурыКонтрагента",
		Элементы.ГруппаДанныеКонтрагента,
		"Объект.бг_КодНоменклатурыКонтрагента",
		,
		Элементы.Артикул);
	
КонецПроцедуры

#КонецОбласти
