#Область ОбработчикиКомандФормы
	
&НаСервере
Процедура СформироватьНаСервере()
	ТаблицаРезультат.Очистить();  
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыБордеро = ПараметрыФормированияОтчета();
	ТаблицаРезультат = ОбработкаОбъект.СчетБордеро(ПараметрыБордеро);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыФормированияОтчета()
	Результат = Новый Структура;
	Результат.Вставить("ДатаНачала", ПериодБордеро.ДатаНачала);
	Результат.Вставить("ДатаОкончания", ПериодБордеро.ДатаОкончания);
	Результат.Вставить("Контрагент", Контрагент);
	Результат.Вставить("Договор", Договор);
	Результат.Вставить("Организация", Организация);
	Результат.Вставить("ПодписьСтраховательДолжность", ПодписьСтраховательДолжность);
	Результат.Вставить("ПодписьСтраховательФИО", ПодписьСтраховательФИО);
	Результат.Вставить("ПодписьСтраховщикДолжность", ПодписьСтраховщикДолжность);
	Результат.Вставить("ПодписьСтраховщикФИО", ПодписьСтраховщикФИО);
	Возврат Результат;
КонецФункции

#КонецОбласти