#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВидДоставкиОтПоставщика(Поставщик, Склад, ДлительностьДоставки) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыДоставкиОтПоставщиков.ВидПеревозки КАК ВидПеревозки
	|ИЗ
	|	РегистрСведений.бг_СоответствиеВидовДоставкиОтПоставщиков КАК ВидыДоставкиОтПоставщиков
	|ГДЕ
	|	ВидыДоставкиОтПоставщиков.Поставщик = &Поставщик
	|	И ВидыДоставкиОтПоставщиков.Склад = &Склад
	|	И ВидыДоставкиОтПоставщиков.ДлительностьДоставки = &ДлительностьДоставки";
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ДлительностьДоставки", ДлительностьДоставки);
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидПеревозки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли

