#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура бг_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОрганизацииЕГАИС.Ссылка
	|ИЗ
	|	Справочник.КлассификаторОрганизацийЕГАИС КАК ОрганизацииЕГАИС
	|ГДЕ
	|	ОрганизацииЕГАИС.СоответствуетОрганизации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОрганизацииЕГАИС.Наименование");
	
#Вставка
	// Если у пользователя установлены ограничения доступа, то при открытии формы
	// без слова РАЗРЕШЕННЫЕ вызывается ошибка нарушения прав доступа.
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
#КонецВставки
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаОрганизацииЕГАИС.Добавить();
		НоваяСтрока.ОрганизацияЕГАИС = Выборка.Ссылка;
		НоваяСтрока.Выбрана = Параметры.ОрганизацииЕГАИС.Найти(Выборка.Ссылка) <> Неопределено;
		
	КонецЦикла;
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
