#Область ПрограммныйИнтерфейс

Функция ВыполненыУсловияВыгрузкиОбъекта(ДанныеСообщения) Экспорт
	
	Результат = Истина;
	
	Операция = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСообщения.Объект, "Операция");
	Если Операция = Перечисления.бг_ОперацииРегистрацииБанковскихГарантий.ЗакрытиеБанковскихГарантий Тогда
		ТекстОшибки = НСтр("ru = 'Операции ""Закрытие банковских гарантий"" не выгружаются'");
		ДанныеСообщения.ТекстОшибки = ТекстОшибки;
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
