Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	ИменаРеквизитов = "бг_Организация,Наименование,Код,ПометкаУдаления,Статус,НачалоДействия,Ответственный,Описание,
				|МинимальнаяПартияВыпуска,ВыпускПроизвольнымиПорциями,бг_ОсновноеИзделиеУпаковкаПаллета,
				|ВыходныеИзделия.Номенклатура,ВыходныеИзделия.Упаковка,ВыходныеИзделия.КоличествоУпаковок,ВыходныеИзделия.ДоляСтоимости,
				|МатериалыИУслуги.Номенклатура,МатериалыИУслуги.Упаковка,МатериалыИУслуги.КоличествоУпаковок,
				|МатериалыИУслуги.СтатьяКалькуляции,МатериалыИУслуги.Альтернативный";
	ИменаРеквизитов = СтрЗаменить(ИменаРеквизитов, Символы.ПС, "");
	адаптер_НастройкиОбмена.ОставитьРеквизиты(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ИменаРеквизитов);
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, Метаданные.Справочники.СтатьиКалькуляции, "Наименование");
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, Метаданные.Справочники.Номенклатура, "Код");
	
КонецПроцедуры

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт

	ТекстПоиска =
	"ВыгружаемыйОбъект.ВыходныеИзделия.Номенклатура.Код КАК Номенклатура_ЗначениеРеквизитаКод";
	
	ТекстЗамены = "ВЫБОР
			|			КОГДА ВыгружаемыйОбъект.ВыходныеИзделия.Номенклатура = ВыгружаемыйОбъект.ОсновноеИзделиеНоменклатура
			|					И ВыгружаемыйОбъект.бг_ОсновноеИзделиеУпаковкаПаллета <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			|					И ВыгружаемыйОбъект.бг_ОсновноеИзделиеУпаковкаПаллета.бг_КодЕК_Номенклатуры <> """"
			|				ТОГДА ВыгружаемыйОбъект.бг_ОсновноеИзделиеУпаковкаПаллета.бг_КодЕК_Номенклатуры
			|			ИНАЧЕ ВыгружаемыйОбъект.ВыходныеИзделия.Номенклатура.Код
			|		КОНЕЦ КАК Номенклатура_ЗначениеРеквизитаКод";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
КонецПроцедуры
