
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
		
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства);
	
КонецПроцедуры

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_обработчикиСобытийСтандартный;
	адаптер_обработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_обработчикиСобытийСтандартный");
	
	ДанныеОбъекта = адаптер_обработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения);
	
	РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];
	ДанныеУчетаОС = РегистрыСведений.ПорядокУчетаОСБУ.ПолучитьПоследнее(
		ТекущаяДата(), 
		Новый Структура("ОсновноеСредство, Организация", Объект.Ссылка, Объект.бг_Организация)); 
	РеквизитыОбъекта.Вставить("бг_АмортизационнаяГруппа", 
		бг_ОбщегоНазначенияСервер.ЗначениеПеречислениеВСтруктуру(ДанныеУчетаОС.АмортизационнаяГруппа));
	
	Возврат ДанныеОбъекта;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	//Шапка документа
	ВыгружаемыеРеквизиты.Добавить("Код");
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Родитель");
	ВыгружаемыеРеквизиты.Добавить("ЭтоГруппа");
	ВыгружаемыеРеквизиты.Добавить("НаименованиеПолное");
	ВыгружаемыеРеквизиты.Добавить("ИнвентарныйНомер");
	ВыгружаемыеРеквизиты.Добавить("ГруппаОС");
	ВыгружаемыеРеквизиты.Добавить("ГруппаОСМеждународныйУчет");
	ВыгружаемыеРеквизиты.Добавить("ДатаВыпуска");
	ВыгружаемыеРеквизиты.Добавить("КодПоОКОФ");
	ВыгружаемыеРеквизиты.Добавить("ШифрПоЕНАОФ");
	ВыгружаемыеРеквизиты.Добавить("ДатаСведений");
	ВыгружаемыеРеквизиты.Добавить("ЗаводскойНомер");
	ВыгружаемыеРеквизиты.Добавить("Изготовитель");
	ВыгружаемыеРеквизиты.Добавить("Класс");
	ВыгружаемыеРеквизиты.Добавить("Модель");
	ВыгружаемыеРеквизиты.Добавить("НомерПаспорта");
	ВыгружаемыеРеквизиты.Добавить("ОбъектБытовогоНазначения");
	ВыгружаемыеРеквизиты.Добавить("Подкласс");
	ВыгружаемыеРеквизиты.Добавить("Расположение");
	ВыгружаемыеРеквизиты.Добавить("РемонтирующееПодразделение");
	ВыгружаемыеРеквизиты.Добавить("СерийныйНомер");
	ВыгружаемыеРеквизиты.Добавить("Статус");
	ВыгружаемыеРеквизиты.Добавить("СтатьяРасходов");
	ВыгружаемыеРеквизиты.Добавить("ЭксплуатирующееПодразделение");
	ВыгружаемыеРеквизиты.Добавить("СпособОтраженияЗарплаты");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	ВыгружаемыеРеквизиты.Добавить("ЗарегистрированоВРеестреСистемыПлатон");
	ВыгружаемыеРеквизиты.Добавить("бг_Организация");
	
	//Табличная часть "ПараметрыУчетаНаработок"
	ВыгружаемыеРеквизиты.Добавить("ПараметрыУчетаНаработок.ПоказательНаработки");
	ВыгружаемыеРеквизиты.Добавить("ПараметрыУчетаНаработок.НазначенныйРесурс");
	ВыгружаемыеРеквизиты.Добавить("ПараметрыУчетаНаработок.ИсточникПараметра");
	ВыгружаемыеРеквизиты.Добавить("ПараметрыУчетаНаработок.СмещениеЗначения");
	
	//Табличная часть "РабочиеЦентры"
	ВыгружаемыеРеквизиты.Добавить("РабочиеЦентры.РабочийЦентр");
	
	//Табличная часть "ДрагоценныеМатериалы"
	ВыгружаемыеРеквизиты.Добавить("ДрагоценныеМатериалы.ДрагоценныйМатериал");
	ВыгружаемыеРеквизиты.Добавить("ДрагоценныеМатериалы.Количество");
	ВыгружаемыеРеквизиты.Добавить("ДрагоценныеМатериалы.ЕдиницаИзмерения");
	ВыгружаемыеРеквизиты.Добавить("ДрагоценныеМатериалы.Комментарий");
	ВыгружаемыеРеквизиты.Добавить("ДрагоценныеМатериалы.Расположение");

	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)

	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	// Реквизиты шапки
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		,
		"бг_АмортизационнаяГруппа",
		Новый ОписаниеТипов("ПеречислениеСсылка.АмортизационныеГруппы"));

КонецПроцедуры
	
Процедура ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства)
	                             
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.ОбщероссийскийКлассификаторОсновныхФондов,
		"Код");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.Организации,
		"Префикс");
	
КонецПроцедуры
	
#КонецОбласти