
&НаКлиенте
&Вместо("ОстаткиПоДаннымЕГАИСВыбор")
Процедура бг_ОстаткиПоДаннымЕГАИСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОстаткиПоДаннымЕГАИС.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли Поле = Элементы.ОстаткиПоДаннымЕГАИСКоличествоАкцизныхМарок
		И ЗначениеЗаполнено(ТекущиеДанные.ОтчетЕГАИС) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.ОстаткиПоДаннымЕГАИС.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ОтчетЕГАИС", ТекущиеДанные.ОтчетЕГАИС);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		ОткрытьФорму(
			"Отчет.бг_ОстаткиАкцизныхМарокЕГАИС.Форма",
			ПараметрыФормы,,
			ТекущиеДанные.ОтчетЕГАИС);
	Иначе
		СобытияФормЕГАИСКлиент.ВыборЭлементаТабличнойЧастиОткрытьФормуЭлемента(ЭтотОбъект, Элемент, Поле);
	КонецЕсли;
	
КонецПроцедуры
