#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("СуммаДокумента")
Функция бг_СуммаДокумента(Объект)
#Вставка
	Возврат Объект.ТаможенныйСбор + Объект.ТаможенныйШтраф + Объект.Товары.Итог("СуммаПошлины") + Объект.Товары.Итог("СуммаНДС") + Объект.Товары.Итог("бг_СуммаАкциза");
#КонецВставки	
	Возврат Объект.ТаможенныйСбор + Объект.ТаможенныйШтраф + Объект.Товары.Итог("СуммаПошлины") + Объект.Товары.Итог("СуммаНДС");
КонецФункции

#Область ИнициализацияИЗаполнение

&После("ЗаполнитьПоДанным")
Процедура бг_ЗаполнитьПоДанным(Объект, Данные)
	
	Если Не ЗначениеЗаполнено(Данные.Товары) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРазделыТаможеннойДекларацииИмпорт") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект.Товары[0], "бг_СуммаАкциза") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из Объект.Товары Цикл
		Строка.СуммаНДС =
			ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(
				Строка.ТаможеннаяСтоимость + Строка.СуммаПошлины + Строка.бг_СуммаАкциза,
				Строка.СтавкаНДС,
				Ложь);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
