#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Список.ПроизвольныйЗапрос = Истина;
	Список.ОсновнаяТаблица = "Справочник.ЕГАИСПрисоединенныеФайлы";
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕГАИСПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	ЕГАИСПрисоединенныеФайлы.ВерсияДанных КАК ВерсияДанных,
	|	ЕГАИСПрисоединенныеФайлы.ПометкаУдаления КАК ПометкаУдаления,
	|	ЕГАИСПрисоединенныеФайлы.Наименование КАК Наименование,
	|	ЕГАИСПрисоединенныеФайлы.Операция КАК Операция,
	|	ВЫБОР
	|		КОГДА ЕГАИСПрисоединенныеФайлы.Документ = НЕОПРЕДЕЛЕНО
	|				И НЕ ЕГАИСПрисоединенныеФайлы.бг_СправкаЕГАИС = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЕГАИСПрисоединенныеФайлы.бг_СправкаЕГАИС
	|		ИНАЧЕ ЕГАИСПрисоединенныеФайлы.Документ
	|	КОНЕЦ КАК Документ,
	|	ЕГАИСПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	ЕГАИСПрисоединенныеФайлы.ТипСообщения КАК ТипСообщения,
	|	ЕГАИСПрисоединенныеФайлы.ФорматОбмена КАК ФорматОбмена,
	|	ЕГАИСПрисоединенныеФайлы.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	|	ЕГАИСПрисоединенныеФайлы.бг_СправкаЕГАИС КАК бг_СправкаЕГАИС,
	|	ЕГАИСПрисоединенныеФайлы.Предопределенный КАК Предопределенный,
	|	ЕГАИСПрисоединенныеФайлы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ЕГАИСПрисоединенныеФайлы.Представление КАК Представление
	|ИЗ
	|	Справочник.ЕГАИСПрисоединенныеФайлы КАК ЕГАИСПрисоединенныеФайлы";
КонецПроцедуры

#КонецОбласти
