#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_СоздатьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_СоздатьЭлементыФормы()
		
	бг_ДобавитьПоляОборудованиеИСклад();
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПоляОборудованиеИСклад()
	
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма, 
		"бг_Номенклатура", 
		Элементы.ГруппаПостоянныеСведения, 
		"Объект.бг_Номенклатура");
		
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма, 
		"бг_Склад", 
		Элементы.ГруппаПостоянныеСведения, 
		"Объект.бг_Склад");
	
КонецПроцедуры

#КонецОбласти
