#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	бг_ПродукцияУпаковкаПаллета = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(ЭтотОбъект,
									"бг_ПродукцияУпаковкаПаллета", Элементы.Продукция,
									"Объект.Продукция.бг_УпаковкаПаллета", , Элементы.ПродукцияХарактеристика);
	бг_ПродукцияУпаковкаПаллета.Ширина = 15;
	бг_ПродукцияУпаковкаПаллета.УстановитьДействие("ПриИзменении", "бг_ПродукцияПаллетаПриИзменении");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура бг_ПродукцияПаллетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураЗаполненияСпецификации = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыДействияПроверитьЗаполнитьСпецификацию(
		Объект,
		ТекущаяСтрока,
		ЭтотОбъект.ПараметрыВыбораСпецификаций);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСпецификацию", СтруктураЗаполненияСпецификации);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ПродукцияНоменклатураПриИзмененииПосле(Элемент)
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.Спецификация) Тогда
		ТекущиеДанные.Склад = бг_СкладПолучатель(ТекущиеДанные.Спецификация);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура бг_ПродукцияСпецификацияПриИзмененииПосле(Элемент)
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.Спецификация) Тогда
		ТекущиеДанные.Склад = бг_СкладПолучатель(ТекущиеДанные.Спецификация);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция бг_СкладПолучатель(Спецификация)
	ЭтоЭкспорт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "бг_Экспорт");
	
	Если ЭтоЭкспорт Тогда
		Возврат бг_КонстантыПовтИсп.ЗначениеКонстанты("СкладГотовойПродукцииЭкспорт");
	Иначе
		Возврат бг_КонстантыПовтИсп.ЗначениеКонстанты("СкладГотовойПродукции");
	КонецЕсли;
КонецФункции

#КонецОбласти
