#Область ПрограммныйИнтерфейс

// Функция - Возвращает паллетизацию номенклатуры, если она может быть однозначно определена
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура, для которой требуется получить паллетизацию 
// 
// Возвращаемое значение:
//  СправочникСсылка.УпаковкиЕдиницыИзмерения - паллетизация по умолчанию
//
Функция ПаллетизацияНоменклатурыПоУмолчанию(Номенклатура) Экспорт

	Возврат бг_Номенклатура.ПаллетизацияНоменклатурыПоУмолчанию(Номенклатура);

КонецФункции

#КонецОбласти // Конец ПрограммныйИнтерфейс
