#Область ПрограммныйИнтерфейс

Процедура ФормированиеПроводокПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИмяДокумента = Источник.Метаданные().Имя;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_МоментальноеФормированиеПроводок.ФормироватьПроводкиСразу КАК ФормироватьПроводкиСразу
	|ИЗ
	|	РегистрСведений.бг_МоментальноеФормированиеПроводок КАК бг_МоментальноеФормированиеПроводок
	|ГДЕ
	|	бг_МоментальноеФормированиеПроводок.ИмяДокумента = &ИмяДокумента
	|	И бг_МоментальноеФормированиеПроводок.ФормироватьПроводкиСразу";
	
	Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	РеглУчетПроведениеСервер.ОтразитьДокумент(Источник);
	
КонецПроцедуры

#КонецОбласти