#Область ПрограммныйИнтерфейс

// Возвращает действующую лицензию на дату запроса
//
// Параметры:
//  Владелец - СправочникСсылка.Организация, СправочникСсылка.Контрагент
//  Дата - Дата, на которую проверяется наличие лицензии
//
//Возвращаемое значение:
//	ТипЛицензии - Перечисление.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции 
//
Функция бг_ТипЛицензииОрганизации(Владелец, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛицензииПоставщиковАлкогольнойПродукции.бг_ТипЛицензии КАК ТипЛицензии
	|ИЗ
	|	Справочник.ЛицензииПоставщиковАлкогольнойПродукции КАК ЛицензииПоставщиковАлкогольнойПродукции
	|ГДЕ
	|	ЛицензииПоставщиковАлкогольнойПродукции.Владелец = &Владелец
	|	И ВЫБОР
	|			КОГДА ЛицензииПоставщиковАлкогольнойПродукции.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛицензииПоставщиковАлкогольнойПродукции.ДатаНачала <= &Дата
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ЛицензииПоставщиковАлкогольнойПродукции.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛицензииПоставщиковАлкогольнойПродукции.ДатаОкончания > &Дата
	|		КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].ТипЛицензии;
	КонецЕсли;	
	
КонецФункции

&Вместо("ПолучитьБлокируемыеРеквизитыОбъекта")
Функция бг_ПолучитьБлокируемыеРеквизитыОбъекта()

	Результат = Новый Массив;
//#Вставка
	Результат.Добавить("бг_ВидыАлкогольнойПродукции");
	Результат.Добавить("бг_ВидЛицензируемойДеятельности");
	Результат.Добавить("бг_ДатаВыдачи");
	Результат.Добавить("бг_ДатаПрекращенияДействия");
	Результат.Добавить("бг_ЗаменяемаяЛицензия");
	Результат.Добавить("бг_Номер");
	Результат.Добавить("бг_НомерРАР");
	Результат.Добавить("бг_ПриостановленаСДаты");
	Результат.Добавить("бг_ПунктыНазначения");
	Результат.Добавить("бг_Регион");
	Результат.Добавить("бг_Серия");
	Результат.Добавить("бг_СлабоалкогольнаяПродукция");
	Результат.Добавить("бг_ТипЛицензии");
	Результат.Добавить("бг_Хорека");
//#КонецВставки
	Результат.Добавить("Владелец");
	Результат.Добавить("ВидЛицензии");
//#Вставка
	Результат.Добавить("ДатаНачала");
	Результат.Добавить("ДатаОкончания");
	Результат.Добавить("КемВыдана");
//#КонецВставки

	Возврат Результат;

КонецФункции

#КонецОбласти
