
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Партнеры") Тогда
		ПараметрыФормы = Новый Структура("Партнер", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Контрагенты") Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Клиент", ПараметрКоманды));
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Организации") Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Организация", ПараметрКоманды))
	КонецЕсли;
	
	ОткрытьФорму(
		"Справочник.битПунктыНазначения.ФормаСписка", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
