
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьКомандуОткрытьФормуСпискаТТНИсходящаяЕГАИС();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ДобавитьКомандуОткрытьФормуСпискаТТНИсходящаяЕГАИС()

	ЗаголовокСпискаТТНИсходящаяЕГАИС = НСтр("ru = 'ТТН ЕГАИС (исходящая)'"); 
	КнопкаОткрытьФормуСпискаТТНИсходящаяЕГАИС = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьКнопкуНаФорму(
		ЭтотОбъект,
		"бг_ОткрытьФормуСпискаТТНИсходящаяЕГАИС",
		Элементы.СписокСозданныеДокументыКоманднаяПанель,
		ЗаголовокСпискаТТНИсходящаяЕГАИС,
		"бг_ОткрытьФормуСпискаТТНИсходящаяЕГАИС",
		"бг_ОткрытьФормуСпискаТТНИсходящаяЕГАИС",
		Неопределено,
		ВидКнопкиФормы.Гиперссылка);

КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьФормуСпискаТТНИсходящаяЕГАИС(Команда)
	
	бг_ОткрытьФормуСпискаДокументов("Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьФормуСпискаДокументов(ИмяФормы, ОткрытьРаспоряжения)
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ОткрытьРаспоряжения", ОткрытьРаспоряжения);	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы);		
		
КонецПроцедуры

#КонецОбласти