
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьДействующаяНастройкаОбмена(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЕстьДействующаяНастройкаОбмена(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бг_creatio_НастройкиОбмена.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бг_creatio_НастройкиОбмена КАК бг_creatio_НастройкиОбмена
	|ГДЕ
	|	НЕ бг_creatio_НастройкиОбмена.ПометкаУдаления
	|	И бг_creatio_НастройкиОбмена.Ссылка <> &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'В базе уже существует действующая настройка обмена'"),
			Ссылка,
			,
			,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти