#Область ПрограммныйИнтерфейс

// Возвращает табличный документ для вывода в качестве отчёта для согласования с СБ по заказу клиента
//
// Параметры:
//  ЗаказКлиента - ДокументСсылка ЗаказКлиента 
// 
// Возвращаемое значение:
//   - ТабличныйДокумент
//
Функция ОтчетДляСогласованияСБПоЗаказуКлиента(ЗаказКлиента) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПодготовитьОтчетДляСогласованияСБ(ТабличныйДокумент, ЗаказКлиента);
	Возврат ТабличныйДокумент;
	
КонецФункции

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - новая команда отчета.
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Обработки.бг_СогласованиеПродаж) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Обработки.бг_СогласованиеПродаж.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Отчет для согласования СБ'");
		
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.Важность = "Обычное";
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьОтчетДляСогласованияСБ(ТабличныйДокумент, ЗаказКлиента)
	
	Если Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// СкидкаCRM
	КонстантаСкидкаCRM = Справочники.бг_ДополнительныеКонстанты.НайтиПоРеквизиту("Идентификатор", "СуммоваяСкидкаCRM");

	ПараметрыЗаказаКлиента = Новый Структура;
	ПараметрыЗаказаКлиента.Вставить("Организация");
	ПараметрыЗаказаКлиента.Вставить("Контрагент");
	ПараметрыЗаказаКлиента.Вставить("ПунктНазначения");
	ПараметрыЗаказаКлиента.Вставить("ДатаОтгрузки");
	ПараметрыЗаказаКлиента.Вставить("ОтсрочкаПлатежа");
	ПараметрыЗаказаКлиента.Вставить("ПлановаяДатаОплаты");
	
	Запрос 	= Новый Запрос;
	МВТ 	= Новый МенеджерВременныхТаблиц;	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	// Подготовим параметры для последующих запросов. Параметры получим из Заказа Клиента запросом.
	Запрос.Текст = ТекстЗапросаПараметровПоЗаказуКлиента();
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("Константа", КонстантаСкидкаCRM);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл		
		ЗаполнитьЗначенияСвойств(ПараметрыЗаказаКлиента, Выборка);		
	КонецЦИкла;
		
	// Получим и выведем данные для первой части отчета.
	Запрос.Текст = ТекстЗапросаПервойЧастиОтчетаСогласованиеСБ();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация", ПараметрыЗаказаКлиента.Организация);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗаказаКлиента.Контрагент);
	Запрос.УстановитьПараметр("ПунктНазначения", ПараметрыЗаказаКлиента.ПунктНазначения);
	Запрос.УстановитьПараметр("ДатаОтгрузки", ПараметрыЗаказаКлиента.ДатаОтгрузки);
	
		
	РезультатЗапроса = Запрос.Выполнить();

	// Вывод первой части отчета
	МакетОтчета 	= Обработки.бг_СогласованиеПродаж.ПолучитьМакет("МакетОтчетаДляСогласованияСБ");
	ОбластьШапка 	= МакетОтчета.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
		
	// Необходимо получить сумму ДСЗ и распределить её на ПДЗ в отчёте. 
	ТаблицаПодготовкиДанныхДляПервойЧастиОтчета = РезультатЗапроса.Выгрузить();
	
	// Удаляем мусор после формирования первой части отчета.
	Запрос.Текст = 
	"УНИЧТОЖИТЬ ИтогоРезультатДляВыводаВПервойЧастиОтчета
	|;
	|УНИЧТОЖИТЬ ОстаткиДЗ
	|;
	|УНИЧТОЖИТЬ СкидкиПоЗаказу
	|;
	|УНИЧТОЖИТЬ ТаблицаОтгрузок
	|;
	|УНИЧТОЖИТЬ МенеджерыПунктовНазначенияСрезПоследних
	|";
		
	Запрос.Выполнить();
			
	ОсталосьРаспределитьДСЗ = ДСЗ(ПараметрыЗаказаКлиента.Контрагент, ЗаказКлиента);	
	Для Каждого Строка из ТаблицаПодготовкиДанныхДляПервойЧастиОтчета Цикл
		
		Если ОсталосьРаспределитьДСЗ = 0 Тогда 
			Прервать;
		КонецЕсли;
		
		ДСЗ = Мин(ОсталосьРаспределитьДСЗ, Строка.ПДЗ);
		Строка.ДСЗ 	= ДСЗ;
		Строка.ПДЗ 	= Строка.ПДЗ - ДСЗ;		
		ОсталосьРаспределитьДСЗ = ОсталосьРаспределитьДСЗ - ДСЗ;		
		
	КонецЦикла;
		
	// Передаём ТаблицаПодготовкиДанныхДляПервойЧастиОтчета в запрос для формирования Итогов
	Запрос.Текст = ТекстЗапросаДляПервойЧастиОтчетаСогласованиеСБСИтогами();
	Запрос.УстановитьПараметр("ТаблицаПослеРаспределенияДСЗ", ТаблицаПодготовкиДанныхДляПервойЧастиОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоКонтрагенту = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);				
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	Пока ВыборкаПоКонтрагенту.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ВыборкаПоКонтрагенту.Выбрать();
		
		ОбластьСтрока = МакетОтчета.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(ВыборкаПоКонтрагенту);
		ТабличныйДокумент.Вывести(ОбластьСтрока, 1, "Контрагент", Истина);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьСтрока = МакетОтчета.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабличныйДокумент.Вывести(ОбластьСтрока, 2, "ДетальныеЗаписи", Истина);				
		КонецЦИкла;
		
	КонецЦИкла;
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();	
			
	// Заполнение Второй Части отчета
	ОбластьСводныйОтчетЧасть1 = МакетОтчета.ПолучитьОбласть("СводныйОтчетЧасть1");			
	// Данные по заказу
	ОбластьСводныйОтчетЧасть1.Параметры.ДатаОтгрузки 			= ПараметрыЗаказаКлиента.ДатаОтгрузки;
	ОбластьСводныйОтчетЧасть1.Параметры.ОтсрочкаПлатежа   		= ПараметрыЗаказаКлиента.ОтсрочкаПлатежа;
	ОбластьСводныйОтчетЧасть1.Параметры.ПлановаяДатаОплаты    	= ПараметрыЗаказаКлиента.ПлановаяДатаОплаты;
		
	// Основные данные по второй части отчёта	
	СтатусыЗаказовКлиентаДляПолученияОтгрузок = Новый Массив;
	СтатусыЗаказовКлиентаДляПолученияОтгрузок.Добавить(Перечисления.бг_РезультатыСогласования.Согласовано);
	СтатусыЗаказовКлиентаДляПолученияОтгрузок.Добавить(Перечисления.бг_РезультатыСогласования.СогласованоПринудительно);
	СтатусыЗаказовКлиентаДляПолученияОтгрузок.Добавить(Перечисления.бг_РезультатыСогласования.АвтоСогласование);
		
	Запрос.Текст = ТекстЗапросаВторойЧастиОтчетаСогласованиеСБ();	
	Запрос.УстановитьПараметр("ДатаОтгрузки", ПараметрыЗаказаКлиента.ДатаОтгрузки);
	Запрос.УстановитьПараметр("СтатусыЗаказовКлиентаДляПолученияОтгрузок", СтатусыЗаказовКлиентаДляПолученияОтгрузок);
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДляЗаполненияСводногоОтчета = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДляЗаполненияСводногоОтчета.Следующий() Цикл
		ОбластьСводныйОтчетЧасть1.Параметры.Заполнить(ВыборкаДляЗаполненияСводногоОтчета);					
	КонецЦикла;		
	ТабличныйДокумент.Вывести(ОбластьСводныйОтчетЧасть1);
		
	ТаблицаЛимитовTCI = Запрос.МенеджерВременныхТаблиц.Таблицы["РезультатПоКонтрагентуСЛимитомTCI"]; 
	РезультатЗапроса = ТаблицаЛимитовTCI.ПолучитьДанные();	
	 
	Если РезультатЗапроса.Пустой() Тогда
		ОбластьTCIСтрока = МакетОтчета.ПолучитьОбласть("ЛимитTCI");	
	    ТабличныйДокумент.Вывести(ОбластьTCIСтрока);
	Иначе
		ВыборкаTCI = РезультатЗапроса.Выбрать();
		Счетчик = 1;
		Пока ВыборкаTCI.Следующий() Цикл
			ОбластьTCIСтрока = МакетОтчета.ПолучитьОбласть("ЛимитTCI");
			ОбластьTCIСтрока.Параметры.Заполнить(ВыборкаTCI);
			ОбластьTCIСтрока.Параметры.НомерЛимита = Счетчик; 
			ТабличныйДокумент.Вывести(ОбластьTCIСтрока);
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;	
	
	ВыборкаДляЗаполненияСводногоОтчета.Сбросить();	
	ОбластьСводныйОтчетЧасть2 = МакетОтчета.ПолучитьОбласть("СводныйОтчетЧасть2");
	Пока ВыборкаДляЗаполненияСводногоОтчета.Следующий() Цикл
		ОбластьСводныйОтчетЧасть2.Параметры.Заполнить(ВыборкаДляЗаполненияСводногоОтчета);
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьСводныйОтчетЧасть2);
	
	// Отгрузки за период с оплатами за период	
	Запрос.Текст = ТекстЗапросаПолученияОтгрузокИОплатЗаПериод();	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ОбластьОтгрузкиОплаты = МакетОтчета.ПолучитьОбласть("ОтгрузкиОплаты");
		ОбластьОтгрузкиОплаты.Параметры.Заполнить(Выборка);	
		ТабличныйДокумент.Вывести(ОбластьОтгрузкиОплаты);
	КонецЦикла;
	
	ОбластьКомментарийШапка = МакетОтчета.ПолучитьОбласть("КомментарийШапка");
	ТабличныйДокумент.Вывести(ОбластьКомментарийШапка);
	
	ОбластьКомментарий = МакетОтчета.ПолучитьОбласть("Комментарий");
	Запрос.Текст = ТекстЗапросаКомментарииСБ();	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ОбластьКомментарий.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьКомментарий);
	КонецЦикла;

	// Удаляем мусор.
	МВТ.Закрыть();

	ТабличныйДокумент.ОтображатьСетку = Ложь;	
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ТекстЗапросаПервойЧастиОтчетаСогласованиеСБ() 
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыСРозничнымиКлиентами.Организация КАК Организация,
	|	РасчетыСРозничнымиКлиентами.Контрагент КАК Контрагент,
	|	РасчетыСРозничнымиКлиентами.Договор КАК Договор,
	|	РасчетыСРозничнымиКлиентами.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВЫРАЗИТЬ(РасчетыСРозничнымиКлиентами.ДокументОтгрузки.ЗаказКлиента КАК Документ.ЗаказКлиента) КАК ЗаказКлиента,
	|	ДОБАВИТЬКДАТЕ(РасчетыСРозничнымиКлиентами.ДокументОтгрузки.Дата, ДЕНЬ, ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСРозничнымиКлиентами.ДокументОтгрузки.ЗаказКлиента КАК Документ.ЗаказКлиента).бг_КоличествоДнейОтсрочки + ВЫРАЗИТЬ(РасчетыСРозничнымиКлиентами.ДокументОтгрузки.ЗаказКлиента КАК Документ.ЗаказКлиента).бг_КорректировкаОтсрочкиПлатежа, 0)) КАК ДатаПлановогоПогашения,
	|	РасчетыСРозничнымиКлиентами.СуммаВРозницуОстаток КАК СуммаВРозницуОстаток,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСРозничнымиКлиентами.ДокументОтгрузки.ЗаказКлиента КАК Документ.ЗаказКлиента).бг_КоличествоДнейОтсрочки, 0) КАК ОтсрочкаПлатежа,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСРозничнымиКлиентами.ДокументОтгрузки.ЗаказКлиента КАК Документ.ЗаказКлиента).бг_КорректировкаОтсрочкиПлатежа, 0) КАК КорректировкаОтсрочкиПлатежа,
	|	ВЫРАЗИТЬ(РасчетыСРозничнымиКлиентами.ДокументОтгрузки.ЗаказКлиента КАК Документ.ЗаказКлиента).СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ РасчетыСРозничнымиКлиентами
	|ИЗ
	|	РегистрНакопления.бг_РасчетыСРозничнымиКлиентами.Остатки(
	|			,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент) КАК РасчетыСРозничнымиКлиентами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг) КАК ДокументОтгрузки,
	|	РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения КАК ПлановаяДатаОплаты,
	|	РасчетыСКлиентамиПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток КАК ОДЗ,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения < &ТекущаяДата
	|			ТОГДА РАЗНОСТЬДАТ(РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения, &ТекущаяДата, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДнейПросрочкиОплаты,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения < &ТекущаяДата
	|			ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПДЗ,
	|	РАЗНОСТЬДАТ(РасчетыСКлиентамиПоСрокамОстатки.ДатаВозникновения, РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения, ДЕНЬ) КАК ОтсрочкаПлатежа,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).ЗаказКлиента КАК ЗаказКлиента,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).бг_Лицензия КАК Лицензия,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).бг_ПунктНазначения КАК ПунктНазначения,
	|	РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения, &ДатаОтгрузки, ДЕНЬ) < 0
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения, &ДатаОтгрузки, ДЕНЬ)
	|	КОНЕЦ КАК СрокПросрочки,
	|	РАЗНОСТЬДАТ(РасчетыСКлиентамиПоСрокамОстатки.ДатаВозникновения, РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения, ДЕНЬ) - ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).бг_КорректировкаОтсрочкиПлатежа КАК ОтсрочкаПлатежаБезУчетаКорректировки,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ОстаткиДЗ
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|				И АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	|				И РасчетныйДокумент ССЫЛКА Документ.РеализацияТоваровУслуг) КАК РасчетыСКлиентамиПоСрокамОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСРозничнымиКлиентами.Организация,
	|	РасчетыСРозничнымиКлиентами.Контрагент,
	|	РасчетыСРозничнымиКлиентами.Договор,
	|	РасчетыСРозничнымиКлиентами.ДокументОтгрузки,
	|	РасчетыСРозничнымиКлиентами.ДатаПлановогоПогашения,
	|	РасчетыСРозничнымиКлиентами.ДокументОтгрузки.Дата,
	|	РасчетыСРозничнымиКлиентами.СуммаВРозницуОстаток,
	|	ВЫБОР
	|		КОГДА РасчетыСРозничнымиКлиентами.ДокументОтгрузки.Дата < &ТекущаяДата
	|			ТОГДА РАЗНОСТЬДАТ(РасчетыСРозничнымиКлиентами.ДокументОтгрузки.Дата, &ТекущаяДата, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСРозничнымиКлиентами.ДокументОтгрузки.Дата < &ТекущаяДата
	|			ТОГДА РасчетыСРозничнымиКлиентами.СуммаВРозницуОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	РасчетыСРозничнымиКлиентами.ОтсрочкаПлатежа,
	|	РасчетыСРозничнымиКлиентами.ЗаказКлиента,
	|	РасчетыСРозничнымиКлиентами.ЗаказКлиента.бг_Лицензия,
	|	РасчетыСРозничнымиКлиентами.ЗаказКлиента.бг_ПунктНазначения,
	|	РасчетыСРозничнымиКлиентами.ДокументОтгрузки,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(РасчетыСРозничнымиКлиентами.ДатаПлановогоПогашения, &ДатаОтгрузки, ДЕНЬ) < 0
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(РасчетыСРозничнымиКлиентами.ДатаПлановогоПогашения, &ДатаОтгрузки, ДЕНЬ)
	|	КОНЕЦ,
	|	РасчетыСРозничнымиКлиентами.ОтсрочкаПлатежа - РасчетыСРозничнымиКлиентами.КорректировкаОтсрочкиПлатежа,
	|	РасчетыСРозничнымиКлиентами.СуммаДокумента
	|ИЗ
	|	РасчетыСРозничнымиКлиентами КАК РасчетыСРозничнымиКлиентами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	РасчетыСКлиентамиПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	МАКСИМУМ(РасчетыСКлиентамиПоСрокам.Период) КАК ДатаПоследнейОплаты,
	|	СУММА(РасчетыСКлиентамиПоСрокам.Долг) КАК Оплаты
	|ПОМЕСТИТЬ ТаблицаОплат
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиДЗ КАК ОстаткиДЗ
	|		ПО РасчетыСКлиентамиПоСрокам.РасчетныйДокумент = ОстаткиДЗ.РасчетныйДокумент
	|ГДЕ
	|	РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
	|	И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	|	И РасчетыСКлиентамиПоСрокам.Период МЕЖДУ &НачалоПериода И &ТекущаяДата
	|	И РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.РасчетныйДокумент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(РасчетыСКлиентамиПоСрокам.ДолгПриход) КАК ОтгрузкиЗаПериод
	|ПОМЕСТИТЬ ТаблицаОтгрузок
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Обороты(
	|			&НачалоПериода,
	|			&ТекущаяДата,
	|			,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|				И АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	|				И РасчетныйДокумент В
	|					(ВЫБРАТЬ
	|						ОстаткиДЗ.РасчетныйДокумент
	|					ИЗ
	|						ОстаткиДЗ)) КАК РасчетыСКлиентамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокам.РасчетныйДокумент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МенеджерыПунктовНазначенияСрезПоследних.ПунктНазначения КАК ПунктНазначения,
	|	МенеджерыПунктовНазначенияСрезПоследних.Менеджер КАК Менеджер,
	|	МенеджерыПунктовНазначенияСрезПоследних.МаршрутТорговогоПредставителя КАК МаршрутТорговогоПредставителя
	|ПОМЕСТИТЬ МенеджерыПунктовНазначенияСрезПоследних
	|ИЗ
	|	РегистрСведений.бг_МенеджерыПунктовНазначения.СрезПоследних(, ПунктНазначения В (ВЫБРАТЬ ПунктНазначения ИЗ ОстаткиДЗ)) КАК МенеджерыПунктовНазначенияСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДЗ.Организация КАК Организация,
	|	ОстаткиДЗ.Контрагент КАК Контрагент,
	|	ОстаткиДЗ.Договор КАК Договор,
	|	ОстаткиДЗ.ПунктНазначения КАК ПунктНазначения,
	|	ОстаткиДЗ.ДокументОтгрузки.Номер КАК НомерДокумента,
	|	ОстаткиДЗ.ДокументОтгрузки.Дата КАК ДатаДокумента,
	|	ОстаткиДЗ.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты,
	|	ОстаткиДЗ.ДатаВозникновения КАК ДатаВозникновения,
	|	ОстаткиДЗ.ОДЗ КАК ОДЗ,
	|	ОстаткиДЗ.ДнейПросрочкиОплаты КАК ГлубинаПросрочки,
	|	ОстаткиДЗ.ПДЗ КАК ПДЗ,
	|	ОстаткиДЗ.ПунктНазначения.Адрес КАК ПунктРазгрузки,
	|	ОстаткиДЗ.ПунктНазначения.КПП КАК КПП,
	|	ОстаткиДЗ.ПунктНазначения.КодТТSY КАК КодТТSY,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты <= 7
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК До7,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты >= 8
	|				И ОстаткиДЗ.ДнейПросрочкиОплаты < 14
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От8До14,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты >= 15
	|				И ОстаткиДЗ.ДнейПросрочкиОплаты < 30
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От15До30,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты >= 31
	|				И ОстаткиДЗ.ДнейПросрочкиОплаты < 60
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От31До60,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты >= 61
	|				И ОстаткиДЗ.ДнейПросрочкиОплаты < 90
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От61До90,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты >= 90
	|				И ОстаткиДЗ.ДнейПросрочкиОплаты < 150
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От91До150,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты >= 151
	|				И ОстаткиДЗ.ДнейПросрочкиОплаты < 180
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От151До180,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты >= 181
	|				И ОстаткиДЗ.ДнейПросрочкиОплаты < 365
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От180До365,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты >= 366
	|				И ОстаткиДЗ.ДнейПросрочкиОплаты < 730
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От366До730,
	|	ВЫБОР
	|		КОГДА ОстаткиДЗ.ДнейПросрочкиОплаты > 731
	|			ТОГДА ОстаткиДЗ.ПДЗ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК От731,
	|	ОстаткиДЗ.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
	|	ОстаткиДЗ.ОДЗ - ОстаткиДЗ.ПДЗ КАК ТекущаяДЗ,
	|	ОстаткиДЗ.Лицензия.бг_ДатаПрекращенияДействия КАК ДатаОкончанияЛицензии,
	|	ДОБАВИТЬКДАТЕ(ОстаткиДЗ.Лицензия.бг_ДатаПрекращенияДействия, ДЕНЬ, -30) КАК ОкончаниеЛицензии30,
	|	ОстаткиДЗ.Лицензия КАК Лицензия,
	|	ОстаткиДЗ.ПунктНазначения.КаналПродаж КАК КаналСбыта,
	|	ДОБАВИТЬКДАТЕ(ОстаткиДЗ.Лицензия.бг_ДатаПрекращенияДействия, ДЕНЬ, -60) КАК ОкончаниеЛицензии60,
	|	ЕСТЬNULL(ТаблицаОплат.Оплаты, 0) КАК ОплатаЗаПериод,
	|	ТаблицаОплат.ДатаПоследнейОплаты КАК ДатаПоследнейОплаты,
	|	ЕСТЬNULL(ТаблицаОтгрузок.ОтгрузкиЗаПериод, 0) КАК ОтгрузкиЗаПериод,
	|	ЕСТЬNULL(МенеджерыПунктовНазначенияСрезПоследних.Менеджер, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Менеджер,
	|	ЕСТЬNULL(МенеджерыПунктовНазначенияСрезПоследних.Менеджер.бг_Руководитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК СВ,
	|	ЕСТЬNULL(МенеджерыПунктовНазначенияСрезПоследних.Менеджер.бг_Руководитель.бг_Руководитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК РЭК,
	|	ЕСТЬNULL(МенеджерыПунктовНазначенияСрезПоследних.МаршрутТорговогоПредставителя, ЗНАЧЕНИЕ(Справочник.бг_МаршрутыТорговыхПредставителей.ПустаяСсылка)) КАК КодТП,
	|	ЕСТЬNULL(СогласованиеЗаказовКлиентов.РезультатСогласованияКК, ЗНАЧЕНИЕ(Перечисление.бг_РезультатыСогласования.ПустаяСсылка)) КАК РезультатСогласованияКК,
	|	ВЫБОР
	|		КОГДА ТаблицаОплат.ДатаПоследнейОплаты <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА РАЗНОСТЬДАТ(ОстаткиДЗ.ПлановаяДатаОплаты, ТаблицаОплат.ДатаПоследнейОплаты, ДЕНЬ) > 0
	|						ТОГДА РАЗНОСТЬДАТ(ОстаткиДЗ.ПлановаяДатаОплаты, ТаблицаОплат.ДатаПоследнейОплаты, ДЕНЬ)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДнейПросрочкиОплаты,
	|	ОстаткиДЗ.СрокПросрочки КАК СрокПросрочки,
	|	0 КАК ДСЗ,
	|	ОстаткиДЗ.ПДЗ КАК РеальнаяПДЗ,
	|	ОстаткиДЗ.ОтсрочкаПлатежаБезУчетаКорректировки КАК ОтсрочкаПлатежаБезУчетаКорректировки,
	|	ОстаткиДЗ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ИтогоРезультатДляВыводаВПервойЧастиОтчета
	|ИЗ
	|	ОстаткиДЗ КАК ОстаткиДЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОплат КАК ТаблицаОплат
	|		ПО ОстаткиДЗ.РасчетныйДокумент = ТаблицаОплат.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтгрузок КАК ТаблицаОтгрузок
	|		ПО ОстаткиДЗ.РасчетныйДокумент = ТаблицаОтгрузок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ МенеджерыПунктовНазначенияСрезПоследних КАК МенеджерыПунктовНазначенияСрезПоследних
	|		ПО ОстаткиДЗ.ПунктНазначения = МенеджерыПунктовНазначенияСрезПоследних.ПунктНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_СогласованиеЗаказовКлиентов КАК СогласованиеЗаказовКлиентов
	|		ПО ОстаткиДЗ.ЗаказКлиента = СогласованиеЗаказовКлиентов.ЗаказКлиента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Организация КАК Организация,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Контрагент КАК Контрагент,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Договор КАК Договор,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ПунктНазначения КАК ПунктНазначения,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.НомерДокумента КАК НомерДокумента,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДатаДокумента КАК ДатаДокумента,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДатаВозникновения КАК ДатаВозникновения,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОДЗ КАК ОДЗ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ГлубинаПросрочки КАК ГлубинаПросрочки,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ПДЗ КАК ПДЗ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.КПП КАК КПП,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.КодТТSY КАК КодТТSY,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.До7 КАК До7,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От8До14 КАК От8До14,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От15До30 КАК От15До30,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От31До60 КАК От31До60,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От61До90 КАК От61До90,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От91До150 КАК От91До150,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От151До180 КАК От151До180,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От180До365 КАК От180До365,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От366До730 КАК От366До730,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От731 КАК От731,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ТекущаяДЗ КАК ТекущаяДЗ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДатаОкончанияЛицензии КАК ДатаОкончанияЛицензии,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОкончаниеЛицензии30 КАК ОкончаниеЛицензии30,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Лицензия КАК Лицензия,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.КаналСбыта КАК КаналСбыта,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОкончаниеЛицензии60 КАК ОкончаниеЛицензии60,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОплатаЗаПериод КАК ОплатаЗаПериод,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДатаПоследнейОплаты КАК ДатаПоследнейОплаты,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОтгрузкиЗаПериод КАК ОтгрузкиЗаПериод,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.СВ КАК СВ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.РЭК КАК РЭК,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.КодТП КАК КодТП,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДнейПросрочкиОплаты КАК ДнейПросрочкиОплаты,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.СрокПросрочки КАК СрокПросрочки,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Менеджер КАК Менеджер,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Контрагент.ИНН КАК ИНН,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.РезультатСогласованияКК КАК РезультатСогласованияКК,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДСЗ КАК ДСЗ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.РеальнаяПДЗ КАК РеальнаяПДЗ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОтсрочкаПлатежаБезУчетаКорректировки КАК ОтсрочкаПлатежаБезУчетаКорректировки,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета КАК ИтогоРезультатДляВыводаВПервойЧастиОтчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлановаяДатаОплаты УБЫВ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВторойЧастиОтчетаСогласованиеСБ()
	
	Текст = 
	"ВЫБРАТЬ
	|	ОстаткиДЗ.Контрагент КАК Контрагент,
	|	СУММА(ЕСТЬNULL(ОстаткиДЗ.ОДЗ, 0)) КАК ОДЗ,
	|	СУММА(ЕСТЬNULL(ОстаткиДЗ.РеальнаяПДЗ, 0)) КАК ПДЗ,
	|	СУММА(ЕСТЬNULL(ОстаткиДЗ.ДСЗ, 0)) КАК ДСЗ
	|ПОМЕСТИТЬ РезультатПоКонтрагенту
	|ИЗ
	|	ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиентаССуммойСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ КАК ОстаткиДЗ
	|		ПО ДанныеЗаказаКлиентаССуммойСкидки.Контрагент = ОстаткиДЗ.Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиДЗ.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатПоКонтрагенту.Контрагент КАК Контрагент,
	|	СУММА(РезультатПоКонтрагенту.ОДЗ) КАК ОДЗ,
	|	СУММА(РезультатПоКонтрагенту.ПДЗ) КАК ПДЗ,
	|	СУММА(РезультатПоКонтрагенту.ДСЗ) КАК ДСЗ
	|ПОМЕСТИТЬ РезультатПоКонтрагентуСЛимитами
	|ИЗ
	|	РезультатПоКонтрагенту КАК РезультатПоКонтрагенту
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатПоКонтрагенту.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент КАК Контрагент,
	|	СУММА(ЕСТЬNULL(КредитныеЛимиты.Сумма, 0)) КАК Сумма
	|ПОМЕСТИТЬ РезультатПоКонтрагентуСКредитнымЛимитом
	|ИЗ
	|	ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиентаССуммойСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_КредитныеЛимиты КАК КредитныеЛимиты
	|		ПО ДанныеЗаказаКлиентаССуммойСкидки.Контрагент = КредитныеЛимиты.Контрагент
	|ГДЕ
	|	КредитныеЛимиты.ВидЛимита = ЗНАЧЕНИЕ(Перечисление.бг_ВидыКредитныхЛимитов.Кредитный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(КредитныеЛимиты.Сумма, 0)) КАК Сумма,
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ РезультатПоКонтрагентуСЛимитомБГ
	|ИЗ
	|	ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиентаССуммойСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_КредитныеЛимиты КАК КредитныеЛимиты
	|		ПО ДанныеЗаказаКлиентаССуммойСкидки.Контрагент = КредитныеЛимиты.Контрагент
	|ГДЕ
	|	КредитныеЛимиты.ВидЛимита = ЗНАЧЕНИЕ(Перечисление.бг_ВидыКредитныхЛимитов.БГ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЛимитыОтгрузкиИОтсрочкиПлатежаTCI.СуммаЛимита, 0) КАК ЛимитTCI,
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ РезультатПоКонтрагентуСЛимитомTCI
	|ИЗ
	|	РезультатПоКонтрагенту КАК РезультатПоКонтрагенту,
	|	РегистрСведений.бг_ЛимитыОтгрузкиИОтсрочкиПлатежаTCI КАК ЛимитыОтгрузкиИОтсрочкиПлатежаTCI
	|		ПРАВОЕ СОЕДИНЕНИЕ ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиентаССуммойСкидки
	|		ПО (ДанныеЗаказаКлиентаССуммойСкидки.Контрагент = ЛимитыОтгрузкиИОтсрочкиПлатежаTCI.Контрагент)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДЗ.Организация КАК Организация,
	|	ОстаткиДЗ.Контрагент КАК Контрагент,
	|	ОстаткиДЗ.ПунктНазначения КАК ПунктНазначения,
	|	СУММА(ЕСТЬNULL(ОстаткиДЗ.ОДЗ, 0)) КАК ОДЗ,
	|	СУММА(ЕСТЬNULL(ОстаткиДЗ.РеальнаяПДЗ, 0)) КАК ПДЗ,
	|	СУММА(ЕСТЬNULL(ОстаткиДЗ.ДСЗ, 0)) КАК ДСЗ
	|ПОМЕСТИТЬ РезультатПоКонтрагентуПунктуНазначению
	|ИЗ
	|	ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиентаССуммойСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ КАК ОстаткиДЗ
	|		ПО ДанныеЗаказаКлиентаССуммойСкидки.Контрагент = ОстаткиДЗ.Контрагент
	|			И ДанныеЗаказаКлиентаССуммойСкидки.ПунктНазначения = ОстаткиДЗ.ПунктНазначения
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиДЗ.Организация,
	|	ОстаткиДЗ.Контрагент,
	|	ОстаткиДЗ.ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатПоКонтрагентуПунктуНазначению.Организация КАК Организация,
	|	РезультатПоКонтрагентуПунктуНазначению.Контрагент КАК Контрагент,
	|	РезультатПоКонтрагентуПунктуНазначению.ПунктНазначения КАК ПунктНазначения,
	|	СУММА(РезультатПоКонтрагентуПунктуНазначению.ОДЗ) КАК ОДЗ,
	|	СУММА(РезультатПоКонтрагентуПунктуНазначению.ПДЗ) КАК ПДЗ,
	|	СУММА(РезультатПоКонтрагентуПунктуНазначению.ДСЗ) КАК ДСЗ
	|ПОМЕСТИТЬ РезультатПоКонтрагентуПунктуНазначениюСЛимитом
	|ИЗ
	|	РезультатПоКонтрагентуПунктуНазначению КАК РезультатПоКонтрагентуПунктуНазначению
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатПоКонтрагентуПунктуНазначению.Организация,
	|	РезультатПоКонтрагентуПунктуНазначению.Контрагент,
	|	РезультатПоКонтрагентуПунктуНазначению.ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(КредитныеЛимиты.Сумма, 0)) КАК Сумма,
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент КАК Контрагент,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ РезультатПоКонтрагентуПунктуНазначенияСКредитнымЛимитом
	|ИЗ
	|	ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиентаССуммойСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_КредитныеЛимиты КАК КредитныеЛимиты
	|		ПО ДанныеЗаказаКлиентаССуммойСкидки.Контрагент = КредитныеЛимиты.Контрагент
	|			И ДанныеЗаказаКлиентаССуммойСкидки.ПунктНазначения = КредитныеЛимиты.ПунктНазначения
	|ГДЕ
	|	КредитныеЛимиты.ВидЛимита = ЗНАЧЕНИЕ(Перечисление.бг_ВидыКредитныхЛимитов.Кредитный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ПунктНазначения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(КредитныеЛимиты.Сумма, 0)) КАК Сумма,
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент КАК Контрагент,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ РезультатПоКонтрагентуПунктуНазначенияСЛимитомБГ
	|ИЗ
	|	ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиентаССуммойСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_КредитныеЛимиты КАК КредитныеЛимиты
	|		ПО ДанныеЗаказаКлиентаССуммойСкидки.Контрагент = КредитныеЛимиты.Контрагент
	|			И ДанныеЗаказаКлиентаССуммойСкидки.ПунктНазначения = КредитныеЛимиты.ПунктНазначения
	|ГДЕ
	|	КредитныеЛимиты.ВидЛимита = ЗНАЧЕНИЕ(Перечисление.бг_ВидыКредитныхЛимитов.БГ)
	|	И КредитныеЛимиты.ПунктНазначения = &ПунктНазначения
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЗаказыКлиентовОстатки.ЗаказКлиента КАК Документ.ЗаказКлиента).Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗаказыКлиентовОстатки.ЗаказКлиента КАК Документ.ЗаказКлиента).бг_ПунктНазначения КАК ПунктНазначения,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	СУММА(ЗаказыКлиентовОстатки.СуммаОстаток) КАК ЗаказаноПоПунктуНазначения
	|ПОМЕСТИТЬ ЗаказаноИНеОтгруженоПоПунктуНазначения
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(
	|			&ДатаОтгрузки,
	|			ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.ЗаказКлиента).Контрагент = &Контрагент
	|				И ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.ЗаказКлиента).бг_ПунктНазначения = &Пунктназначения
	|				И ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.ЗаказКлиента).ДатаОтгрузки <= &ДатаОтгрузки) КАК ЗаказыКлиентовОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ЗаказыКлиентовОстатки.ЗаказКлиента КАК Документ.ЗаказКлиента).Контрагент,
	|	ВЫРАЗИТЬ(ЗаказыКлиентовОстатки.ЗаказКлиента КАК Документ.ЗаказКлиента).бг_ПунктНазначения,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказаноИНеОтгруженоПоПунктуНазначения.Контрагент КАК Контрагент,
	|	ЗаказаноИНеОтгруженоПоПунктуНазначения.ПунктНазначения КАК ПунктНазначения,
	|	СУММА(ЗаказаноИНеОтгруженоПоПунктуНазначения.ЗаказаноПоПунктуНазначения) КАК ЗаказаноПоПунктуНазначения
	|ПОМЕСТИТЬ ЗаказаноИНеОтгруженоПоПунктуНазначенияССогласованием
	|ИЗ
	|	ЗаказаноИНеОтгруженоПоПунктуНазначения КАК ЗаказаноИНеОтгруженоПоПунктуНазначения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_СогласованиеЗаказовКлиентов КАК СогласованиеЗаказовКлиентов
	|		ПО ЗаказаноИНеОтгруженоПоПунктуНазначения.ЗаказКлиента = СогласованиеЗаказовКлиентов.ЗаказКлиента
	|ГДЕ
	|	СогласованиеЗаказовКлиентов.РезультатСогласованияФК В(&СтатусыЗаказовКлиентаДляПолученияОтгрузок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказаноИНеОтгруженоПоПунктуНазначения.Контрагент,
	|	ЗаказаноИНеОтгруженоПоПунктуНазначения.ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЗаказыКлиентовОстатки.ЗаказКлиента КАК Документ.ЗаказКлиента).Контрагент КАК Контрагент,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	СУММА(ЗаказыКлиентовОстатки.СуммаОстаток) КАК ЗаказаноПоКонтрагенту
	|ПОМЕСТИТЬ ЗаказаноИНеОтгруженоПоКонтрагенту
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(
	|			&ДатаОтгрузки,
	|			ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.ЗаказКлиента).Контрагент = &Контрагент
	|				И ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.ЗаказКлиента).ДатаОтгрузки <= &ДатаОтгрузки) КАК ЗаказыКлиентовОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ЗаказыКлиентовОстатки.ЗаказКлиента КАК Документ.ЗаказКлиента).Контрагент,
	|	ЗаказыКлиентовОстатки.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказаноИНеОтгруженоПоКонтрагенту.Контрагент КАК Контрагент,
	|	СУММА(ЗаказаноИНеОтгруженоПоКонтрагенту.ЗаказаноПоКонтрагенту) КАК ЗаказаноПоКонтрагенту
	|ПОМЕСТИТЬ ЗаказаноИНеОтгруженоПоКонтрагентуССогласованием
	|ИЗ
	|	ЗаказаноИНеОтгруженоПоКонтрагенту КАК ЗаказаноИНеОтгруженоПоКонтрагенту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_СогласованиеЗаказовКлиентов КАК СогласованиеЗаказовКлиентов
	|		ПО ЗаказаноИНеОтгруженоПоКонтрагенту.ЗаказКлиента = СогласованиеЗаказовКлиентов.ЗаказКлиента
	|ГДЕ
	|	СогласованиеЗаказовКлиентов.РезультатСогласованияФК В(&СтатусыЗаказовКлиентаДляПолученияОтгрузок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказаноИНеОтгруженоПоКонтрагенту.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатПоКонтрагентуСЛимитами.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ОДЗ, 0) КАК ОДЗКонтрагент,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ПДЗ, 0) КАК ПДЗКонтрагент,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ОДЗ, 0) КАК ОДЗПунктНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ПДЗ, 0) КАК ПДЗПунктНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ОДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ДСЗ, 0) + ЕСТЬNULL(ДанныеЗаказаКлиента.СуммаСкидкиCRM, 0) КАК РазностьОДЗКонтрагент,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ПДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ДСЗ, 0) КАК РазностьПДЗКонтрагент,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ОДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ДСЗ, 0) + ЕСТЬNULL(ДанныеЗаказаКлиента.СуммаСкидкиCRM, 0) КАК РазностьОДЗПунктНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ПДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ДСЗ, 0) КАК РазностьПДЗПунктНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначенияСКредитнымЛимитом.Сумма, 0) КАК КредитныйЛимитПунктНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСКредитнымЛимитом.Сумма, 0) КАК КредитныйЛимитКонтрагент,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ПДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ДСЗ, 0) КАК ПДЗсУчетомВсехЗаявокНаТТ,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ПДЗ, 0) - РезультатПоКонтрагентуСЛимитами.ДСЗ КАК ПДЗсУчетомВсехЗаявокПоКонтрагенту,
	|	ЕСТЬNULL(ДанныеЗаказаКлиента.СуммаСкидкиCRM, 0) КАК РезервСуммовойСкидки,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ДСЗ, 0) КАК ЛимитПунктНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ДСЗ, 0) КАК ЛимитКонтрагент,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитомБГ.Сумма, 0) КАК ЛимитБГПоКонтрагенту,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначенияСЛимитомБГ.Сумма, 0) КАК ЛимитБГПоПунктуНазначения,
	|	ЕСТЬNULL(ЗаказаноИНеОтгруженоПоКонтрагентуССогласованием.ЗаказаноПоКонтрагенту, 0) КАК ЗаказаноИНеОтгруженоПоКонтрагенту,
	|	ЕСТЬNULL(ЗаказаноИНеОтгруженоПоПунктуНазначенияССогласованием.ЗаказаноПоПунктуНазначения, 0) КАК ЗаказаноИНеОтгруженоПоПунктуНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ОДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ДСЗ, 0) + ЕСТЬNULL(ДанныеЗаказаКлиента.СуммаСкидкиCRM, 0) + ЕСТЬNULL(ЗаказаноИНеОтгруженоПоКонтрагентуССогласованием.ЗаказаноПоКонтрагенту, 0) КАК ОбщаяСуммаПревышенияПоВсемЗаявкамПоКонтрагенту,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ОДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ДСЗ, 0) + ЕСТЬNULL(ДанныеЗаказаКлиента.СуммаСкидкиCRM, 0) + ЕСТЬNULL(ЗаказаноИНеОтгруженоПоПунктуНазначенияССогласованием.ЗаказаноПоПунктуНазначения, 0) КАК ОбщаяСуммаПревышенияПоВсемЗаявкамПоПунктуНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ОДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначениюСЛимитом.ДСЗ, 0) + ЕСТЬNULL(ДанныеЗаказаКлиента.СуммаСкидкиCRM, 0) + ЕСТЬNULL(ЗаказаноИНеОтгруженоПоПунктуНазначенияССогласованием.ЗаказаноПоПунктуНазначения, 0) - ЕСТЬNULL(РезультатПоКонтрагентуПунктуНазначенияСКредитнымЛимитом.Сумма, 0) КАК ПревышениеОбщегоЛимитаПоВсемЗаявкамПоПунктуНазначения,
	|	ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ОДЗ, 0) - ЕСТЬNULL(РезультатПоКонтрагентуСЛимитами.ДСЗ, 0) + ЕСТЬNULL(ДанныеЗаказаКлиента.СуммаСкидкиCRM, 0) + ЕСТЬNULL(ЗаказаноИНеОтгруженоПоКонтрагентуССогласованием.ЗаказаноПоКонтрагенту, 0) - ЕСТЬNULL(РезультатПоКонтрагентуСКредитнымЛимитом.Сумма, 0) КАК ПревышениеОбщегоЛимитаПоВсемЗаявкамПоКонтрагенту
	|ИЗ
	|	ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПоКонтрагентуСЛимитами КАК РезультатПоКонтрагентуСЛимитами
	|		ПО ДанныеЗаказаКлиента.Контрагент = РезультатПоКонтрагентуСЛимитами.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПоКонтрагентуПунктуНазначениюСЛимитом КАК РезультатПоКонтрагентуПунктуНазначениюСЛимитом
	|		ПО ДанныеЗаказаКлиента.Контрагент = РезультатПоКонтрагентуПунктуНазначениюСЛимитом.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказаноИНеОтгруженоПоПунктуНазначенияССогласованием КАК ЗаказаноИНеОтгруженоПоПунктуНазначенияССогласованием
	|		ПО ДанныеЗаказаКлиента.Контрагент = ЗаказаноИНеОтгруженоПоПунктуНазначенияССогласованием.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказаноИНеОтгруженоПоКонтрагентуССогласованием КАК ЗаказаноИНеОтгруженоПоКонтрагентуССогласованием
	|		ПО ДанныеЗаказаКлиента.Контрагент = ЗаказаноИНеОтгруженоПоКонтрагентуССогласованием.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПоКонтрагентуСКредитнымЛимитом КАК РезультатПоКонтрагентуСКредитнымЛимитом
	|		ПО ДанныеЗаказаКлиента.Контрагент = РезультатПоКонтрагентуСКредитнымЛимитом.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПоКонтрагентуСЛимитомБГ КАК РезультатПоКонтрагентуСЛимитомБГ
	|		ПО ДанныеЗаказаКлиента.Контрагент = РезультатПоКонтрагентуСЛимитомБГ.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПоКонтрагентуПунктуНазначенияСКредитнымЛимитом КАК РезультатПоКонтрагентуПунктуНазначенияСКредитнымЛимитом
	|		ПО ДанныеЗаказаКлиента.Контрагент = РезультатПоКонтрагентуПунктуНазначенияСКредитнымЛимитом.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПоКонтрагентуПунктуНазначенияСЛимитомБГ КАК РезультатПоКонтрагентуПунктуНазначенияСЛимитомБГ
	|		ПО ДанныеЗаказаКлиента.Контрагент = РезультатПоКонтрагентуПунктуНазначенияСЛимитомБГ.Контрагент";	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПараметровПоЗаказуКлиента()

	Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Организация КАК Организация,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.бг_ПунктНазначения КАК ПунктНазначения,
	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказКлиента.бг_КоличествоДнейОтсрочки КАК ОтсрочкаПлатежа,
	|	ЗаказКлиента.бг_ДатаОплатыСУчетомОтсрочки КАК ПлановаяДатаОплаты,
	|	ЗаказКлиента.Ссылка КАК ЗаказКлиента
	|ПОМЕСТИТЬ ДанныеЗаказаКлиента
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЗаказКлиентаСкидкиНаценки.Сумма) КАК СуммаСкидкиCRM,
	|	ЗаказКлиентаСкидкиНаценки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СкидкиПоЗаказу
	|ИЗ
	|	Документ.ЗаказКлиента.СкидкиНаценки КАК ЗаказКлиентаСкидкиНаценки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_ЗначенияДополнительныхКонстант КАК ЗначенияДополнительныхКонстант
	|		ПО ЗаказКлиентаСкидкиНаценки.СкидкаНаценка = ЗначенияДополнительныхКонстант.Значение
	|ГДЕ
	|	ЗаказКлиентаСкидкиНаценки.Ссылка = &ЗаказКлиента
	|	И ЗначенияДополнительныхКонстант.Константа = &Константа
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаСкидкиНаценки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗаказаКлиента.Организация КАК Организация,
	|	ДанныеЗаказаКлиента.Контрагент КАК Контрагент,
	|	ДанныеЗаказаКлиента.ПунктНазначения КАК ПунктНазначения,
	|	ДанныеЗаказаКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ДанныеЗаказаКлиента.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
	|	ДанныеЗаказаКлиента.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты,
	|	ДанныеЗаказаКлиента.ЗаказКлиента КАК ЗаказКлиента,
	|	ЕСТЬNULL(СкидкиПоЗаказу.СуммаСкидкиCRM, 0) КАК СуммаСкидкиCRM
	|ПОМЕСТИТЬ ДанныеЗаказаКлиентаССуммойСкидки
	|ИЗ
	|	ДанныеЗаказаКлиента КАК ДанныеЗаказаКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкидкиПоЗаказу КАК СкидкиПоЗаказу
	|		ПО ДанныеЗаказаКлиента.ЗаказКлиента = СкидкиПоЗаказу.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗаказаКлиентаССуммойСкидки.Организация КАК Организация,
	|	ДанныеЗаказаКлиентаССуммойСкидки.Контрагент КАК Контрагент,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ПунктНазначения КАК ПунктНазначения,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты,
	|	ДанныеЗаказаКлиентаССуммойСкидки.ЗаказКлиента КАК ЗаказКлиента,
	|	ДанныеЗаказаКлиентаССуммойСкидки.СуммаСкидкиCRM КАК СуммаСкидкиCRM
	|ИЗ
	|	ДанныеЗаказаКлиентаССуммойСкидки КАК ДанныеЗаказаКлиентаССуммойСкидки";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолученияОтгрузокИОплатЗаПериод()
	
	Текст = 
	"ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).бг_ПунктНазначения КАК ПунктНазначения,
	|	СУММА(РасчетыСКлиентамиПоСрокам.ДолгПриход) КАК Отгружено
	|ПОМЕСТИТЬ ОтгрузкиПоПунктамНазначения
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Обороты(
	|			&НачалоПериода,
	|			&ТекущаяДата,
	|			,
	|			РасчетныйДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
	|				И АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	|				И АналитикаУчетаПоПартнерам.Организация = &Организация) КАК РасчетыСКлиентамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).бг_ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплат.Организация КАК Организация,
	|	ТаблицаОплат.Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(ТаблицаОплат.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).бг_ПунктНазначения КАК ПунктНазначения,
	|	СУММА(ТаблицаОплат.Оплаты) КАК Оплаты
	|ПОМЕСТИТЬ ОплатыПоПунктамНазначения
	|ИЗ
	|	ТаблицаОплат КАК ТаблицаОплат
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОплат.Организация,
	|	ТаблицаОплат.Контрагент,
	|	ВЫРАЗИТЬ(ТаблицаОплат.РасчетныйДокумент КАК Документ.РеализацияТоваровУслуг).бг_ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкиПоПунктамНазначения.Контрагент КАК Контрагент,
	|	СУММА(ОтгрузкиПоПунктамНазначения.Отгружено) КАК Отгружено
	|ПОМЕСТИТЬ ОтгрузкиПоКонтрагенту
	|ИЗ
	|	ОтгрузкиПоПунктамНазначения КАК ОтгрузкиПоПунктамНазначения
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтгрузкиПоПунктамНазначения.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатыПоПунктамНазначения.Контрагент КАК Контрагент,
	|	СУММА(ОплатыПоПунктамНазначения.Оплаты) КАК Оплаты
	|ПОМЕСТИТЬ ОплатыПоКонтрагенту
	|ИЗ
	|	ОплатыПоПунктамНазначения КАК ОплатыПоПунктамНазначения
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыПоПунктамНазначения.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗаказаКлиента.Организация КАК Организация,
	|	ДанныеЗаказаКлиента.Контрагент КАК Контрагент,
	|	ДанныеЗаказаКлиента.ПунктНазначения КАК ПунктНазначения,
	|	ЕСТЬNULL(ОтгрузкиПоПунктамНазначения.Отгружено, 0) КАК Отгружено,
	|	ЕСТЬNULL(ОплатыПоПунктамНазначения.Оплаты, 0) КАК Оплаты
	|ПОМЕСТИТЬ ОплатыОтгрузкиПоПунктамНазначения
	|ИЗ
	|	ДанныеЗаказаКлиента КАК ДанныеЗаказаКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтгрузкиПоПунктамНазначения КАК ОтгрузкиПоПунктамНазначения
	|		ПО ДанныеЗаказаКлиента.Организация = ОтгрузкиПоПунктамНазначения.Организация
	|			И ДанныеЗаказаКлиента.Контрагент = ОтгрузкиПоПунктамНазначения.Контрагент
	|			И ДанныеЗаказаКлиента.ПунктНазначения = ОтгрузкиПоПунктамНазначения.ПунктНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатыПоПунктамНазначения КАК ОплатыПоПунктамНазначения
	|		ПО ДанныеЗаказаКлиента.Организация = ОплатыПоПунктамНазначения.Организация
	|			И ДанныеЗаказаКлиента.Контрагент = ОплатыПоПунктамНазначения.Контрагент
	|			И ДанныеЗаказаКлиента.ПунктНазначения = ОплатыПоПунктамНазначения.ПунктНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗаказаКлиента.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(ОтгрузкиПоКонтрагенту.Отгружено, 0) КАК Отгружено,
	|	ЕСТЬNULL(ОплатыПоКонтрагенту.Оплаты, 0) КАК Оплаты
	|ПОМЕСТИТЬ ОплатыОтгрузкиПоКонтрагенту
	|ИЗ
	|	ДанныеЗаказаКлиента КАК ДанныеЗаказаКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтгрузкиПоКонтрагенту КАК ОтгрузкиПоКонтрагенту
	|		ПО ДанныеЗаказаКлиента.Контрагент = ОтгрузкиПоКонтрагенту.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатыПоКонтрагенту КАК ОплатыПоКонтрагенту
	|		ПО ДанныеЗаказаКлиента.Контрагент = ОплатыПоКонтрагенту.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатыОтгрузкиПоПунктамНазначения.Организация КАК Организация,
	|	ОплатыОтгрузкиПоПунктамНазначения.Контрагент КАК Контрагент,
	|	ОплатыОтгрузкиПоПунктамНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ОплатыОтгрузкиПоПунктамНазначения.Отгружено КАК ОтгрузкиЗаМесяцПоПунктуНазначения,
	|	ОплатыОтгрузкиПоПунктамНазначения.Оплаты КАК ОплатыЗаПериодПоПунктуНазначения,
	|	ЕСТЬNULL(ОплатыОтгрузкиПоКонтрагенту.Оплаты, 0) КАК ОплатыЗаПериодПоКонтрагенту,
	|	ЕСТЬNULL(ОплатыОтгрузкиПоКонтрагенту.Отгружено, 0) КАК ОтгрузкиЗаМесяцПоКонтрагенту
	|ПОМЕСТИТЬ ОтгрузкиОплатыДляВторойЧастиОтчета
	|ИЗ
	|	ОплатыОтгрузкиПоПунктамНазначения КАК ОплатыОтгрузкиПоПунктамНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатыОтгрузкиПоКонтрагенту КАК ОплатыОтгрузкиПоКонтрагенту
	|		ПО ОплатыОтгрузкиПоПунктамНазначения.Контрагент = ОплатыОтгрузкиПоКонтрагенту.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкиОплатыДляВторойЧастиОтчета.Организация КАК Организация,
	|	ОтгрузкиОплатыДляВторойЧастиОтчета.Контрагент КАК Контрагент,
	|	ОтгрузкиОплатыДляВторойЧастиОтчета.ПунктНазначения КАК ПунктНазначения,
	|	ОтгрузкиОплатыДляВторойЧастиОтчета.ОтгрузкиЗаМесяцПоПунктуНазначения КАК ОтгрузкиЗаМесяцПоПунктуНазначения,
	|	ОтгрузкиОплатыДляВторойЧастиОтчета.ОплатыЗаПериодПоПунктуНазначения КАК ОплатыЗаПериодПоПунктуНазначения,
	|	ОтгрузкиОплатыДляВторойЧастиОтчета.ОплатыЗаПериодПоКонтрагенту КАК ОплатыЗаПериодПоКонтрагенту,
	|	ОтгрузкиОплатыДляВторойЧастиОтчета.ОтгрузкиЗаМесяцПоКонтрагенту КАК ОтгрузкиЗаМесяцПоКонтрагенту
	|ИЗ
	|	ОтгрузкиОплатыДляВторойЧастиОтчета КАК ОтгрузкиОплатыДляВторойЧастиОтчета";
	
	Возврат Текст;	
	
КонецФункции

Функция ТекстЗапросаДляПервойЧастиОтчетаСогласованиеСБСИтогами()

	Текст = 
	"ВЫБРАТЬ
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Организация КАК Организация,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Контрагент КАК Контрагент,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Договор КАК Договор,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ПунктНазначения КАК ПунктНазначения,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.НомерДокумента КАК НомерДокумента,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДатаДокумента КАК ДатаДокумента,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДатаВозникновения КАК ДатаВозникновения,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОДЗ КАК ОДЗ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ГлубинаПросрочки КАК ГлубинаПросрочки,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ПДЗ КАК ПДЗ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.КПП КАК КПП,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.КодТТSY КАК КодТТSY,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.До7 КАК До7,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От8До14 КАК От8До14,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От15До30 КАК От15До30,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От31До60 КАК От31До60,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От61До90 КАК От61До90,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От91До150 КАК От91До150,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От151До180 КАК От151До180,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От180До365 КАК От180До365,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От366До730 КАК От366До730,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.От731 КАК От731,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ТекущаяДЗ КАК ТекущаяДЗ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДатаОкончанияЛицензии КАК ДатаОкончанияЛицензии,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОкончаниеЛицензии30 КАК ОкончаниеЛицензии30,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Лицензия КАК Лицензия,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.КаналСбыта КАК КаналСбыта,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОкончаниеЛицензии60 КАК ОкончаниеЛицензии60,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОплатаЗаПериод КАК ОплатаЗаПериод,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДатаПоследнейОплаты КАК ДатаПоследнейОплаты,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОтгрузкиЗаПериод КАК ОтгрузкиЗаПериод,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.СВ КАК СВ,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.РЭК КАК РЭК,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.КодТП КАК КодТП,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДнейПросрочкиОплаты КАК ДнейПросрочкиОплаты,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.СрокПросрочки КАК СрокПросрочки,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.Менеджер КАК Менеджер,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.РезультатСогласованияКК КАК РезультатСогласованияКК,
	|	ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДСЗ КАК ДСЗ,
	|   ИтогоРезультатДляВыводаВПервойЧастиОтчета.РеальнаяПДЗ КАК РеальнаяПДЗ,
	|   ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОтсрочкаПлатежаБезУчетаКорректировки КАК ОтсрочкаПлатежаБезУчетаКорректировки,
	|   ИтогоРезультатДляВыводаВПервойЧастиОтчета.СуммаДокумента КАК СуммаДокумента,
	|   ИтогоРезультатДляВыводаВПервойЧастиОтчета.ОДЗ - ИтогоРезультатДляВыводаВПервойЧастиОтчета.ДСЗ КАК РазностьОДЗиДСЗ
	|ПОМЕСТИТЬ РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ
	|ИЗ
	|	&ТаблицаПослеРаспределенияДСЗ КАК ИтогоРезультатДляВыводаВПервойЧастиОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.Организация КАК Организация,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.Контрагент КАК Контрагент,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.Договор КАК Договор,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ПунктНазначения КАК ПунктНазначения,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.НомерДокумента КАК НомерДокумента,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ДатаДокумента КАК ДатаДокумента,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ДатаВозникновения КАК ДатаВозникновения,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ОДЗ КАК ОДЗ,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ГлубинаПросрочки КАК ГлубинаПросрочки,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ПДЗ КАК ПДЗ,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ПунктРазгрузки КАК ПунктРазгрузки,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.КПП КАК КПП,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.КодТТSY КАК КодТТSY,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.До7 КАК До7,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От8До14 КАК От8До14,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От15До30 КАК От15До30,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От31До60 КАК От31До60,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От61До90 КАК От61До90,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От91До150 КАК От91До150,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От151До180 КАК От151До180,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От180До365 КАК От180До365,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От366До730 КАК От366До730,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.От731 КАК От731,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ОтсрочкаПлатежа КАК ОтсрочкаПлатежа,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ТекущаяДЗ КАК ТекущаяДЗ,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ДатаОкончанияЛицензии КАК ДатаОкончанияЛицензии,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ОкончаниеЛицензии30 КАК ОкончаниеЛицензии30,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.Лицензия КАК Лицензия,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.КаналСбыта КАК КаналСбыта,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ОкончаниеЛицензии60 КАК ОкончаниеЛицензии60,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ОплатаЗаПериод КАК ОплатаЗаПериод,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ДатаПоследнейОплаты КАК ДатаПоследнейОплаты,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ОтгрузкиЗаПериод КАК ОтгрузкиЗаПериод,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.СВ КАК СВ,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.РЭК КАК РЭК,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.КодТП КАК КодТП,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ДнейПросрочкиОплаты КАК ДнейПросрочкиОплаты,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.СрокПросрочки КАК СрокПросрочки,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.Менеджер КАК Менеджер,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.РезультатСогласованияКК КАК РезультатСогласованияКК,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ДСЗ КАК ДСЗ,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.РеальнаяПДЗ КАК РеальнаяПДЗ,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.Контрагент.ИНН КАК ИНН,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.ОтсрочкаПлатежаБезУчетаКорректировки КАК ОтсрочкаПлатежаБезУчетаКорректировки,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.СуммаДокумента КАК СуммаДокумента,
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ.РазностьОДЗиДСЗ КАК РазностьОДЗиДСЗ 
	|ИЗ
	|	РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ КАК РезультатПоПервойЧастиОтчетаПослеРаспределенияДСЗ
	|ИТОГИ
	|	СУММА(ОДЗ),
	|	МАКСИМУМ(ГлубинаПросрочки),
	|	СУММА(ПДЗ),
	|	СУММА(До7),
	|	СУММА(От8До14),
	|	СУММА(От15До30),
	|	СУММА(От31До60),
	|	СУММА(От61До90),
	|	СУММА(От91До150),
	|	СУММА(От151До180),
	|	СУММА(От180До365),
	|	СУММА(От366До730),
	|	СУММА(От731),
	|	СУММА(ТекущаяДЗ),
	|	СУММА(ОплатаЗаПериод),
	|	СУММА(ОтгрузкиЗаПериод),
	|   СУММА(РеальнаяПДЗ),
	|	СУММА(ДСЗ),
	|	СУММА(РазностьОДЗиДСЗ)
	|ПО
	|	Контрагент";
	
	Возврат Текст;	
	
КонецФункции

Функция ТекстЗапросаКомментарииСБ()

	Возврат
	"ВЫБРАТЬ
	|	бг_КомментарииПоПунктамНазначения.Период КАК Период,
	|	бг_КомментарииПоПунктамНазначения.Источник КАК Источник,
	|	бг_КомментарииПоПунктамНазначения.Автор КАК Автор,
	|	бг_КомментарииПоПунктамНазначения.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.бг_КомментарииПоПунктамНазначения КАК бг_КомментарииПоПунктамНазначения
	|ГДЕ
	|	бг_КомментарииПоПунктамНазначения.ПунктНазначения = &ПунктНазначения";

КонецФункции


// Возвращает допустимую сумму задолженности
//
//
Функция ДСЗ(Контрагент, ЗаказКлиента)
	
	ДСЗ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СуммовыеСкидкиСрезПоследних.Контрагент КАК Контрагент,
		|	СУММА(ВЫБОР
		|			КОГДА СуммовыеСкидкиСрезПоследних.ДокументРезерва = &ЗаказКлиента
		|				ТОГДА СуммовыеСкидкиСрезПоследних.СуммаСкидки
		|			ИНАЧЕ СуммовыеСкидкиСрезПоследних.СуммаСкидки - СуммовыеСкидкиСрезПоследних.СуммаРезерва
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	РегистрСведений.бг_СуммовыеСкидки.СрезПоследних КАК СуммовыеСкидкиСрезПоследних
		|ГДЕ
		|	СуммовыеСкидкиСрезПоследних.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	СуммовыеСкидкиСрезПоследних.Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДСЗ = ДСЗ + ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
	Возврат ДСЗ;
	
КонецФункции

#КонецОбласти