
#Область ПроцедурыИФункцииЗаполненияСлужебныхРеквизитовПоНоменклатуре

&Вместо("ШаблонПоляВыборкиПоКлючуДействия")
Функция бг_ШаблонПоляВыборкиПоКлючуДействия(КлючДействия, ТолькоПроверитьПоддерживаемыеКлючи)
	
	Если КлючДействия = "бг_ЗаполнитьПризнакИспользоватьДатуПроизводстваСерии" Тогда
		Результат = ",
		|	втТаблицаНоменклатуры.%Ключ%.ВидНоменклатуры.ИспользоватьДатуПроизводстваСерии КАК %ЗначениеЗамены%";
	Иначе
		Результат = ПродолжитьВызов(КлючДействия, ТолькоПроверитьПоддерживаемыеКлючи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
