#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура бг_ЗаполнитьРегламентированныйОтчет(РегламентированныйОтчетОбъект) Экспорт
	ДанныеОтчета = РегламентированныйОтчетОбъект.ДанныеОтчета.Получить();
	
	ДанныеПриложение6 = бг_ДанныеПриложение6(РегламентированныйОтчетОбъект.Организация,
						РегламентированныйОтчетОбъект.ДатаНачала, КонецДня(РегламентированныйОтчетОбъект.ДатаОкончания));
	Если ДанныеПриложение6.Количество() > 0 Тогда
		бг_ЗаполнитьПриложение6(ДанныеОтчета, ДанныеПриложение6);
	КонецЕсли;
	
	ДанныеРаздел2 = бг_ДанныеРаздел2(РегламентированныйОтчетОбъект.Организация,
						РегламентированныйОтчетОбъект.ДатаНачала, КонецДня(РегламентированныйОтчетОбъект.ДатаОкончания));
	Если ДанныеРаздел2.Количество() > 0 Тогда
		бг_ЗаполнитьРаздел2(ДанныеОтчета, ДанныеРаздел2);
		бг_ЗаполнитьПриложение1(ДанныеОтчета, ДанныеРаздел2);
	КонецЕсли;
	
	РегламентированныйОтчетОбъект.ДанныеОтчета = Новый ХранилищеЗначения(ДанныеОтчета);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция бг_ДеревоДанныеРазделаПриложения(ДобавитьСтроку = Истина)
	ДеревоДанныеРаздела = Новый ДеревоЗначений;
	ДеревоДанныеРаздела.Колонки.Добавить("Данные");
	ДеревоДанныеРаздела.Колонки.Добавить("ДанныеМногострочныхЧастей");
	
	Если ДобавитьСтроку Тогда
		СтрокаДанныеРаздела = ДеревоДанныеРаздела.Строки.Добавить();
		СтрокаДанныеРаздела.ДанныеМногострочныхЧастей = Новый Структура;
		СтрокаДанныеРаздела.Данные = Новый Структура;
	КонецЕсли;
	
	Возврат ДеревоДанныеРаздела;
КонецФункции

Функция бг_ПараметрРегламентированногоОтчета(ИмяПоля, Формат = Неопределено)
	ПараметрРегламентированногоОтчета = Новый Структура;
	ПараметрРегламентированногоОтчета.Вставить("ИмяПоля", ИмяПоля);
	ПараметрРегламентированногоОтчета.Вставить("Значение", Неопределено);
	ПараметрРегламентированногоОтчета.Вставить("Формат", Формат);
	
	Возврат ПараметрРегламентированногоОтчета;
КонецФункции

Процедура бг_ЗаполнитьЗначениеПоляОтчета(ПолеОтчета, ВыборкаДанные)
	Ключ = ПолеОтчета.Ключ;
	Значение = ПолеОтчета.Значение;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДанные, Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	Значение.Значение = ВыборкаДанные[Ключ];
	Если Значение.Формат <> Неопределено Тогда
		Значение.Значение = Формат(Значение.Значение, Значение.Формат);
	КонецЕсли;
КонецПроцедуры

Процедура бг_ЗаполнитьПодраздел(СтрокаДеревоРаздела, КодПодраздела, ИмяПодраздела, ДанныеРаздела)
	
	СтрокаДеревоРаздела.ДанныеМногострочныхЧастей[КодПодраздела].Строки.Очистить();
	
	ДеревоДанныеРаздела = бг_ДеревоДанныеРазделаПриложения(Ложь);
	СтрокаДеревоРаздела.ДанныеМногострочныхЧастей.Вставить(КодПодраздела, ДеревоДанныеРаздела);
	Для Каждого СтрокаДанныеПодраздел Из ДанныеРаздела[ИмяПодраздела] Цикл
		СтрокаДанные = ДеревоДанныеРаздела.Строки.Добавить();
		СтрокаДанные.ДанныеМногострочныхЧастей = Новый Структура;
		СтрокаДанные.Данные = Новый Структура;
		
		Для Каждого ПолеПодРаздел Из СтрокаДанныеПодраздел Цикл
			СтрокаДанные.Данные.Вставить(ПолеПодРаздел.Значение.ИмяПоля, ПолеПодРаздел.Значение.Значение);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#Область Раздел2

Процедура бг_ЗаполнитьРаздел2(ДанныеОтчета, ДанныеРаздела)
	ДанныеРаздел2 = ДанныеОтчета.ДанныеМногоуровневыхРазделов.Раздел2;
	СтрокаДанныеРаздел = ДанныеРаздел2.Строки[0];
	
	// Раздел 2
	Если ДанныеРаздела.Свойство("Данные") Тогда
		ЗаполнитьЗначенияСвойств(СтрокаДанныеРаздел.Данные, ДанныеРаздела.Данные);
	КонецЕсли;

	// Раздел 2.1. Код раздела "П00021М1"
	бг_ЗаполнитьПодраздел(СтрокаДанныеРаздел, "П00021М1", "Раздел2_1", ДанныеРаздела);
	
	// Раздел 2.2. Код раздела "П00022М1"
	бг_ЗаполнитьПодраздел(СтрокаДанныеРаздел, "П00022М1", "Раздел2_2", ДанныеРаздела);
	
	// Раздел 2.3. Код раздела "П00023М1"
	бг_ЗаполнитьПодраздел(СтрокаДанныеРаздел, "П00023М1", "Раздел2_3", ДанныеРаздела);

	// Раздел 2.4.1 Код раздела "П00241М1"
	бг_ЗаполнитьПодраздел(СтрокаДанныеРаздел, "П00241М1", "Раздел2_4_1", ДанныеРаздела);
	
	// Раздел 2.4. 
	бг_ЗаполнитьРаздел2_4(СтрокаДанныеРаздел);
	
	// Раздел 2.5. 
	бг_ЗаполнитьПодраздел(СтрокаДанныеРаздел, "П00025М1", "Раздел2_5", ДанныеРаздела);
КонецПроцедуры

Процедура бг_ЗаполнитьРаздел2_4(СтрокаДанныеРаздел)
	АкцийНачисленный = 0;
	Для каждого Строка Из СтрокаДанныеРаздел.ДанныеМногострочныхЧастей.П00021М1.Строки Цикл
		АкцийНачисленный = АкцийНачисленный + Строка.Данные.П00021М100004;
	КонецЦикла;

	АкцийКВозмещению = 0;
	Для каждого Строка Из СтрокаДанныеРаздел.ДанныеМногострочныхЧастей.П00023М1.Строки Цикл
		АкцийКВозмещению = АкцийКВозмещению + Строка.Данные.П00023М100003;
	КонецЦикла;
	
	КодПоказателя2_4 = ?(АкцийНачисленный - АкцийКВозмещению >= 0, "40001", "40002");
	СтрокаДанныеРаздел.Данные.П000240000001 = КодПоказателя2_4;

КонецПроцедуры

Функция бг_ДанныеРаздел2(Организация, НачалоПериода, КонецПериода)
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеРаздел2 = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АкцизОбороты.Организация КАК Организация,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	АкцизОбороты.Продукция КАК Продукция,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	АкцизОбороты.СостояниеСырья КАК СостояниеСырья,
	|	АкцизОбороты.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	АкцизОбороты.СостояниеОплатыАванса.Период КАК Период,
	|	СУММА(АкцизОбороты.КоличествоПриход) КАК Количество
	|ПОМЕСТИТЬ НачисленныеВычеты
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И СостояниеОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.ОформленВычет)
	|				И НЕ СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции)) КАК АкцизОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(АкцизОбороты.Регистратор) = ТИП(Документ.битРасчетАвансовПоАкцизам)
	|СГРУППИРОВАТЬ ПО
	|	АкцизОбороты.Организация,
	|	АкцизОбороты.Номенклатура,
	|	АкцизОбороты.Продукция,
	|	АкцизОбороты.СтатусАкциза,
	|	АкцизОбороты.СостояниеСырья,
	|	АкцизОбороты.СостояниеОплатыАванса,
	|	АкцизОбороты.СостояниеОплатыАванса.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизОбороты.Организация КАК Организация,
	|	АкцизОбороты.Продукция КАК Номенклатура,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	АкцизОбороты.СостояниеСырья КАК СостояниеСырья,
	|	АкцизОбороты.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	АкцизОбороты.ДатаРеализации КАК ДатаРеализации,
	|	АкцизОбороты.КоличествоПриход КАК Количество
	|ПОМЕСТИТЬ ПодтвержденныеРеализации
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И СостояниеСырья В (&СостояниеСырьяПодтвержденЭкспорт)) КАК АкцизОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(АкцизОбороты.Регистратор) = ТИП(Документ.битОперацияУчетаАкциза)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизОбороты.Организация КАК Организация,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	АкцизОбороты.Продукция КАК Продукция,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	АкцизОбороты.СостояниеСырья КАК СостояниеСырья,
	|	АкцизОбороты.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	АкцизОбороты.КоличествоПриход КАК Количество
	|ПОМЕСТИТЬ НачисленныеАвансы
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И (СостояниеОплатыАванса.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И СостояниеОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.НачисленАванс)
	|				И СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизВСырье)) КАК АкцизОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизОбороты.Организация КАК Организация,
	|	АкцизОбороты.Продукция КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ПустаяСсылка) КАК СтатусАкциза,
	|	АкцизОбороты.СостояниеСырья КАК СостояниеСырья,
	|	ЗНАЧЕНИЕ(Справочник.бг_СостоянияОплатыАванса.ПустаяСсылка) КАК СостояниеОплатыАванса,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья В (&СостоянияСырьяВОжиданииПодтвержденияЭкспорта)
	|			ТОГДА 0
	|		ИНАЧЕ АкцизОбороты.КоличествоПриход
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья В (&СостоянияСырьяВОжиданииПодтвержденияЭкспорта)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЭкспорт
	|ПОМЕСТИТЬ РеализованнаяПродукция
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И СостояниеСырья В (&СостоянияСырьяАкцизКОплате)
	|				И Продукция <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК АкцизОбороты
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(АкцизОбороты.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг)
	|			ИЛИ ТИПЗНАЧЕНИЯ(АкцизОбороты.Регистратор) = ТИП(Документ.КорректировкаРеализации)
	|			ИЛИ ТИПЗНАЧЕНИЯ(АкцизОбороты.Регистратор) = ТИП(Документ.ВнутреннееПотреблениеТоваров))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленныеВычеты.Организация КАК Организация,
	|	НачисленныеВычеты.Номенклатура КАК Номенклатура,
	|	НачисленныеВычеты.СтатусАкциза КАК СтатусАкциза,
	|	НачисленныеВычеты.СостояниеСырья КАК СостояниеСырья,
	|	НачисленныеВычеты.СостояниеОплатыАванса КАК СостояниеОплатыАванса
	|ПОМЕСТИТЬ ДанныеРасчетОперацииНалогобложения
	|ИЗ
	|	НачисленныеВычеты КАК НачисленныеВычеты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПодтвержденныеРеализации.Организация,
	|	ПодтвержденныеРеализации.Номенклатура,
	|	ПодтвержденныеРеализации.СтатусАкциза,
	|	ПодтвержденныеРеализации.СостояниеСырья,
	|	ПодтвержденныеРеализации.СостояниеОплатыАванса
	|ИЗ
	|	ПодтвержденныеРеализации КАК ПодтвержденныеРеализации
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеализованнаяПродукция.Организация,
	|	РеализованнаяПродукция.Номенклатура,
	|	РеализованнаяПродукция.СтатусАкциза,
	|	РеализованнаяПродукция.СостояниеСырья,
	|	РеализованнаяПродукция.СостояниеОплатыАванса
	|ИЗ
	|	РеализованнаяПродукция КАК РеализованнаяПродукция
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НачисленныеАвансы.Организация,
	|	НачисленныеАвансы.Номенклатура,
	|	НачисленныеАвансы.СтатусАкциза,
	|	НачисленныеАвансы.СостояниеСырья,
	|	НачисленныеАвансы.СостояниеОплатыАванса
	|ИЗ
	|	НачисленныеАвансы КАК НачисленныеАвансы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтатусАкциза,
	|	СостояниеСырья,
	|	СостояниеОплатыАванса,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров КАК ВидПодакцизныхТоваров,
	|	КодыВидовОперацийНалогообложения.КБК КАК КБК
	|ПОМЕСТИТЬ ВидыПодакцизныхТоваров
	|ИЗ
	|	РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом.СрезПоследних(
	|			&КонецПериода,
	|			ВидОперацииНалогообложенияАкцизом В
	|				(ВЫБРАТЬ
	|					ДанныеРасчетОперацииНалогобложения.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложения
	|				ИЗ
	|					ДанныеРасчетОперацииНалогобложения КАК ДанныеРасчетОперацииНалогобложения)) КАК КодыВидовОперацийНалогообложения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	ДанныеРасчетОперацииНалогобложения.Организация КАК Организация,
	|	ДанныеРасчетОперацииНалогобложения.Номенклатура КАК Номенклатура,
	|	ДанныеРасчетОперацииНалогобложения.СтатусАкциза КАК СтатусАкциза,
	|	ДанныеРасчетОперацииНалогобложения.СостояниеСырья КАК СостояниеСырья,
	|	ДанныеРасчетОперацииНалогобложения.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения КАК ВидОперацииНалогообложения,
	|	НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения.КодОбъектаНалогообложения.Код КАК КодОперацииНалогообложения
	|ПОМЕСТИТЬ КодыОперацийНалогобложенияПредварительно
	|ИЗ
	|	ДанныеРасчетОперацииНалогобложения КАК ДанныеРасчетОперацииНалогобложения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_НалогообложениеАкцизомОрганизаций КАК НалогообложениеАкцизомОрганизаций
	|		ПО ДанныеРасчетОперацииНалогобложения.Организация = НалогообложениеАкцизомОрганизаций.Организация
	|			И ДанныеРасчетОперацииНалогобложения.СтатусАкциза = НалогообложениеАкцизомОрганизаций.СтатусАкциза
	|			И ДанныеРасчетОперацииНалогобложения.СостояниеСырья = НалогообложениеАкцизомОрганизаций.СостояниеСырья
	|			И ДанныеРасчетОперацииНалогобложения.Номенклатура = НалогообложениеАкцизомОрганизаций.Номенклатура
	|			И (ДанныеРасчетОперацииНалогобложения.СостояниеОплатыАванса = ЗНАЧЕНИЕ(Справочник.бг_СостоянияОплатыАванса.ПустаяСсылка)
	|				ИЛИ ДанныеРасчетОперацииНалогобложения.СостояниеОплатыАванса.Статус = НалогообложениеАкцизомОрганизаций.СтатусНачисленияАванса
	|				И ДанныеРасчетОперацииНалогобложения.СостояниеОплатыАванса.ПродажаНаЭкспорт = НалогообложениеАкцизомОрганизаций.ПродажаНаЭкспорт)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеРасчетОперацииНалогобложения.Организация,
	|	ДанныеРасчетОперацииНалогобложения.Номенклатура,
	|	ДанныеРасчетОперацииНалогобложения.СтатусАкциза,
	|	ДанныеРасчетОперацииНалогобложения.СостояниеСырья,
	|	ДанныеРасчетОперацииНалогобложения.СостояниеОплатыАванса,
	|	НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения,
	|	НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения.КодОбъектаНалогообложения.Код
	|ИЗ
	|	ДанныеРасчетОперацииНалогобложения КАК ДанныеРасчетОперацииНалогобложения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_НалогообложениеАкцизомОрганизаций КАК НалогообложениеАкцизомОрганизаций
	|		ПО ДанныеРасчетОперацииНалогобложения.Организация = НалогообложениеАкцизомОрганизаций.Организация
	|			И ДанныеРасчетОперацииНалогобложения.СтатусАкциза = НалогообложениеАкцизомОрганизаций.СтатусАкциза
	|			И ДанныеРасчетОперацииНалогобложения.СостояниеСырья = НалогообложениеАкцизомОрганизаций.СостояниеСырья
	|			И ДанныеРасчетОперацииНалогобложения.Номенклатура.ВидНоменклатуры = НалогообложениеАкцизомОрганизаций.Номенклатура
	|			И (ДанныеРасчетОперацииНалогобложения.СостояниеОплатыАванса = ЗНАЧЕНИЕ(Справочник.бг_СостоянияОплатыАванса.ПустаяСсылка)
	|				ИЛИ ДанныеРасчетОперацииНалогобложения.СостояниеОплатыАванса.Статус = НалогообложениеАкцизомОрганизаций.СтатусНачисленияАванса
	|				И ДанныеРасчетОперацииНалогобложения.СостояниеОплатыАванса.ПродажаНаЭкспорт = НалогообложениеАкцизомОрганизаций.ПродажаНаЭкспорт)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	СтатусАкциза,
	|	СостояниеСырья,
	|	СостояниеОплатыАванса,
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыОперацийНалогобложенияПредварительно.Организация КАК Организация,
	|	КодыОперацийНалогобложенияПредварительно.Номенклатура КАК Номенклатура,
	|	КодыОперацийНалогобложенияПредварительно.СтатусАкциза КАК СтатусАкциза,
	|	КодыОперацийНалогобложенияПредварительно.СостояниеСырья КАК СостояниеСырья,
	|	КодыОперацийНалогобложенияПредварительно.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	МИНИМУМ(КодыОперацийНалогобложенияПредварительно.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ КодыОперацийНалогобложенияПриоритеты
	|ИЗ
	|	КодыОперацийНалогобложенияПредварительно КАК КодыОперацийНалогобложенияПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыОперацийНалогобложенияПредварительно.Организация,
	|	КодыОперацийНалогобложенияПредварительно.Номенклатура,
	|	КодыОперацийНалогобложенияПредварительно.СтатусАкциза,
	|	КодыОперацийНалогобложенияПредварительно.СостояниеСырья,
	|	КодыОперацийНалогобложенияПредварительно.СостояниеОплатыАванса
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	СтатусАкциза,
	|	СостояниеСырья,
	|	СостояниеОплатыАванса,
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КодыОперацийНалогобложенияПриоритеты.Организация КАК Организация,
	|	КодыОперацийНалогобложенияПриоритеты.Номенклатура КАК Номенклатура,
	|	КодыОперацийНалогобложенияПриоритеты.СтатусАкциза КАК СтатусАкциза,
	|	КодыОперацийНалогобложенияПриоритеты.СостояниеСырья КАК СостояниеСырья,
	|	КодыОперацийНалогобложенияПриоритеты.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	КодыОперацийНалогобложенияПредварительно.ВидОперацииНалогообложения КАК ВидОперацииНалогообложения,
	|	КодыОперацийНалогобложенияПредварительно.КодОперацииНалогообложения КАК КодОперацииНалогообложения
	|ПОМЕСТИТЬ КодыОперацийНалогобложения
	|ИЗ
	|	КодыОперацийНалогобложенияПриоритеты КАК КодыОперацийНалогобложенияПриоритеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодыОперацийНалогобложенияПредварительно КАК КодыОперацийНалогобложенияПредварительно
	|		ПО КодыОперацийНалогобложенияПриоритеты.Организация = КодыОперацийНалогобложенияПредварительно.Организация
	|			И КодыОперацийНалогобложенияПриоритеты.Номенклатура = КодыОперацийНалогобложенияПредварительно.Номенклатура
	|			И КодыОперацийНалогобложенияПриоритеты.СтатусАкциза = КодыОперацийНалогобложенияПредварительно.СтатусАкциза
	|			И КодыОперацийНалогобложенияПриоритеты.СостояниеСырья = КодыОперацийНалогобложенияПредварительно.СостояниеСырья
	|			И КодыОперацийНалогобложенияПриоритеты.СостояниеОплатыАванса = КодыОперацийНалогобложенияПредварительно.СостояниеОплатыАванса
	|			И КодыОперацийНалогобложенияПриоритеты.Приоритет = КодыОперацийНалогобложенияПредварительно.Приоритет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	СтатусАкциза,
	|	СостояниеСырья,
	|	СостояниеОплатыАванса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КодыОперацийНалогобложения.КодОперацииНалогообложения, """") КАК КодПоказателя,
	|	РеализованнаяПродукция.Номенклатура КАК Номенклатура,
	|	4 КАК Признак_2_1,
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(РеализованнаяПродукция.Номенклатура.Крепость, 0) = 0
	|					ИЛИ ЕСТЬNULL(РеализованнаяПродукция.Номенклатура.ОбъемДАЛ, 0) = 0
	|				ТОГДА РеализованнаяПродукция.Количество * 10
	|			ИНАЧЕ (ВЫРАЗИТЬ(РеализованнаяПродукция.Количество / РеализованнаяПродукция.Номенклатура.Крепость * 100 / РеализованнаяПродукция.Номенклатура.ОбъемДАЛ КАК ЧИСЛО(15, 0))) * РеализованнаяПродукция.Номенклатура.ОбъемДАЛ * РеализованнаяПродукция.Номенклатура.Крепость / 10
	|		КОНЕЦ КАК НалоговаяБаза,
	|	ЕСТЬNULL(ВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0)КАК НалоговаяСтавка
	|ПОМЕСТИТЬ ДанныеРеализованнаяПродукция
	|ИЗ
	|	РеализованнаяПродукция КАК РеализованнаяПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОперацийНалогобложения КАК КодыОперацийНалогобложения
	|		ПО РеализованнаяПродукция.Организация = КодыОперацийНалогобложения.Организация
	|			И РеализованнаяПродукция.Номенклатура = КодыОперацийНалогобложения.Номенклатура
	|			И РеализованнаяПродукция.СтатусАкциза = КодыОперацийНалогобложения.СтатусАкциза
	|			И РеализованнаяПродукция.СостояниеСырья = КодыОперацийНалогобложения.СостояниеСырья
	|			И РеализованнаяПродукция.СостояниеОплатыАванса = КодыОперацийНалогобложения.СостояниеОплатыАванса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыПодакцизныхТоваров КАК ВидыПодакцизныхТоваров
	|		ПО РеализованнаяПродукция.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом = ВидыПодакцизныхТоваров.ВидОперацииНалогообложенияАкцизом
	|ГДЕ
	|	РеализованнаяПродукция.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КодыОперацийНалогобложения.КодОперацииНалогообложения, """") КАК КодПоказателя,
	|	РеализованнаяПродукция.Номенклатура КАК Номенклатура,
	|	4 КАК Признак_2_2,
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(РеализованнаяПродукция.Номенклатура.Крепость, 0) = 0
	|					ИЛИ ЕСТЬNULL(РеализованнаяПродукция.Номенклатура.ОбъемДАЛ, 0) = 0
	|				ТОГДА РеализованнаяПродукция.КоличествоЭкспорт * 10
	|			ИНАЧЕ (ВЫРАЗИТЬ(РеализованнаяПродукция.КоличествоЭкспорт / РеализованнаяПродукция.Номенклатура.Крепость * 100 / РеализованнаяПродукция.Номенклатура.ОбъемДАЛ КАК ЧИСЛО(15, 0))) * РеализованнаяПродукция.Номенклатура.ОбъемДАЛ * РеализованнаяПродукция.Номенклатура.Крепость / 10
	|		КОНЕЦ КАК НалоговаяБаза,
	|	ЕСТЬNULL(ВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0)КАК НалоговаяСтавка
	|ПОМЕСТИТЬ ДанныеРеализованнаяПродукцияЭкспорт
	|ИЗ
	|	РеализованнаяПродукция КАК РеализованнаяПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОперацийНалогобложения КАК КодыОперацийНалогобложения
	|		ПО РеализованнаяПродукция.Организация = КодыОперацийНалогобложения.Организация
	|			И РеализованнаяПродукция.Номенклатура = КодыОперацийНалогобложения.Номенклатура
	|			И РеализованнаяПродукция.СтатусАкциза = КодыОперацийНалогобложения.СтатусАкциза
	|			И РеализованнаяПродукция.СостояниеСырья = КодыОперацийНалогобложения.СостояниеСырья
	|			И РеализованнаяПродукция.СостояниеОплатыАванса = КодыОперацийНалогобложения.СостояниеОплатыАванса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыПодакцизныхТоваров КАК ВидыПодакцизныхТоваров
	|		ПО РеализованнаяПродукция.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом = ВидыПодакцизныхТоваров.ВидОперацииНалогообложенияАкцизом
	|ГДЕ
	|	РеализованнаяПродукция.КоличествоЭкспорт <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КодыОперацийНалогобложения.КодОперацииНалогообложения, """") КАК КодПоказателя,
	|	НачисленныеВычеты.Номенклатура КАК Номенклатура,
	|	НачисленныеВычеты.Продукция КАК Продукция,
	|	НачисленныеВычеты.Период КАК Период,
	|	СУММА(НачисленныеВычеты.Количество * 10) КАК ОбъемПодакцизногоТовара,
	|	СУММА(НачисленныеВычеты.Количество * НачисленныеВычеты.СостояниеОплатыАванса.НалоговаяСтавка * 10) КАК СуммаАкциза
	|ПОМЕСТИТЬ ДанныеНачисленныеВычеты
	|ИЗ
	|	НачисленныеВычеты КАК НачисленныеВычеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОперацийНалогобложения КАК КодыОперацийНалогобложения
	|		ПО НачисленныеВычеты.Организация = КодыОперацийНалогобложения.Организация
	|			И НачисленныеВычеты.Номенклатура = КодыОперацийНалогобложения.Номенклатура
	|			И НачисленныеВычеты.СтатусАкциза = КодыОперацийНалогобложения.СтатусАкциза
	|			И НачисленныеВычеты.СостояниеСырья = КодыОперацийНалогобложения.СостояниеСырья
	|			И НачисленныеВычеты.СостояниеОплатыАванса = КодыОперацийНалогобложения.СостояниеОплатыАванса
	|ГДЕ
	|	НЕ НачисленныеВычеты.СостояниеОплатыАванса.НалоговаяСтавка IS NULL
	|
	|СГРУППИРОВАТЬ ПО 	
	|	ЕСТЬNULL(КодыОперацийНалогобложения.КодОперацииНалогообложения, """"),
	|	НачисленныеВычеты.Номенклатура,
	|	НачисленныеВычеты.Продукция,
	|	НачисленныеВычеты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КодыОперацийНалогобложения.КодОперацииНалогообложения, """") КАК КодПоказателя,
	|	ПодтвержденныеРеализации.Номенклатура КАК Номенклатура,
	|	НАЧАЛОПЕРИОДА(ПодтвержденныеРеализации.ДатаРеализации, МЕСЯЦ) КАК НалоговыйПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ПодтвержденныеРеализации.ДатаРеализации, МЕСЯЦ) КАК НалоговыйПериодГод,
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(ПодтвержденныеРеализации.Номенклатура.Крепость, 0) = 0
	|					ИЛИ ЕСТЬNULL(ПодтвержденныеРеализации.Номенклатура.ОбъемДАЛ, 0) = 0
	|				ТОГДА ПодтвержденныеРеализации.Количество * 10
	|			ИНАЧЕ (ВЫРАЗИТЬ(ПодтвержденныеРеализации.Количество / ПодтвержденныеРеализации.Номенклатура.Крепость * 100 / ПодтвержденныеРеализации.Номенклатура.ОбъемДАЛ КАК ЧИСЛО(15, 0))) * ПодтвержденныеРеализации.Номенклатура.ОбъемДАЛ * ПодтвержденныеРеализации.Номенклатура.Крепость / 10
	|		КОНЕЦ КАК НалоговаяБаза,
	|	ЕСТЬNULL(бг_КодыВидовОперацийНалогообложенияАкцизом.ВидПодакцизныхТоваров.НалоговаяСтавка, 0) КАК НалоговаяСтавка
	|ПОМЕСТИТЬ ДанныеПодтвержденныеРеализации
	|ИЗ
	|	ПодтвержденныеРеализации КАК ПодтвержденныеРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОперацийНалогобложения КАК КодыОперацийНалогобложения
	|		ПО ПодтвержденныеРеализации.Организация = КодыОперацийНалогобложения.Организация
	|			И ПодтвержденныеРеализации.Номенклатура = КодыОперацийНалогобложения.Номенклатура
	|			И ПодтвержденныеРеализации.СтатусАкциза = КодыОперацийНалогобложения.СтатусАкциза
	|			И ПодтвержденныеРеализации.СостояниеСырья = КодыОперацийНалогобложения.СостояниеСырья
	|			И ПодтвержденныеРеализации.СостояниеОплатыАванса = КодыОперацийНалогобложения.СостояниеОплатыАванса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК бг_КодыВидовОперацийНалогообложенияАкцизом
	|		ПО ПодтвержденныеРеализации.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом = бг_КодыВидовОперацийНалогообложенияАкцизом.ВидОперацииНалогообложенияАкцизом
	|			И (бг_КодыВидовОперацийНалогообложенияАкцизом.Период В
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(бг_КодыВидовОперацийНалогообложенияАкцизомПериод.Период)
	|				ИЗ
	|					РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК бг_КодыВидовОперацийНалогообложенияАкцизомПериод
	|				ГДЕ
	|					ПодтвержденныеРеализации.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом = бг_КодыВидовОперацийНалогообложенияАкцизомПериод.ВидОперацииНалогообложенияАкцизом
	|					И бг_КодыВидовОперацийНалогообложенияАкцизомПериод.Период <= ПодтвержденныеРеализации.ДатаРеализации))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&КонецПериода КАК ПериодМесяц,
	|	&КонецПериода КАК ПериодГод,
	|	ДанныеРеализованнаяПродукция.КодПоказателя КАК КодПоказателя,
	|	ДанныеРеализованнаяПродукция.Номенклатура КАК Номенклатура,
	|	ДанныеРеализованнаяПродукция.НалоговаяБаза КАК НалоговаяБаза
	|ПОМЕСТИТЬ ДанныеПредварительно
	|ИЗ
	|	ДанныеРеализованнаяПродукция КАК ДанныеРеализованнаяПродукция
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&КонецПериода,
	|	&КонецПериода,
	|	ДанныеРеализованнаяПродукцияЭкспорт.КодПоказателя,
	|	ДанныеРеализованнаяПродукцияЭкспорт.Номенклатура,
	|	ДанныеРеализованнаяПродукцияЭкспорт.НалоговаяБаза
	|ИЗ
	|	ДанныеРеализованнаяПродукцияЭкспорт КАК ДанныеРеализованнаяПродукцияЭкспорт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеНачисленныеВычеты.Период,
	|	ДанныеНачисленныеВычеты.Период,
	|	ДанныеНачисленныеВычеты.КодПоказателя,
	|	ДанныеНачисленныеВычеты.Продукция,
	|	ДанныеНачисленныеВычеты.ОбъемПодакцизногоТовара
	|ИЗ
	|	ДанныеНачисленныеВычеты КАК ДанныеНачисленныеВычеты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеПодтвержденныеРеализации.НалоговыйПериодМесяц,
	|	ДанныеПодтвержденныеРеализации.НалоговыйПериодГод,
	|	ДанныеПодтвержденныеРеализации.КодПоказателя,
	|	ДанныеПодтвержденныеРеализации.Номенклатура,
	|	ДанныеПодтвержденныеРеализации.НалоговаяБаза
	|ИЗ
	|	ДанныеПодтвержденныеРеализации КАК ДанныеПодтвержденныеРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПредварительно.ПериодМесяц КАК ПериодМесяц,
	|	ДанныеПредварительно.ПериодГод КАК ПериодГод,
	|	ДанныеПредварительно.КодПоказателя КАК КодПоказателя,
	|	ДанныеПредварительно.Номенклатура КАК Номенклатура,
	|	СУММА(ДанныеПредварительно.НалоговаяБаза) КАК НалоговаяБаза
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	ДанныеПредварительно КАК ДанныеПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПредварительно.ПериодМесяц,
	|	ДанныеПредварительно.ПериодГод,
	|	ДанныеПредварительно.КодПоказателя,
	|	ДанныеПредварительно.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Раздел 2
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров.Код КАК П000020001003,
	|	КодыВидовОперацийНалогообложения.КБК КАК П000020002003
	|ИЗ
	|	РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом.СрезПоследних(
	|			&КонецПериода,
	|			ВидОперацииНалогообложенияАкцизом В
	|				(ВЫБРАТЬ
	|					РеализованнаяПродукция.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложения
	|				ИЗ
	|					РеализованнаяПродукция КАК РеализованнаяПродукция)) КАК КодыВидовОперацийНалогообложения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Раздел 2_1
	|ВЫБРАТЬ
	|	ДанныеРеализованнаяПродукция.КодПоказателя КАК КодПоказателя,
	|	ДанныеРеализованнаяПродукция.Признак_2_1 КАК Признак_2_1,
	|	СУММА(ДанныеРеализованнаяПродукция.НалоговаяБаза) КАК НалоговаяБаза_2_1,
	|	СУММА(ДанныеРеализованнаяПродукция.НалоговаяБаза * ДанныеРеализованнаяПродукция.НалоговаяСтавка) КАК Сумма_2_1
	|ИЗ
	|	ДанныеРеализованнаяПродукция КАК ДанныеРеализованнаяПродукция
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРеализованнаяПродукция.КодПоказателя,
	|	ДанныеРеализованнаяПродукция.Признак_2_1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Раздел 2_2
	|ВЫБРАТЬ
	|	ДанныеРеализованнаяПродукцияЭкспорт.КодПоказателя КАК КодПоказателя,
	|	ДанныеРеализованнаяПродукцияЭкспорт.Признак_2_2 КАК Признак_2_2,
	|	СУММА(ДанныеРеализованнаяПродукцияЭкспорт.НалоговаяБаза) КАК НалоговаяБаза_2_2,
	|	СУММА(ДанныеРеализованнаяПродукцияЭкспорт.НалоговаяБаза * ДанныеРеализованнаяПродукцияЭкспорт.НалоговаяСтавка) КАК Сумма_2_2
	|ИЗ
	|	ДанныеРеализованнаяПродукцияЭкспорт КАК ДанныеРеализованнаяПродукцияЭкспорт
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРеализованнаяПродукцияЭкспорт.КодПоказателя,
	|	ДанныеРеализованнаяПродукцияЭкспорт.Признак_2_2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Раздел 2_3
	|ВЫБРАТЬ
	|	ДанныеНачисленныеВычеты.КодПоказателя КАК КодПоказателя,
	|	ДанныеНачисленныеВычеты.Период КАК НалоговыйПериодМесяц,
	|	ДанныеНачисленныеВычеты.Период КАК НалоговыйПериодГод,
	|	СУММА(ДанныеНачисленныеВычеты.ОбъемПодакцизногоТовара) КАК ОбъемПодакцизногоТовара,
	|	СУММА(ДанныеНачисленныеВычеты.СуммаАкциза) КАК СуммаАкциза
	|ИЗ
	|	ДанныеНачисленныеВычеты КАК ДанныеНачисленныеВычеты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеНачисленныеВычеты.КодПоказателя,
	|	ДанныеНачисленныеВычеты.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодПоказателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Раздел 2_4
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КодыОперацийНалогобложения.КодОперацииНалогообложения, """") КАК КодПоказателя,
	|	КодыОперацийНалогобложения.ВидОперацииНалогообложения КАК ВидОперацииНалогообложения,
	|	СУММА(НачисленныеАвансы.Количество * СостоянияОплатыАванса.НалоговаяСтавка * 10) КАК СуммаАкциза
	|ИЗ
	|	НачисленныеАвансы КАК НачисленныеАвансы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_СостоянияОплатыАванса КАК СостоянияОплатыАванса
	|		ПО НачисленныеАвансы.СостояниеОплатыАванса = СостоянияОплатыАванса.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОперацийНалогобложения КАК КодыОперацийНалогобложения
	|		ПО НачисленныеАвансы.Организация = КодыОперацийНалогобложения.Организация
	|			И НачисленныеАвансы.Номенклатура = КодыОперацийНалогобложения.Номенклатура
	|			И НачисленныеАвансы.СтатусАкциза = КодыОперацийНалогобложения.СтатусАкциза
	|			И НачисленныеАвансы.СостояниеСырья = КодыОперацийНалогобложения.СостояниеСырья
	|			И НачисленныеАвансы.СостояниеОплатыАванса = КодыОперацийНалогобложения.СостояниеОплатыАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыОперацийНалогобложения.ВидОперацииНалогообложения,
	|	ЕСТЬNULL(КодыОперацийНалогобложения.КодОперацииНалогообложения, """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Раздел 2_5
	|ВЫБРАТЬ
	|	ДанныеПодтвержденныеРеализации.КодПоказателя КАК КодПоказателя,
	|	ДанныеПодтвержденныеРеализации.НалоговыйПериодМесяц КАК НалоговыйПериодМесяц,
	|	ДанныеПодтвержденныеРеализации.НалоговыйПериодГод КАК НалоговыйПериодГод,
	|	СУММА(ДанныеПодтвержденныеРеализации.НалоговаяБаза) КАК ОбъемПодакцизногоТовара,
	|	СУММА(ДанныеПодтвержденныеРеализации.НалоговаяБаза * ДанныеПодтвержденныеРеализации.НалоговаяСтавка) КАК СуммаАкциза
	|ИЗ
	|	ДанныеПодтвержденныеРеализации КАК ДанныеПодтвержденныеРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПодтвержденныеРеализации.КодПоказателя,
	|	ДанныеПодтвержденныеРеализации.НалоговыйПериодМесяц,
	|	ДанныеПодтвержденныеРеализации.НалоговыйПериодГод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Приложение 1
	|ВЫБРАТЬ
	|	Данные.КодПоказателя КАК КодПоказателя,
	|	Данные.ПериодМесяц КАК ПериодМесяц,
	|	Данные.ПериодГод КАК ПериодГод,
	|	4 КАК Признак_Приложение1,
	|	ЕСТЬNULL(Данные.Номенклатура.Крепость, &КрепостьПриСписанииСпирта) КАК НоменклатураКрепость,
	|	СУММА(ВЫБОР
	// это списание спирта
	|			КОГДА Данные.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ТОГДА Данные.НалоговаяБаза / &КрепостьПриСписанииСпирта * 100
	// далее продукция
	|			КОГДА ЕСТЬNULL(Данные.Номенклатура.Крепость, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ Данные.НалоговаяБаза / Данные.Номенклатура.Крепость * 100
	|		КОНЕЦ) КАК ОбъемПодакцизногоТовара,
	|	СУММА(Данные.НалоговаяБаза) КАК ОбъемПодакцизногоТовараБезводный
	|ИЗ
	|	Данные КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.ПериодМесяц,
	|	Данные.ПериодГод,
	|	Данные.КодПоказателя,
	|	ЕСТЬNULL(Данные.Номенклатура.Крепость, &КрепостьПриСписанииСпирта)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодПоказателя,
	|	ПериодМесяц";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("КрепостьПриСписанииСпирта", 40);
	
	СостоянияСырьяАкцизКОплате = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырьяАкцизКОплате,
			Перечисления.бг_СостоянияПодакцизногоСырья.СостоянияСырьяВОжиданииПодтвержденияЭкспорта());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырьяАкцизКОплате,
			Перечисления.бг_СостоянияПодакцизногоСырья.СостоянияСырьяВыполненоСписание());
	СостоянияСырьяАкцизКОплате.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции);
	
	Запрос.УстановитьПараметр("СостоянияСырьяАкцизКОплате", СостоянияСырьяАкцизКОплате);

	Запрос.УстановитьПараметр("СостоянияСырьяВОжиданииПодтвержденияЭкспорта",
			Перечисления.бг_СостоянияПодакцизногоСырья.СостоянияСырьяВОжиданииПодтвержденияЭкспорта());
	
	Запрос.УстановитьПараметр("СостояниеСырьяПодтвержденЭкспорт", Перечисления.бг_СостоянияПодакцизногоСырья.СостоянияСырьяВРеализованнойПродукцииПодтвержденоЭкспорт());
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Приложение 1
	ТаблицаДанныхРаздел2 = Результат[Результат.ВГраница() - 6].Выгрузить();
	Если ТаблицаДанныхРаздел2.Количество() > 0 Тогда
		ДанныеРаздел2.Вставить("Данные", ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныхРаздел2[0]));
	КонецЕсли;

	// Раздел 2_1
	Выборка = Результат[Результат.ВГраница() - 5].Выбрать();
	ПоляПодРаздела2_1 = бг_ПоляРаздела2_1();
	бг_ЗаполнитьДанныеПодраздела(ДанныеРаздел2, "Раздел2_1", ПоляПодРаздела2_1, Выборка);
	
	// Раздел 2_2
	Выборка = Результат[Результат.ВГраница() - 4].Выбрать();
	ПоляПодРаздела2_2 = бг_ПоляРаздела2_2();
	бг_ЗаполнитьДанныеПодраздела(ДанныеРаздел2, "Раздел2_2", ПоляПодРаздела2_2, Выборка);
	
	// Раздел 2_3
	Выборка = Результат[Результат.ВГраница() - 3].Выбрать();
	ПоляПодРаздела2_3 = бг_ПоляРаздела2_3();
	бг_ЗаполнитьДанныеПодраздела(ДанныеРаздел2, "Раздел2_3", ПоляПодРаздела2_3, Выборка);
	
	// Раздел 2_4
	Выборка = Результат[Результат.ВГраница() - 2].Выбрать();
	ПоляПодРаздела2_4_1 = бг_ПоляРаздела2_4_1();
	бг_ЗаполнитьДанныеПодраздела(ДанныеРаздел2, "Раздел2_4_1", ПоляПодРаздела2_4_1, Выборка);

	// Раздел 2_5
	Выборка = Результат[Результат.ВГраница() - 1].Выбрать();
	ПоляПодРаздела2_5 = бг_ПоляРаздела2_5();
	бг_ЗаполнитьДанныеПодраздела(ДанныеРаздел2, "Раздел2_5", ПоляПодРаздела2_5, Выборка);
	
	// Приложение 1
	Выборка = Результат[Результат.ВГраница()].Выбрать();
	ПоляПриложения1 = бг_ПоляПриложения1();
	бг_ЗаполнитьДанныеПодраздела(ДанныеРаздел2, "Приложение1", ПоляПриложения1, Выборка);
	
	Возврат ДанныеРаздел2;
КонецФункции

Процедура бг_ЗаполнитьДанныеПодраздела(ДанныеРаздел, ИмяПодраздела, СтруктураПолейПодРаздела, ВыборкаДанные)
	ДанныеРаздел.Вставить(ИмяПодраздела, Новый Массив);
	Пока ВыборкаДанные.Следующий() Цикл
		ПоляПодРаздела = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураПолейПодРаздела);
		
		Для Каждого ПолеРаздел Из ПоляПодРаздела Цикл
			бг_ЗаполнитьЗначениеПоляОтчета(ПолеРаздел, ВыборкаДанные);
		КонецЦикла;
		
		ДанныеРаздел[ИмяПодраздела].Добавить(ПоляПодРаздела);
	КонецЦикла;
КонецПроцедуры

Функция бг_ПоляРаздела2_1()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодПоказателя", бг_ПараметрРегламентированногоОтчета("П00021М100001"));
	ПоляРегламентированногоОтчета.Вставить("Признак_2_1", бг_ПараметрРегламентированногоОтчета("П00021М100002"));
	ПоляРегламентированногоОтчета.Вставить("НалоговаяБаза_2_1", бг_ПараметрРегламентированногоОтчета("П00021М100003"));
	ПоляРегламентированногоОтчета.Вставить("Сумма_2_1", бг_ПараметрРегламентированногоОтчета("П00021М100004"));
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

Функция бг_ПоляРаздела2_2()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодПоказателя", бг_ПараметрРегламентированногоОтчета("П00022М100001"));
	ПоляРегламентированногоОтчета.Вставить("Признак_2_2", бг_ПараметрРегламентированногоОтчета("П00022М100002"));
	ПоляРегламентированногоОтчета.Вставить("НалоговаяБаза_2_2", бг_ПараметрРегламентированногоОтчета("П00022М100003"));
	ПоляРегламентированногоОтчета.Вставить("Сумма_2_2", бг_ПараметрРегламентированногоОтчета("П00022М100004"));
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

Функция бг_ПоляРаздела2_3()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодПоказателя", бг_ПараметрРегламентированногоОтчета("П00023М100001"));
	ПоляРегламентированногоОтчета.Вставить("ОбъемПодакцизногоТовара", бг_ПараметрРегламентированногоОтчета("П00023М100002"));
	ПоляРегламентированногоОтчета.Вставить("СуммаАкциза", бг_ПараметрРегламентированногоОтчета("П00023М100003"));
	ПоляРегламентированногоОтчета.Вставить("НалоговыйПериодМесяц", бг_ПараметрРегламентированногоОтчета("П00023М100004", "ДФ=MM"));
	ПоляРегламентированногоОтчета.Вставить("НалоговыйПериодГод", бг_ПараметрРегламентированногоОтчета("П00023М100005", "ДФ=yyyy"));
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

Функция бг_ПоляРаздела2_4_1()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодПоказателя", бг_ПараметрРегламентированногоОтчета("П00241М100001"));
	ПоляРегламентированногоОтчета.Вставить("СуммаАкциза", бг_ПараметрРегламентированногоОтчета("П00241М100002"));
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

Функция бг_ПоляРаздела2_5()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодПоказателя", бг_ПараметрРегламентированногоОтчета("П00025М100001"));
	ПоляРегламентированногоОтчета.Вставить("ОбъемПодакцизногоТовара", бг_ПараметрРегламентированногоОтчета("П00025М100002"));
	ПоляРегламентированногоОтчета.Вставить("СуммаАкциза", бг_ПараметрРегламентированногоОтчета("П00025М100003"));
	ПоляРегламентированногоОтчета.Вставить("НалоговыйПериодМесяц", бг_ПараметрРегламентированногоОтчета("П00025М100004", "ДФ=MM"));
	ПоляРегламентированногоОтчета.Вставить("НалоговыйПериодГод", бг_ПараметрРегламентированногоОтчета("П00025М100005", "ДФ=yyyy"));
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

#КонецОбласти

#Область Приложение1

Процедура бг_ЗаполнитьПриложение1(ДанныеОтчета, ДанныеПриложение)
	ДанныеПриложение1 = ДанныеОтчета.ДанныеМногоуровневыхРазделов.Приложение1;
	СтрокаДанныеРаздел = ДанныеПриложение1.Строки[0];
	
	// Раздел 2.1. Код раздела "П00021М1"
	бг_ЗаполнитьПодраздел(СтрокаДанныеРаздел, "П00101М1", "Приложение1", ДанныеПриложение);
КонецПроцедуры

Функция бг_ПоляПриложения1()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодПоказателя", бг_ПараметрРегламентированногоОтчета("П00101М100001"));
	ПоляРегламентированногоОтчета.Вставить("Признак_Приложение1", бг_ПараметрРегламентированногоОтчета("П00101М100002"));
	ПоляРегламентированногоОтчета.Вставить("НоменклатураКрепость", бг_ПараметрРегламентированногоОтчета("П00101М100003"));
	ПоляРегламентированногоОтчета.Вставить("ОбъемПодакцизногоТовара", бг_ПараметрРегламентированногоОтчета("П00101М100004"));
	ПоляРегламентированногоОтчета.Вставить("ОбъемПодакцизногоТовараБезводный", бг_ПараметрРегламентированногоОтчета("П00101М100005"));
	ПоляРегламентированногоОтчета.Вставить("ПериодМесяц", бг_ПараметрРегламентированногоОтчета("П00101М100006", "ДФ=MM"));
	ПоляРегламентированногоОтчета.Вставить("ПериодГод", бг_ПараметрРегламентированногоОтчета("П00101М100007", "ДФ=yyyy"));
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

#КонецОбласти

#Область Приложение6

Процедура бг_ЗаполнитьПриложение6(ДанныеОтчета, ДанныеПриложение)
	ДанныеПриложение6 = ДанныеОтчета.ДанныеМногоуровневыхРазделов.Приложение6;
	ДанныеПриложение6.Строки.Очистить();
	
	Для Каждого ЭлементДанные Из ДанныеПриложение Цикл
		СтрокаДанныебанковскойГарантии = ДанныеПриложение6.Строки.Добавить();
		СтрокаДанныебанковскойГарантии.Данные = Новый Структура;
		СтрокаДанныебанковскойГарантии.ДанныеМногострочныхЧастей = Новый Структура;
		
		Для Каждого ПолеОтчета Из ЭлементДанные Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПолеОтчета.Значение, "ИмяПоля") Тогда
				СтрокаДанныебанковскойГарантии.Данные.Вставить(ПолеОтчета.Значение.ИмяПоля, ПолеОтчета.Значение.Значение);
			КонецЕсли;
		КонецЦикла;
		
		// Раздел 1.2. Код раздела "П00106М1"
		СтрокаКореньРаздела = СтрокаДанныебанковскойГарантии.Строки.Добавить();
		СтрокаДанныеРаздела = СтрокаКореньРаздела.Строки.Добавить();
		СтрокаДанныеРаздела.Данные = Новый Структура;
		СтрокаДанныеРаздела.ДанныеМногострочныхЧастей = Новый Структура;
		
		ДеревоДанныеРаздела = бг_ДеревоДанныеРазделаПриложения();
		Если ЭлементДанные.Свойство("Раздел1_2") Тогда
			Для Каждого ПолеОтчета Из ЭлементДанные.Раздел1_2 Цикл
				ДеревоДанныеРаздела.Строки[0].Данные.Вставить(ПолеОтчета.Значение.ИмяПоля, ПолеОтчета.Значение.Значение);
			КонецЦикла;
		КонецЕсли;
		
		СтрокаДанныеРаздела.ДанныеМногострочныхЧастей.Вставить("П00106М1", ДеревоДанныеРаздела);
		
		// Раздел 1.3 Код раздела "П00106М2"
		ДеревоДанныеРаздела = бг_ДеревоДанныеРазделаПриложения();
		Если ЭлементДанные.Свойство("Раздел1_3") Тогда
			Для Каждого ПолеОтчета Из ЭлементДанные.Раздел1_3 Цикл
				ДеревоДанныеРаздела.Строки[0].Данные.Вставить(ПолеОтчета.Значение.ИмяПоля, ПолеОтчета.Значение.Значение);
			КонецЦикла;
		КонецЕсли;
		
		СтрокаДанныеРаздела.ДанныеМногострочныхЧастей.Вставить("П00106М2", ДеревоДанныеРаздела);
		
		// Раздел 1.4. Код раздела "П00106М3"
		СтрокаКореньРаздела = СтрокаДанныебанковскойГарантии.Строки.Добавить();
		СтрокаДанныеРаздела = СтрокаКореньРаздела.Строки.Добавить();
		СтрокаДанныеРаздела.Данные = Новый Структура;
		СтрокаДанныеРаздела.ДанныеМногострочныхЧастей = Новый Структура;
		
		ДеревоДанныеРаздела = бг_ДеревоДанныеРазделаПриложения();
		Если ЭлементДанные.Свойство("Раздел1_4") Тогда
			Для Каждого ПолеОтчета Из ЭлементДанные.Раздел1_4 Цикл
				ДеревоДанныеРаздела.Строки[0].Данные.Вставить(ПолеОтчета.Значение.ИмяПоля, ПолеОтчета.Значение.Значение);
			КонецЦикла;
		КонецЕсли;
		
		СтрокаДанныеРаздела.ДанныеМногострочныхЧастей.Вставить("П00106М3", ДеревоДанныеРаздела);
	КонецЦикла;
КонецПроцедуры

Функция бг_ДанныеПриложение6(Организация, НачалоПериода, КонецПериода)
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПриложение6 = Новый Массив;
	
	Запрос = Новый Запрос;
	
	МассивТекстов = Новый Массив;
	МассивТекстов.Добавить(бг_ТекстЗапросаБанковскиеГарантии());
	МассивТекстов.Добавить(бг_ТекстЗапросаДанныеБанковскихГарантий());
	МассивТекстов.Добавить(бг_ТекстЗапросаДанныеПоОборотам());
	МассивТекстов.Добавить(бг_ТекстЗапросаДанныеПоОстаткам());
	МассивТекстов.Добавить(бг_ТекстЗапросаДанныеПоАвансамВычетам());
	МассивТекстов.Добавить(бг_ТекстЗапросаДанныеДеклараций());
	Запрос.Текст = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериодаГраница", Новый Граница(НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СостоянияСырьяВРеализованнойПродукции", Перечисления.бг_СостоянияПодакцизногоСырья.СостоянияСырьяВРеализованнойПродукции());
	Запрос.УстановитьПараметр("СостоянияСырьяВыполненоСписание", Перечисления.бг_СостоянияПодакцизногоСырья.СостоянияСырьяВыполненоСписание());
	Запрос.УстановитьПараметр("ИсключаемыеТипыДокументов", бг_ИсключаемыеИзРасчетаТипыДокументов());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		БанковскаяГарантияИстекла  = ЗначениеЗаполнено(Выборка.ПериодИстеченияБанковскойГарантии)
								И (Выборка.ПериодИстеченияБанковскойГарантии < НачалоПериода);
		БанковскаяГарантияИстекает = ЗначениеЗаполнено(Выборка.ПериодИстеченияБанковскойГарантии)
								И (НачалоМесяца(Выборка.ПериодИстеченияБанковскойГарантии) = НачалоПериода);
		
		ПоляРегламентированногоОтчетаПриложение6 = бг_ПоляРегламентированногоОтчетаПриложение6();
		
		Для Каждого ПолеОтчетаПриложение6 Из ПоляРегламентированногоОтчетаПриложение6 Цикл
			бг_ЗаполнитьЗначениеПоляОтчета(ПолеОтчетаПриложение6, Выборка);
		КонецЦикла;
		
		Если БанковскаяГарантияИстекла Тогда
			ПоляРегламентированногоОтчетаПриложение6.Вставить("Раздел1_4", бг_ПоляРаздела1_4());
			Для Каждого ПолеРаздел Из ПоляРегламентированногоОтчетаПриложение6.Раздел1_4 Цикл
				бг_ЗаполнитьЗначениеПоляОтчета(ПолеРаздел, Выборка);
			КонецЦикла;
		ИначеЕсли БанковскаяГарантияИстекает Тогда
			ПоляРегламентированногоОтчетаПриложение6.Вставить("Раздел1_2", бг_ПоляРаздела1_2());
			Для Каждого ПолеРаздел Из ПоляРегламентированногоОтчетаПриложение6.Раздел1_2 Цикл
				бг_ЗаполнитьЗначениеПоляОтчета(ПолеРаздел, Выборка);
			КонецЦикла;
			
			ПоляРегламентированногоОтчетаПриложение6.Вставить("Раздел1_3", бг_ПоляРаздела1_3());
			Для Каждого ПолеРаздел Из ПоляРегламентированногоОтчетаПриложение6.Раздел1_3 Цикл
				бг_ЗаполнитьЗначениеПоляОтчета(ПолеРаздел, Выборка)
			КонецЦикла;
		Иначе
			ПоляРегламентированногоОтчетаПриложение6.Вставить("Раздел1_2", бг_ПоляРаздела1_2());
			Для Каждого ПолеРаздел Из ПоляРегламентированногоОтчетаПриложение6.Раздел1_2 Цикл
				бг_ЗаполнитьЗначениеПоляОтчета(ПолеРаздел, Выборка);
			КонецЦикла;
		КонецЕсли;
		
		ДанныеПриложение6.Добавить(ПоляРегламентированногоОтчетаПриложение6);
	КонецЦикла;
	
	Возврат ДанныеПриложение6;
КонецФункции

Функция бг_ИсключаемыеИзРасчетаТипыДокументов()
	ИсключаемыеТипыДокументов = Новый Массив;
	ИсключаемыеТипыДокументов.Добавить(Тип("ДокументСсылка.битРасчетАвансовПоАкцизам"));
	
	Возврат ИсключаемыеТипыДокументов;
КонецФункции

Функция бг_ПоляРегламентированногоОтчетаПриложение6()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("ПризнакБанковскойГарантии", бг_ПараметрРегламентированногоОтчета("П001060000103"));
	ПоляРегламентированногоОтчета.Вставить("НомерБанковскойГарантии", бг_ПараметрРегламентированногоОтчета("П001060001003"));
	ПоляРегламентированногоОтчета.Вставить("ДатаВыдачи", бг_ПараметрРегламентированногоОтчета("П001060001503"));
	ПоляРегламентированногоОтчета.Вставить("ДатаНачалаСрокаДействия", бг_ПараметрРегламентированногоОтчета("П001060002003"));
	ПоляРегламентированногоОтчета.Вставить("ДатаОкончанияСрокаДействия", бг_ПараметрРегламентированногоОтчета("П001060003003"));
	ПоляРегламентированногоОтчета.Вставить("СуммаБанковскойГарантии", бг_ПараметрРегламентированногоОтчета("П001060004003"));
	ПоляРегламентированногоОтчета.Вставить("РегистрационныйНомерИзвещения", бг_ПараметрРегламентированногоОтчета("П001060005003"));
	ПоляРегламентированногоОтчета.Вставить("ДатаРегистрацииИзвещения", бг_ПараметрРегламентированногоОтчета("П001060006003"));
	ПоляРегламентированногоОтчета.Вставить("ИННОрганизации", бг_ПараметрРегламентированногоОтчета("П001060007003"));
	ПоляРегламентированногоОтчета.Вставить("КППОрганизации", бг_ПараметрРегламентированногоОтчета("П001060008003"));
	ПоляРегламентированногоОтчета.Вставить("КодВидаСпирта", бг_ПараметрРегламентированногоОтчета("П001060009003"));
	ПоляРегламентированногоОтчета.Вставить("ОбъемСпиртаПоБанковскойГарантии", бг_ПараметрРегламентированногоОтчета("П001060010003"));
	ПоляРегламентированногоОтчета.Вставить("СуммаАвансовогоПлатежаПоБанковскойГарантии", бг_ПараметрРегламентированногоОтчета("П001060011003"));
	ПоляРегламентированногоОтчета.Вставить("ОбъемЗакупленногоСпирта", бг_ПараметрРегламентированногоОтчета("П001060012003"));
	ПоляРегламентированногоОтчета.Вставить("СтоимостьЗакупленногоСпирта", бг_ПараметрРегламентированногоОтчета("П001060013003"));
	ПоляРегламентированногоОтчета.Вставить("ПериодИстеченияБанковскойГарантии", бг_ПараметрРегламентированногоОтчета("П001060013503", "ДФ=MM.yyyy"));
	ПоляРегламентированногоОтчета.Вставить("КорНомерИзвещения", бг_ПараметрРегламентированногоОтчета("П001060014003"));
	ПоляРегламентированногоОтчета.Вставить("КорДатаИзвещения", бг_ПараметрРегламентированногоОтчета("П001060015003"));
	ПоляРегламентированногоОтчета.Вставить("КорИННОрганизации", бг_ПараметрРегламентированногоОтчета("П001060016003"));
	ПоляРегламентированногоОтчета.Вставить("КорКППОрганизации", бг_ПараметрРегламентированногоОтчета("П001060017003"));
	ПоляРегламентированногоОтчета.Вставить("КорКодВидаСпирта", бг_ПараметрРегламентированногоОтчета("П001060018003"));
	ПоляРегламентированногоОтчета.Вставить("КорОбъемЭтиловогоСпирта", бг_ПараметрРегламентированногоОтчета("П001060019003"));
	ПоляРегламентированногоОтчета.Вставить("КорСуммаАвансовогоПлатежаАкциза", бг_ПараметрРегламентированногоОтчета("П001060020003"));
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

Функция бг_ПоляРаздела1_2()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодВидаПодакцизногоТовара", бг_ПараметрРегламентированногоОтчета("П00106М121003")); //210
	ПоляРегламентированногоОтчета.Вставить("ОбъемПоступившегоСпирта", бг_ПараметрРегламентированногоОтчета("П00106М122003")); // 220
	ПоляРегламентированногоОтчета.Вставить("СтоимостьПоступившегоСпирта", бг_ПараметрРегламентированногоОтчета("П00106М123003")); // 230
	ПоляРегламентированногоОтчета.Вставить("ОстатокСпиртаВНереализованнойПродукции", бг_ПараметрРегламентированногоОтчета("П00106М124003")); // 240
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПериод", бг_ПараметрРегламентированногоОтчета("П00106М125003")); // 250
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериод", бг_ПараметрРегламентированногоОтчета("П00106М125503")); // 255
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПериодКПодтверждению", бг_ПараметрРегламентированногоОтчета("П00106М126003")); // 260
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению", бг_ПараметрРегламентированногоОтчета("П00106М126503")); //265
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПериодПодтверждено", бг_ПараметрРегламентированногоОтчета("П00106М126603")); // 266
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериодПодтверждено", бг_ПараметрРегламентированногоОтчета("П00106М126703")); // 267
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС", бг_ПараметрРегламентированногоОтчета("П00106М127003")); // 270
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС", бг_ПараметрРегламентированногоОтчета("П00106М127503")); // 275
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС", бг_ПараметрРегламентированногоОтчета("П00106М127603")); // 276
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС", бг_ПараметрРегламентированногоОтчета("П00106М127703")); // 277
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПрошлыеПериоды", бг_ПараметрРегламентированногоОтчета("П00106М128003")); // 280
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды", бг_ПараметрРегламентированногоОтчета("П00106М128503")); // 285
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды", бг_ПараметрРегламентированногоОтчета("П00106М129003")); // 290
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды", бг_ПараметрРегламентированногоОтчета("П00106М129503")); // 295
	ПоляРегламентированногоОтчета.Вставить("ОбъемСписанногоПоНормеСпирта", бг_ПараметрРегламентированногоОтчета("П00106М130003")); // 300
	ПоляРегламентированногоОтчета.Вставить("СтоимостьСписанногоПоНормеСпирта", бг_ПараметрРегламентированногоОтчета("П00106М130503")); // 305
	ПоляРегламентированногоОтчета.Вставить("ОбъемСписанногоСверхНормыСпирта", бг_ПараметрРегламентированногоОтчета("П00106М131003")); // 310
	ПоляРегламентированногоОтчета.Вставить("СтоимостьСписанногоСверхНормыСпирта", бг_ПараметрРегламентированногоОтчета("П00106М131503")); // 315
	ПоляРегламентированногоОтчета.Вставить("ОстатокСпиртаРасчетный", бг_ПараметрРегламентированногоОтчета("П00106М132003")); // 320
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

Функция бг_ПоляРаздела1_3()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодВидаПодакцизногоТовара", бг_ПараметрРегламентированногоОтчета("П00106М232503")); // 325
	ПоляРегламентированногоОтчета.Вставить("ОбщаяСтоимостьРеализованногоСпирта", бг_ПараметрРегламентированногоОтчета("П00106М233003")); // 330
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериодПодтвержденоИтого", бг_ПараметрРегламентированногоОтчета("П00106М234003")); // 340
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод", бг_ПараметрРегламентированногоОтчета("П00106М235003")); // 350
	ПоляРегламентированногоОтчета.Вставить("СтоимостьСписанногоПоНормеСпиртаИтого", бг_ПараметрРегламентированногоОтчета("П00106М236003")); // 360
	ПоляРегламентированногоОтчета.Вставить("СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода", бг_ПараметрРегламентированногоОтчета("П00106М237003")); // 370
	ПоляРегламентированногоОтчета.Вставить("ОстатокСпиртаВНереализованнойПродукцииКонецПериода", бг_ПараметрРегламентированногоОтчета("П00106М238003")); // 380
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

Функция бг_ПоляРаздела1_4()
	ПоляРегламентированногоОтчета = Новый Структура;
	ПоляРегламентированногоОтчета.Вставить("КодВидаПодакцизногоТовара", бг_ПараметрРегламентированногоОтчета("П00106М338503")); // 385
	ПоляРегламентированногоОтчета.Вставить("СуммаАвансаПоАкцизам", бг_ПараметрРегламентированногоОтчета("П00106М339003")); // 390
	ПоляРегламентированногоОтчета.Вставить("СуммаНеЗачтенногоАвансаПоАкцизамНачалоПериода", бг_ПараметрРегламентированногоОтчета("П00106М340003")); // 400
	ПоляРегламентированногоОтчета.Вставить("ОстатокСпиртаВНереализованнойПродукцииРаздел4", бг_ПараметрРегламентированногоОтчета("П00106М340503")); // 405
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПериодРаздел4", бг_ПараметрРегламентированногоОтчета("П00106М341003")); // 410
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериодРаздел4", бг_ПараметрРегламентированногоОтчета("П00106М341503")); // 415
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюРаздел4", бг_ПараметрРегламентированногоОтчета("П00106М342003")); // 420
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюРаздел4", бг_ПараметрРегламентированногоОтчета("П00106М342503")); // 425
	ПоляРегламентированногоОтчета.Вставить("ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭСРаздел4", бг_ПараметрРегламентированногоОтчета("П00106М343003")); // 430
	ПоляРегламентированногоОтчета.Вставить("СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭСРаздел4", бг_ПараметрРегламентированногоОтчета("П00106М343503")); // 435
	ПоляРегламентированногоОтчета.Вставить("ОбъемСписанногоПоНормеСпиртаЗаПериод", бг_ПараметрРегламентированногоОтчета("П00106М344003")); // 440
	ПоляРегламентированногоОтчета.Вставить("СтоимостьСписанногоПоНормеСпиртаЗаПериод", бг_ПараметрРегламентированногоОтчета("П00106М344503")); // 445
	ПоляРегламентированногоОтчета.Вставить("ОбъемСписанногоСверхНормыСпиртаЗаПериод", бг_ПараметрРегламентированногоОтчета("П00106М345003")); // 450
	ПоляРегламентированногоОтчета.Вставить("СтоимостьСписанногоСверхНормыСпиртаЗаПериод", бг_ПараметрРегламентированногоОтчета("П00106М345503")); // 455
	ПоляРегламентированногоОтчета.Вставить("СуммаЗачтенногоАвансаПоАкцизамТекущийПериод", бг_ПараметрРегламентированногоОтчета("П00106М346003")); // 460
	ПоляРегламентированногоОтчета.Вставить("СуммаНеЗачтенногоАвансаПоАкцизам", бг_ПараметрРегламентированногоОтчета("П00106М348003")); // 480
	ПоляРегламентированногоОтчета.Вставить("ОстатокСпиртаВНереализованнойПродукцииКонецПериодаРаздел4", бг_ПараметрРегламентированногоОтчета("П00106М349003")); // 490
	
	Возврат ПоляРегламентированногоОтчета;
КонецФункции

#Область ТекстыЗапросовДанныеДекларации

Функция бг_ТекстЗапросаБанковскиеГарантии()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АкцизПоПриобретеннымЦенностямОстаткиИОбороты.Организация КАК Организация,
	|	АкцизПоПриобретеннымЦенностямОстаткиИОбороты.Сделка КАК Сделка
	|ПОМЕСТИТЬ БанковскиеГарантииПредварительно
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Организация = &Организация
	|				И ТИПЗНАЧЕНИЯ(Сделка) = ТИП(Справочник.бг_БанковскиеГарантии)) КАК АкцизПоПриобретеннымЦенностямОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеГарантииПредварительно.Сделка КАК Сделка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АкцизПоПриобретеннымЦенностямТоварыВПути.Сделка ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьТоварыВПути
	|ПОМЕСТИТЬ БанковскиеГарантии
	|ИЗ
	|	БанковскиеГарантииПредварительно КАК БанковскиеГарантииПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям КАК АкцизПоПриобретеннымЦенностямТоварыВПути
	|		ПО БанковскиеГарантииПредварительно.Организация = АкцизПоПриобретеннымЦенностямТоварыВПути.Организация
	|			И БанковскиеГарантииПредварительно.Сделка = АкцизПоПриобретеннымЦенностямТоварыВПути.Сделка
	|			И (АкцизПоПриобретеннымЦенностямТоварыВПути.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|			И (АкцизПоПриобретеннымЦенностямТоварыВПути.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути))
	|
	|СГРУППИРОВАТЬ ПО
	|	БанковскиеГарантииПредварительно.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ БанковскиеГарантииПредварительно";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция бг_ТекстЗапросаДанныеБанковскихГарантий()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АкцизОбороты.Период КАК Период,
	|	АкцизОбороты.Сделка КАК БанковскаяГарантия,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	АкцизОбороты.КоличествоПриход КАК КоличествоПриход
	|ПОМЕСТИТЬ ПериодыОтгрузкиОтПоставщикаНаТоварыВПути
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Организация = &Организация
	|				И СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						БанковскиеГарантии.Сделка КАК БанковскаяГарантия
	|					ИЗ
	|						БанковскиеГарантии КАК БанковскиеГарантии)) КАК АкцизОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ПериодыОтгрузкиОтПоставщикаНаТоварыВПути.Период, МЕСЯЦ, 1) КАК Период,
	|	ПериодыОтгрузкиОтПоставщикаНаТоварыВПути.БанковскаяГарантия КАК БанковскаяГарантия,
	|	ПериодыОтгрузкиОтПоставщикаНаТоварыВПути.Номенклатура КАК Номенклатура,
	|	ПериодыОтгрузкиОтПоставщикаНаТоварыВПути.КоличествоПриход КАК КоличествоПриход
	|ПОМЕСТИТЬ ПериодыОтгрузкиОтПоставщика
	|ИЗ
	|	ПериодыОтгрузкиОтПоставщикаНаТоварыВПути КАК ПериодыОтгрузкиОтПоставщикаНаТоварыВПути
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ЕСТЬNULL(ВЫРАЗИТЬ(АкцизОбороты.Сделка КАК Справочник.бг_БанковскиеГарантии).ДатаНачалаСрокаДействия, АкцизОбороты.Период)),
	|	АкцизОбороты.Сделка,
	|	АкцизОбороты.Номенклатура,
	|	СУММА(АкцизОбороты.КоличествоПриход)
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Организация = &Организация
	|				И СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизВСырье)
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						БанковскиеГарантии.Сделка КАК БанковскаяГарантия
	|					ИЗ
	|						БанковскиеГарантии КАК БанковскиеГарантии)
	|				И НЕ Сделка В
	|						(ВЫБРАТЬ
	|							ПериодыОтгрузкиОтПоставщикаНаТоварыВПути.БанковскаяГарантия
	|						ИЗ
	|							ПериодыОтгрузкиОтПоставщикаНаТоварыВПути КАК ПериодыОтгрузкиОтПоставщикаНаТоварыВПути)) КАК АкцизОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцизОбороты.Сделка,
	|	АкцизОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеГарантии.Сделка КАК БанковскаяГарантия,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодИстеченияБанковскойГарантии,
	|	НЕОПРЕДЕЛЕНО КАК КодПодакцизногоТовара,
	|	0 КАК СуммаБанковскойГарантии,
	|	0 КАК ОбъемСпиртаПоБанковскойГарантии
	|ПОМЕСТИТЬ ДанныеПредварительно
	|ИЗ
	|	БанковскиеГарантии КАК БанковскиеГарантии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПериодыОтгрузкиОтПоставщика.БанковскаяГарантия,
	|	МИНИМУМ(ДОБАВИТЬКДАТЕ(ПериодыОтгрузкиОтПоставщика.Период, ДЕНЬ, ПериодыОтгрузкиОтПоставщика.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом.РасчетныйСрокБГ)),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0
	|ИЗ
	|	ПериодыОтгрузкиОтПоставщика КАК ПериодыОтгрузкиОтПоставщика
	|ГДЕ
	|	НЕ ПериодыОтгрузкиОтПоставщика.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом.РасчетныйСрокБГ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыОтгрузкиОтПоставщика.БанковскаяГарантия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БанковскиеГарантии.Сделка,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	РегистрацияРаспределениеАкциза.ВидПодакцизныхТоваров.Код,
	|	0,
	|	0
	|ИЗ
	|	БанковскиеГарантии КАК БанковскиеГарантии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бг_РегистрацияБанковскихГарантий.РаспределениеАкциза КАК РегистрацияРаспределениеАкциза
	|		ПО БанковскиеГарантии.Сделка = РегистрацияРаспределениеАкциза.БанковскаяГарантия
	|			И (РегистрацияРаспределениеАкциза.Ссылка.Проведен)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БанковскиеГарантииОбороты.БанковскаяГарантия,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО,
	|	БанковскиеГарантииОбороты.СуммаПриход,
	|	БанковскиеГарантииОбороты.КоличествоПриход
	|ИЗ
	|	РегистрНакопления.бг_БанковскиеГарантии.Обороты(
	|			,
	|			,
	|			,
	|			БанковскаяГарантия В
	|				(ВЫБРАТЬ
	|					БанковскиеГарантии.Сделка КАК Сделка
	|				ИЗ
	|					БанковскиеГарантии КАК БанковскиеГарантии)) КАК БанковскиеГарантииОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПредварительно.БанковскаяГарантия КАК БанковскаяГарантия,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДанныеПредварительно.БанковскаяГарантия.ДатаВыдачи, ГОД) <> НАЧАЛОПЕРИОДА(ДанныеПредварительно.БанковскаяГарантия.ДатаНачалаСрокаДействия, ГОД)
	|				И ДанныеПредварительно.БанковскаяГарантия.НалоговаяСтавкаНаДатуВыдачи <> 0
	|			ТОГДА ДанныеПредварительно.БанковскаяГарантия.НалоговаяСтавкаНаДатуВыдачи
	|		ИНАЧЕ ДанныеПредварительно.БанковскаяГарантия.Родитель.НалоговаяСтавка
	|	КОНЕЦ КАК НалоговаяСтавка,
	|	СУММА(ДанныеПредварительно.СуммаБанковскойГарантии) КАК СуммаБанковскойГарантии,
	|	СУММА(ДанныеПредварительно.ОбъемСпиртаПоБанковскойГарантии) КАК ОбъемСпиртаПоБанковскойГарантии,
	|	МАКСИМУМ(ДанныеПредварительно.ПериодИстеченияБанковскойГарантии) КАК ПериодИстеченияБанковскойГарантии,
	|	МАКСИМУМ(ДанныеПредварительно.КодПодакцизногоТовара) КАК КодПодакцизногоТовара
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	ДанныеПредварительно КАК ДанныеПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПредварительно.БанковскаяГарантия,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДанныеПредварительно.БанковскаяГарантия.ДатаВыдачи, ГОД) <> НАЧАЛОПЕРИОДА(ДанныеПредварительно.БанковскаяГарантия.ДатаНачалаСрокаДействия, ГОД)
	|				И ДанныеПредварительно.БанковскаяГарантия.НалоговаяСтавкаНаДатуВыдачи <> 0
	|			ТОГДА ДанныеПредварительно.БанковскаяГарантия.НалоговаяСтавкаНаДатуВыдачи
	|		ИНАЧЕ ДанныеПредварительно.БанковскаяГарантия.Родитель.НалоговаяСтавка
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.БанковскаяГарантия КАК БанковскаяГарантия,
	|	БанковскиеГарантии.Номер КАК НомерБанковскойГарантии,
	|	Данные.ПериодИстеченияБанковскойГарантии КАК ПериодИстеченияБанковскойГарантии,
	|	БанковскиеГарантии.ДатаВыдачи КАК ДатаВыдачи,
	|	БанковскиеГарантии.ДатаНачалаСрокаДействия КАК ДатаНачалаСрокаДействия,
	|	БанковскиеГарантии.ДатаОкончанияСрокаДействия КАК ДатаОкончанияСрокаДействия,
	|	Данные.ОбъемСпиртаПоБанковскойГарантии * Данные.НалоговаяСтавка КАК СуммаБанковскойГарантии,
	|	Данные.ОбъемСпиртаПоБанковскойГарантии * Данные.НалоговаяСтавка КАК СуммаАвансовогоПлатежаПоБанковскойГарантии,
	|	ЕСТЬNULL(БанковскиеГарантии.Родитель.Поставщик.ИНН, """") КАК ИННОрганизации,
	|	ЕСТЬNULL(БанковскиеГарантии.Родитель.Поставщик.КПП, """") КАК КППОрганизации,
	|	Данные.ОбъемСпиртаПоБанковскойГарантии * 10 КАК ОбъемСпиртаПоБанковскойГарантии,
	|	Данные.КодПодакцизногоТовара КАК КодВидаПодакцизногоТовара
	|ПОМЕСТИТЬ ДанныеБанковскихГарантий
	|ИЗ
	|	Данные КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_БанковскиеГарантии КАК БанковскиеГарантии
	|		ПО Данные.БанковскаяГарантия = БанковскиеГарантии.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПериодыОтгрузкиОтПоставщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Данные";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция бг_ТекстЗапросаДанныеПоОборотам()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АкцизОбороты.ПериодМесяц КАК Период,
	|	АкцизОбороты.Регистратор КАК Регистратор,
	|	АкцизОбороты.Сделка КАК Сделка,
	|	АкцизОбороты.СостояниеСырья КАК СостояниеСырья,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Продукция = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоПродукция,
	|	СУММА(АкцизОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(АкцизОбороты.КоличествоРасход) КАК КоличествоРасход
	|ПОМЕСТИТЬ АкцизыОборотыПредварительно
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			,
	|			&КонецПериода,
	|			Авто,
	|			Организация = &Организация
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						БанковскиеГарантии.Сделка КАК Сделка
	|					ИЗ
	|						БанковскиеГарантии КАК БанковскиеГарантии)
	|				И НЕ СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции)) КАК АкцизОбороты
	|ГДЕ
	|	НЕ ТИПЗНАЧЕНИЯ(АкцизОбороты.Регистратор) В (&ИсключаемыеТипыДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцизОбороты.ПериодМесяц,
	|	АкцизОбороты.Регистратор,
	|	АкцизОбороты.Сделка,
	|	АкцизОбороты.СостояниеСырья,
	|	АкцизОбороты.СтатусАкциза,
	|	АкцизОбороты.Номенклатура,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Продукция = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизОбороты.Сделка КАК БанковскаяГарантия,
	|	АкцизОбороты.Период КАК Период,
	|	АкцизОбороты.Номенклатура КАК Номенклатура,
	|	АкцизОбороты.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	АкцизОбороты.СтатусАкциза КАК СтатусАкциза,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		КОГДА ISNULL(БанковскиеГарантии.ЕстьТоварыВПути, ИСТИНА) = ЛОЖЬ
	|			И АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизВСырье)
	|			И АкцизОбороты.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемЗакупленногоСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизНаТоварыВПути)
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		КОГДА ISNULL(БанковскиеГарантии.ЕстьТоварыВПути, ИСТИНА) = ЛОЖЬ
	|			И АкцизОбороты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизВСырье)
	|			И АкцизОбороты.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПоступившегоСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период = &НачалоПериода
	|				И (АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|					ИЛИ АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме),
	|						ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы))
	|					И АкцизОбороты.ЭтоПродукция)
	|				И НЕ АкцизОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период = &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период = &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии))
	|			ТОГДА АкцизОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период = &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период = &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период <> &НачалоПериода
	|				И (АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции)
	|					ИЛИ АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме),
	|						ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы))
	|					И АкцизОбороты.ЭтоПродукция)
	|				И НЕ АкцизОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период <> &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии),
	|											ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|			И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоПоНормеСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|			И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоСверхНормыСпирта,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии),
	|											ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС))
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период = &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме)
	|				И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	ВЫБОР
	|		КОГДА АкцизОбороты.Период = &НачалоПериода
	|				И АкцизОбороты.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы)
	|				И НЕ АкцизОбороты.ЭтоПродукция
	|			ТОГДА АкцизОбороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод
	|ПОМЕСТИТЬ АкцизыОбороты
	|ИЗ
	|	АкцизыОборотыПредварительно КАК АкцизОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ БанковскиеГарантии КАК БанковскиеГарантии
	|		ПО АкцизОбороты.Сделка = БанковскиеГарантии.Сделка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизыОбороты.БанковскаяГарантия.ДатаВыдачи КАК Период,
	|	АкцизыОбороты.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	МАКСИМУМ(КодыВидовОперацийНалогообложения.Период) КАК ПериодНалоговыеСтавки
	|ПОМЕСТИТЬ ПериодыРасчетаНалоговойСтавки
	|ИЗ
	|	АкцизыОбороты КАК АкцизыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО АкцизыОбороты.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И АкцизыОбороты.БанковскаяГарантия.ДатаВыдачи >= КодыВидовОперацийНалогообложения.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцизыОбороты.БанковскаяГарантия.ДатаВыдачи,
	|	АкцизыОбороты.ВидОперацииНалогообложенияАкцизом
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АкцизыОбороты.Период КАК Период,
	|	АкцизыОбороты.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	МАКСИМУМ(КодыВидовОперацийНалогообложения.Период) КАК ПериодНалоговыеСтавки
	|ИЗ
	|	АкцизыОбороты КАК АкцизыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО АкцизыОбороты.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И АкцизыОбороты.Период >= КодыВидовОперацийНалогообложения.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцизыОбороты.Период,
	|	АкцизыОбороты.ВидОперацииНалогообложенияАкцизом
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	ПериодНалоговыеСтавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыРасчетаНалоговойСтавки.Период КАК Период,
	|	ПериодыРасчетаНалоговойСтавки.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров.НалоговаяСтавка КАК НалоговаяСтавка
	|ПОМЕСТИТЬ НалоговыеСтавки
	|ИЗ
	|	ПериодыРасчетаНалоговойСтавки КАК ПериодыРасчетаНалоговойСтавки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК КодыВидовОперацийНалогообложения
	|		ПО ПериодыРасчетаНалоговойСтавки.ВидОперацииНалогообложенияАкцизом = КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом
	|			И ПериодыРасчетаНалоговойСтавки.ПериодНалоговыеСтавки = КодыВидовОперацийНалогообложения.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизыОбороты.БанковскаяГарантия КАК БанковскаяГарантия,
	|	МАКСИМУМ(АкцизыОбороты.ВидОперацииНалогообложенияАкцизом.РасчетныйСрокБГ) КАК РасчетныйСрокБГ,
	|	СУММА(АкцизыОбороты.ОбъемЗакупленногоСпирта)
	|																* 10 КАК ОбъемЗакупленногоСпирта,
	|	СУММА(АкцизыОбороты.ОбъемЗакупленногоСпирта * ЕСТЬNULL(НалоговыеСтавки.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьЗакупленногоСпирта,
	|	СУММА(АкцизыОбороты.ОбъемПоступившегоСпирта) * 10 КАК ОбъемПоступившегоСпирта,
	|	СУММА(АкцизыОбороты.ОбъемПоступившегоСпирта * ЕСТЬNULL(НалоговыеСтавки.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьПоступившегоСпирта,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериод * 10) КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериод * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьРеализованногоСпиртаЗаПериод,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению * 10) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодПодтверждено) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодПодтверждено * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьРеализованногоСпиртаЗаПериодПодтверждено,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС) * 10 КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды) * 10 КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды * 10) КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	СУММА(АкцизыОбороты.ОбъемСписанногоПоНормеСпирта * 10) КАК ОбъемСписанногоПоНормеСпирта,
	|	СУММА(АкцизыОбороты.ОбъемСписанногоПоНормеСпирта * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьСписанногоПоНормеСпирта,
	|	СУММА(АкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * 10) КАК ОбъемСписанногоСверхНормыСпирта,
	|	СУММА(АкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьСписанногоСверхНормыСпирта,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод * 10) КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	СУММА(АкцизыОбороты.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	СУММА(АкцизыОбороты.ОбъемСписанногоПоНормеСпиртаЗаПериод * 10) КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	СУММА(АкцизыОбороты.ОбъемСписанногоПоНормеСпиртаЗаПериод * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьСписанногоПоНормеСпиртаЗаПериод,
	|	СУММА(АкцизыОбороты.ОбъемСписанногоСверхНормыСпиртаЗаПериод) * 10 КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод,
	|	СУММА(АкцизыОбороты.ОбъемСписанногоСверхНормыСпирта * ЕСТЬNULL(НалоговыеСтавкиПоРеализации.НалоговаяСтавка, 0))
	|																* 10 КАК СтоимостьСписанногоСверхНормыСпиртаЗаПериод
	|ПОМЕСТИТЬ ДанныеПоОборотамПоКонецПериода
	|ИЗ
	|	АкцизыОбороты КАК АкцизыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НалоговыеСтавки КАК НалоговыеСтавки
	|		ПО АкцизыОбороты.ВидОперацииНалогообложенияАкцизом = НалоговыеСтавки.ВидОперацииНалогообложенияАкцизом
	|			И АкцизыОбороты.БанковскаяГарантия.ДатаВыдачи = НалоговыеСтавки.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ НалоговыеСтавки КАК НалоговыеСтавкиПоРеализации
	|		ПО АкцизыОбороты.ВидОперацииНалогообложенияАкцизом = НалоговыеСтавкиПоРеализации.ВидОперацииНалогообложенияАкцизом
	|			И АкцизыОбороты.Период = НалоговыеСтавкиПоРеализации.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцизыОбороты.БанковскаяГарантия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АкцизыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПериодыРасчетаНалоговойСтавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НалоговыеСтавки";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция бг_ТекстЗапросаДанныеПоОстаткам()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка КАК Сделка,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья КАК СостояниеСырья,
	|	АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза КАК СтатусАкциза,
	|	АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстаток КАК КоличествоОстатокНачалоПериода,
	|	0 КАК КоличествоОстатокКонецПериода
	|ПОМЕСТИТЬ ОстаткиОборотыПоАкцизам
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Остатки(
	|			&НачалоПериодаГраница,
	|			Организация = &Организация
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						БанковскиеГарантии.Сделка КАК Сделка
	|					ИЗ
	|						БанковскиеГарантии КАК БанковскиеГарантии)
	|				И НЕ СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции)) КАК АкцизПоПриобретеннымЦенностямОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья,
	|	АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза,
	|	0,
	|	АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И Сделка В
	|					(ВЫБРАТЬ
	|						БанковскиеГарантии.Сделка КАК Сделка
	|					ИЗ
	|						БанковскиеГарантии КАК БанковскиеГарантии)
	|				И НЕ СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции)) КАК АкцизПоПриобретеннымЦенностямОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизПоПриобретеннымЦенностямОстатки.Сделка КАК БанковскаяГарантия,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностямОстатки.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	ВЫБОР
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВРеализованнойПродукции)
	|				ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВыполненоСписание)
	|				ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет)
	|			ТОГДА 0
	|		ИНАЧЕ АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстатокНачалоПериода
	|	КОНЕЦ КАК ОстатокСпиртаВНереализованнойПродукции,
	|	ВЫБОР
	|		КОГДА АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВРеализованнойПродукции)
	|				ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СостояниеСырья В (&СостоянияСырьяВыполненоСписание)
	|				ИЛИ АкцизПоПриобретеннымЦенностямОстатки.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет)
	|			ТОГДА 0
	|		ИНАЧЕ АкцизПоПриобретеннымЦенностямОстатки.КоличествоОстатокКонецПериода
	|	КОНЕЦ КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода
	|ПОМЕСТИТЬ ОстаткиПоАкцизамПредварительно
	|ИЗ
	|	ОстаткиОборотыПоАкцизам КАК АкцизПоПриобретеннымЦенностямОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыВидовОперацийНалогообложения.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом,
	|	КодыВидовОперацийНалогообложения.ВидПодакцизныхТоваров КАК ВидПодакцизныхТоваров
	|ПОМЕСТИТЬ ВидыПодакцизныхТоваров
	|ИЗ
	|	РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом.СрезПоследних(
	|			&КонецПериода,
	|			ВидОперацииНалогообложенияАкцизом В
	|				(ВЫБРАТЬ
	|					ОстаткиПоАкцизамПредварительно.ВидОперацииНалогообложенияАкцизом КАК ВидОперацииНалогообложенияАкцизом
	|				ИЗ
	|					ОстаткиПоАкцизамПредварительно КАК ОстаткиПоАкцизамПредварительно)) КАК КодыВидовОперацийНалогообложения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОперацииНалогообложенияАкцизом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоАкцизамПредварительно.БанковскаяГарантия КАК БанковскаяГарантия,
	|	МАКСИМУМ(ОстаткиПоАкцизамПредварительно.ВидОперацииНалогообложенияАкцизом.РасчетныйСрокБГ) КАК РасчетныйСрокБГ,
	|	СУММА(ОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукции) * 10 КАК ОстатокСпиртаВНереализованнойПродукции,
	|	СУММА(ОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукцииКонецПериода) * 10 КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода,
	|	СУММА(ОстаткиПоАкцизамПредварительно.ОстатокСпиртаВНереализованнойПродукцииКонецПериода * ЕСТЬNULL(ВидыПодакцизныхТоваров.ВидПодакцизныхТоваров.НалоговаяСтавка, 0) * 10) КАК СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода
	|ПОМЕСТИТЬ ОстаткиАкцизов
	|ИЗ
	|	ОстаткиПоАкцизамПредварительно КАК ОстаткиПоАкцизамПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыПодакцизныхТоваров КАК ВидыПодакцизныхТоваров
	|		ПО ОстаткиПоАкцизамПредварительно.ВидОперацииНалогообложенияАкцизом = ВидыПодакцизныхТоваров.ВидОперацииНалогообложенияАкцизом
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоАкцизамПредварительно.БанковскаяГарантия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОстаткиПоАкцизамПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВидыПодакцизныхТоваров";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция бг_ТекстЗапросаДанныеПоАвансамВычетам()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	БанковскиеГарантии.Сделка КАК БанковскаяГарантия,
	|	РасчетАвансовПоАкцизам.ХозяйственнаяОперация КАК Операция,
	|	АкцизПоПриобретеннымЦенностям.Период КАК Период,
	|	АкцизПоПриобретеннымЦенностям.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностям.Количество КАК Количество,
	|	АкцизПоПриобретеннымЦенностям.СостояниеОплатыАванса КАК СостояниеОплатыАванса
	|ПОМЕСТИТЬ АвансыВычеты
	|ИЗ
	|	БанковскиеГарантии КАК БанковскиеГарантии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям КАК АкцизПоПриобретеннымЦенностям
	|		ПО БанковскиеГарантии.Сделка = АкцизПоПриобретеннымЦенностям.Сделка
	|			И (АкцизПоПриобретеннымЦенностям.Организация = &Организация)
	|			И (АкцизПоПриобретеннымЦенностям.Период <= &КонецПериода)
	|			И (АкцизПоПриобретеннымЦенностям.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.битРасчетАвансовПоАкцизам КАК РасчетАвансовПоАкцизам
	|		ПО (АкцизПоПриобретеннымЦенностям.Регистратор = РасчетАвансовПоАкцизам.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансыВычеты.БанковскаяГарантия КАК БанковскаяГарантия,
	|	МАКСИМУМ(АвансыВычеты.Номенклатура.ВидНоменклатуры.бг_ВидОперацииНалогообложенияАкцизом.РасчетныйСрокБГ) КАК РасчетныйСрокБГ,
	|	СУММА(ВЫБОР
	|			КОГДА СостоянияОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.НачисленАванс)
	|					И АвансыВычеты.Операция = ЗНАЧЕНИЕ(Перечисление.бг_ОперацииРасчетаАвансовПоАкцизам.РасчетАвансов)
	|					И СостояниеОплатыАванса.ПродажаНаЭкспорт = Ложь
	|				ТОГДА АвансыВычеты.Количество * СостоянияОплатыАванса.НалоговаяСтавка * 10
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаАвансаПоАкцизам,
	|	СУММА(ВЫБОР
	|			КОГДА СостоянияОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.НачисленАванс)
	|					И АвансыВычеты.Операция = ЗНАЧЕНИЕ(Перечисление.бг_ОперацииРасчетаАвансовПоАкцизам.РасчетАвансов)
	|					И НАЧАЛОПЕРИОДА(АвансыВычеты.Период, МЕСЯЦ) = &НачалоПериода
	|					И СостояниеОплатыАванса.ПродажаНаЭкспорт = Ложь
	|				ТОГДА АвансыВычеты.Количество * СостоянияОплатыАванса.НалоговаяСтавка * 10
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаАвансаПоАкцизамНачисленоТекущийПериод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(АвансыВычеты.Период, МЕСЯЦ) = &НачалоПериода
	|					И СостоянияОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.ОформленВычет)
	|					И СостояниеОплатыАванса.ПродажаНаЭкспорт = Ложь
	|				ТОГДА АвансыВычеты.Количество * СостоянияОплатыАванса.НалоговаяСтавка * 10
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРассчитанВычетТекущийПериод,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ НАЧАЛОПЕРИОДА(АвансыВычеты.Период, МЕСЯЦ) = &НачалоПериода
	|					И СостоянияОплатыАванса.Статус = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.ОформленВычет)
	|					И СостояниеОплатыАванса.ПродажаНаЭкспорт = Ложь
	|				ТОГДА АвансыВычеты.Количество * СостоянияОплатыАванса.НалоговаяСтавка * 10
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРассчитанВычетПрошлыеПериоды
	|ПОМЕСТИТЬ АвансыВычетыПобанковскимГарантиям
	|ИЗ
	|	АвансыВычеты КАК АвансыВычеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_СостоянияОплатыАванса КАК СостоянияОплатыАванса
	|		ПО АвансыВычеты.СостояниеОплатыАванса = СостоянияОплатыАванса.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансыВычеты.БанковскаяГарантия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АвансыВычеты";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция бг_ТекстЗапросаДанныеДеклараций()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеБанковскихГарантий.БанковскаяГарантия КАК БанковскаяГарантия,
	|	ВЫБОР КОГДА ISNULL(ISNULL(ISNULL(ДанныеПоОборотамПоКонецПериода.РасчетныйСрокБГ, ОстаткиАкцизов.РасчетныйСрокБГ), АвансыВычеты.РасчетныйСрокБГ), 100) = 100
	|		ТОГДА ""2""
	|		ИНАЧЕ ""1""
	|	КОНЕЦ КАК ПризнакБанковскойГарантии,
	|	ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.ВидПодакцизныхТоваров.Код КАК КодВидаСпирта,
	|	ДанныеБанковскихГарантий.НомерБанковскойГарантии КАК НомерБанковскойГарантии,
	|	ДанныеБанковскихГарантий.ПериодИстеченияБанковскойГарантии КАК ПериодИстеченияБанковскойГарантии,
	|	ДанныеБанковскихГарантий.ДатаВыдачи КАК ДатаВыдачи,
	|	ДанныеБанковскихГарантий.ДатаНачалаСрокаДействия КАК ДатаНачалаСрокаДействия,
	|	ДанныеБанковскихГарантий.ДатаОкончанияСрокаДействия КАК ДатаОкончанияСрокаДействия,
	|	ДанныеБанковскихГарантий.СуммаБанковскойГарантии КАК СуммаБанковскойГарантии,
	|	ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.РегистрационныйНомерИзвещения КАК РегистрационныйНомерИзвещения,
	|	ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.НомерИзвещения КАК НомерИзвещения,
	|	ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.ДатаРегистрацииИзвещения КАК ДатаРегистрацииИзвещения,
	|	ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения КАК КорНомерИзвещения,
	|	ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорДатаИзвещения КАК КорДатаИзвещения,
	|	ВЫБОР КОГДА ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"
	|		ТОГДА ДанныеБанковскихГарантий.ИННОрганизации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КорИННОрганизации,
	|	ВЫБОР КОГДА ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"
	|		ТОГДА ДанныеБанковскихГарантий.КППОрганизации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КорКППОрганизации,
	|	ВЫБОР КОГДА ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"
	|		ТОГДА ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.ВидПодакцизныхТоваров.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КорКодВидаСпирта,
	|	ВЫБОР КОГДА ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"
	|		ТОГДА ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемЗакупленногоСпирта, 0)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КорОбъемЭтиловогоСпирта,
	|	ВЫБОР КОГДА ДанныеБанковскихГарантий.БанковскаяГарантия.Родитель.КорНомерИзвещения <> """"
	|		ТОГДА ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьЗакупленногоСпирта, 0)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КорСуммаАвансовогоПлатежаАкциза,
	|	ДанныеБанковскихГарантий.СуммаАвансовогоПлатежаПоБанковскойГарантии КАК СуммаАвансовогоПлатежаПоБанковскойГарантии,
	|	ДанныеБанковскихГарантий.ИННОрганизации КАК ИННОрганизации,
	|	ДанныеБанковскихГарантий.КППОрганизации КАК КППОрганизации,
	|	ДанныеБанковскихГарантий.ОбъемСпиртаПоБанковскойГарантии КАК ОбъемСпиртаПоБанковскойГарантии,
	|	ДанныеБанковскихГарантий.КодВидаПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемЗакупленногоСпирта, 0) КАК ОбъемЗакупленногоСпирта,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьЗакупленногоСпирта, 0) КАК СтоимостьЗакупленногоСпирта,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемПоступившегоСпирта, 0) КАК ОбъемПоступившегоСпирта,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьПоступившегоСпирта, 0) КАК СтоимостьПоступившегоСпирта,
	|	ЕСТЬNULL(ОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукции, 0) КАК ОстатокСпиртаВНереализованнойПродукции,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0) КАК ОбъемРеализованногоСпиртаЗаПериод,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0) КАК СтоимостьРеализованногоСпиртаЗаПериод,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодПодтверждено, 0) КАК ОбъемРеализованногоСпиртаЗаПериодПодтверждено,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодПодтверждено, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодПодтверждено,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтвержденоЕАЭС,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК ОбъемРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0) КАК ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0) КАК СтоимостьРеализованногоСпиртаКПодтверждениюПрошлыеПериоды,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпирта, 0) КАК ОбъемСписанногоПоНормеСпирта,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпирта, 0) КАК СтоимостьСписанногоПоНормеСпирта,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпирта, 0) КАК ОбъемСписанногоСверхНормыСпирта,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоСверхНормыСпирта, 0) КАК СтоимостьСписанногоСверхНормыСпирта,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемПоступившегоСпирта, 0) - ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0)
	|							- ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) 
	|							- ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0)
	|							- ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПрошлыеПериоды, 0)
	|							- ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюПрошлыеПериоды, 0)
	|							- ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпирта, 0)
	|							- ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпирта, 0) КАК ОстатокСпиртаРасчетный,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0)
	|							+ ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПрошлыеПериоды, 0) КАК ОбщаяСтоимостьРеализованногоСпирта,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК ОбъемРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпирта, 0) КАК СтоимостьСписанногоПоНормеСпиртаИтого,
	|	ЕСТЬNULL(ОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукцииКонецПериода, 0) КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериода,
	|	ЕСТЬNULL(ОстаткиАкцизов.СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода, 0)
	|							+ ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаКПодтверждениюВесьПериод, 0) КАК СтоимостьОстаткаСпиртаВНереализованнойПродукцииКонецПериода,
	|	ЕСТЬNULL(ОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукции, 0) КАК ОстатокСпиртаВНереализованнойПродукцииРаздел4,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериод, 0) КАК ОбъемРеализованногоСпиртаЗаПериодРаздел4,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериод, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодРаздел4,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюРаздел4,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждению, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюРаздел4,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК ОбъемРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭСРаздел4,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭС, 0) КАК СтоимостьРеализованногоСпиртаЗаПериодКПодтверждениюЕАЭСРаздел4,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемСписанногоПоНормеСпиртаЗаПериод, 0) КАК ОбъемСписанногоПоНормеСпиртаЗаПериод,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоПоНормеСпиртаЗаПериод, 0) КАК СтоимостьСписанногоПоНормеСпиртаЗаПериод,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.ОбъемСписанногоСверхНормыСпиртаЗаПериод, 0) КАК ОбъемСписанногоСверхНормыСпиртаЗаПериод,
	|	ЕСТЬNULL(ДанныеПоОборотамПоКонецПериода.СтоимостьСписанногоСверхНормыСпиртаЗаПериод, 0) КАК СтоимостьСписанногоСверхНормыСпиртаЗаПериод,
	|	ЕСТЬNULL(ОстаткиАкцизов.ОстатокСпиртаВНереализованнойПродукцииКонецПериода, 0) КАК ОстатокСпиртаВНереализованнойПродукцииКонецПериодаРаздел4,
	|	ЕСТЬNULL(АвансыВычеты.СуммаАвансаПоАкцизам, 0) КАК СуммаАвансаПоАкцизам,
	|	ЕСТЬNULL(АвансыВычеты.СуммаАвансаПоАкцизам, 0) - ЕСТЬNULL(АвансыВычеты.СуммаАвансаПоАкцизамНачисленоТекущийПериод, 0)
	|								- ЕСТЬNULL(АвансыВычеты.СуммаРассчитанВычетПрошлыеПериоды, 0) КАК СуммаНеЗачтенногоАвансаПоАкцизамНачалоПериода,
	|	ЕСТЬNULL(АвансыВычеты.СуммаРассчитанВычетТекущийПериод, 0) КАК СуммаЗачтенногоАвансаПоАкцизамТекущийПериод,
	|	ЕСТЬNULL(АвансыВычеты.СуммаАвансаПоАкцизам, 0) - ЕСТЬNULL(АвансыВычеты.СуммаРассчитанВычетПрошлыеПериоды, 0)
	|							- ЕСТЬNULL(АвансыВычеты.СуммаРассчитанВычетТекущийПериод, 0) КАК СуммаНеЗачтенногоАвансаПоАкцизам
	|ИЗ
	|	ДанныеБанковскихГарантий КАК ДанныеБанковскихГарантий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоОборотамПоКонецПериода КАК ДанныеПоОборотамПоКонецПериода
	|		ПО ДанныеБанковскихГарантий.БанковскаяГарантия = ДанныеПоОборотамПоКонецПериода.БанковскаяГарантия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиАкцизов КАК ОстаткиАкцизов
	|		ПО ДанныеБанковскихГарантий.БанковскаяГарантия = ОстаткиАкцизов.БанковскаяГарантия
	|		ЛЕВОЕ СОЕДИНЕНИЕ АвансыВычетыПобанковскимГарантиям КАК АвансыВычеты
	|		ПО ДанныеБанковскихГарантий.БанковскаяГарантия = АвансыВычеты.БанковскаяГарантия
	|
	|УПОРЯДОЧИТЬ ПО 
	|	НомерИзвещения,
	|	НомерБанковскойГарантии";
	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
