
#Область СлужебныйПрограммныйИнтерфейс

&Вместо("ТаблицаСоответствияДокументовТипамЕГАИС")
Функция бг_ТаблицаСоответствияДокументовТипамЕГАИС() Экспорт
	
	Таблица = ПродолжитьВызов();
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("ClaimIssueFSM");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗаявлениеОВыдачеФСМ;
	НоваяСтрока.ПространствоИмен  = "ClaimIssueFSM";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("TTNIssueFSM");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_НакладнаяНаВыдачуФСМ;
	НоваяСтрока.ПространствоИмен  = "TTNIssueFSM";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RepImportedProduct_v4");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ОтчетОбИмпортеПродукцииЕГАИС;
	НоваяСтрока.ПространствоИмен  = "RepImportedProduct_v4";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RepProducedProduct_v5");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V5;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ОтчетОПроизводствеЕГАИС;
	НоваяСтрока.ПространствоИмен  = "RepProducedProduct_v5";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RepInformF1Reg");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве;
	НоваяСтрока.ПространствоИмен  = "RepInformF1Reg";

	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("QueryRejectRepImported");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗапросНаОтменуПроведенияОтчетаОбИмпорте;
	НоваяСтрока.ПространствоИмен  = "QueryRejectRepImported";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("QueryRejectRepProduced");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗапросНаОтменуПроведенияОтчетаОПроизводстве;
	НоваяСтрока.ПространствоИмен  = "QueryRejectRepProduced";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RequestRepealIPI");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗапросНаОтменуПроведенияПланируемогоВвоза;
	НоваяСтрока.ПространствоИмен  = "RequestRepealIPI";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("QuerySSP_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗапросССП;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("ReplySSP_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ОтветНаЗапросССП;

	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RequestAddProducts");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ДобавлениеНовойПродукцииЕГАИС;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("InvoicePlannedImport");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ПланируемыйВвозЕГАИС;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("ReportDestructionAMFSM");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_АктОбУничтоженииФСМ;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = "FrapClaims";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_УведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС;
	
	Возврат Таблица;
	
КонецФункции	

&Вместо("ПрефиксПространстваИмен")
Функция бг_ПрефиксПространстваИмен(ПространствоИмен) Экспорт
	
	Если ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ClaimIssueFSM") Тогда
		Возврат "fsm";
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/FrapClaims") Тогда
		Возврат "nbt";
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/InvoicePlannedImport") Тогда
		Возврат "ipi";
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/RepProducedProduct_v5") Тогда
		Возврат "rpp";
	Иначе
		Возврат ПродолжитьВызов(ПространствоИмен);
	КонецЕсли;	

КонецФункции

#КонецОбласти
