
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ)
	
	бг_ЗаполнитьКодСтраныЧислом();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ЗаполнитьКодСтраныЧислом()
	
	Если ПустаяСтрока(СокрЛП(Код)) Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаКода = Метаданные.Справочники.СтраныМира.ДлинаКода;
	ОписаниеТипаЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаКода, 0, ДопустимыйЗнак.Неотрицательный);
	бг_КодСтраныЧислом = ОписаниеТипаЧисло.ПривестиЗначение(СокрЛП(Код));
	
КонецПроцедуры

#КонецОбласти
