#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_WMS.ДобавитьПолеТипПриемки(ЭтаФорма);
	бг_ДобавитьПолеГУИДГруппыКонтрагентовУПП();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьПолеГУИДГруппыКонтрагентовУПП();
	
	бг_ГУИДГруппыКонтрагентовУПП = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"бг_ГУИДГруппыКонтрагентовУПП", 
		Элементы.ГруппаОтветственный,
		"Объект.бг_ГУИДГруппыКонтрагентовУПП");
	
КонецПроцедуры;

#КонецОбласти
