#Область ПрограммныйИнтерфейс

&Вместо("СтруктураСтрокиНоменклатуры")
Функция бг_СтруктураСтрокиНоменклатуры() Экспорт
	
	СтруктураСтроки = ПродолжитьВызов();
	СтруктураСтроки.Вставить("бг_УпаковкаПаллета");
	
	Возврат СтруктураСтроки;
	
КонецФункции

&Вместо("ПараметрыТовара")
Функция бг_ПараметрыТовара(Номенклатура = Неопределено) Экспорт

	ПараметрыТовара = ПродолжитьВызов(Номенклатура);
 	ПараметрыТовара.Вставить(
			"бг_УпаковкаПаллета", 
			ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	
	Возврат ПараметрыТовара;

КонецФункции
	
#КонецОбласти	
