#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьСвязанныеОбъекты(НаборЗаписей) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаДокументов = НаборЗаписей.Выгрузить(, "Документ");
	ТаблицаДокументов.Свернуть("Документ");
	ДокументыНабора = ТаблицаДокументов.ВыгрузитьКолонку("Документ");
	
	ТипыДокументовКВыгрузке = ТипыДокументовКВыгрузке();
	
	Для Каждого Документ Из ДокументыНабора Цикл
		Если ТипыДокументовКВыгрузке.Найти(ТипЗнч(Документ)) <> Неопределено Тогда
			бг_ОбщегоНазначенияСервер.ЗарегистрироватьИсходящееСообщениеПриЗаписи(Документ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // Конец ВыгрузитьСвязанныеОбъекты

#Область СлужебныеПроцедурыИФункции

Функция ТипыДокументовКВыгрузке()
	
	ТипыДокументовКВыгрузке = Новый Массив;
	
	ТипыДокументовКВыгрузке.Добавить(Тип("ДокументСсылка.битЗаявлениеОВыдачеФСМ"));
	ТипыДокументовКВыгрузке.Добавить(Тип("ДокументСсылка.битОтчетОПроизводствеЕГАИС"));
	ТипыДокументовКВыгрузке.Добавить(Тип("ДокументСсылка.битАктОбУничтоженииФСМ"));
	
	Возврат ТипыДокументовКВыгрузке;
	
КонецФункции

#КонецОбласти // Конец СлужебныеПроцедурыИФункции
