#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Отбор.Элементы.Очистить();
	
	Если Параметры.Свойство("ОбъектERP") тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = Параметры.ОбъектERP;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбъектERP");
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.Использование = Истина;
		Отбор.Использование = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти