
#Область ОбработчикиСобытий

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	бг_ДобавитьЭлементыФормы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьЭлементыФормы()

	ЭлементИсключитьИзУровняСервисаSL = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"бг_ИсключитьИзУровняСервисаSL",
		ЭтаФорма,
		"Объект.бг_ИсключитьИзУровняСервисаSL",,,
		"ПолеФлажка");
	
КонецПроцедуры

#КонецОбласти
