
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("КлючНазначенияФормы", "ЗаявкиКлиентовСобственныхКонтрагентов");
	
	ОткрытьФорму("Обработка.бг_ЖурналДокументовЗаявкиКлиентовСобственныхКонтрагентов.Форма.СписокДокументов", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
