
&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Источник) Тогда
		
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Элементы.Источник.Заголовок = НСтр("ru = 'Договор'; en = 'Contract'");
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.битПунктыНазначения") Тогда
			Элементы.Источник.Заголовок = НСтр("ru = 'Пункт назначения'; en = 'Destination point'");
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.битКаналыПродаж") Тогда
			Элементы.Источник.Заголовок = НСтр("ru = 'Канал продаж'; en = 'Sales channel'");
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.битТерриторииПунктовНазначения") Тогда
			Элементы.Источник.Заголовок = НСтр("ru = 'Территория'; en = 'Territorie'");
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Контрагенты") Тогда
			Элементы.Источник.Заголовок = НСтр("ru = 'Контрагенты'; en = 'Counterparties'");
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.СегментыПартнеров") Тогда
			Элементы.Источник.Заголовок = НСтр("ru = 'Сегменты партнеров'; en = 'Partner segments'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
