#Область ПрограммныйИнтерфейс 

Процедура бг_ОтформатироватьНаименованиеПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Метаданные().ДлинаНаименования = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
		Источник.НаименованиеПолное = ВернутьСтрокуБезЗначащихСимволов(Источник.НаименованиеПолное);
	Иначе
		Источник.Наименование = ВернутьСтрокуБезЗначащихСимволов(Источник.Наименование);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции       

Функция ВернутьСтрокуБезЗначащихСимволов(Знач ТекущаяСтрока)
	
	//1. пробелы в начале и в конце
	Результат = СокрЛП(ТекущаяСтрока);
	
	//2. задвоенные пробелы
	Результат = ЗаменитьПовторяющийСимвол(Результат, Символы.НПП, " ");
	Результат = ЗаменитьПовторяющийСимвол(Результат, "  ", " "); 
	
	//3. переносы строк
	Результат = ЗаменитьПовторяющийСимвол(Результат, Символы.ПС, "");
	
	Возврат Результат;
	
КонецФункции   

Функция ЗаменитьПовторяющийСимвол(Знач ТекущаяСтрока, ПодстрокаПоиска, ПодстрокаЗамены)
	
	Результат = ТекущаяСтрока;
	
	Пока Истина Цикл
		
		Если СтрЧислоВхождений(Результат, ПодстрокаПоиска) = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, ПодстрокаПоиска, ПодстрокаЗамены);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти