#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция бг_КонтрагентСвязанногоОбъекта(Объект = Неопределено, Ссылка = Неопределено) Экспорт

	Контрагент = Неопределено;
	
	Если Объект <> Неопределено Тогда
		
		ТипОбъекта = ТипЗнч(Объект);
		Если ТипОбъекта = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда
			Контрагент = Объект.Контрагент;
		ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.БанковскиеСчетаКонтрагентов")
			Или ТипОбъекта = Тип("СправочникОбъект.ЛицензииПоставщиковАлкогольнойПродукции") Тогда
			Контрагент = Объект.Владелец;
		КонецЕсли;
		
	ИначеЕсли Ссылка <> Неопределено Тогда
		
		ТипСсылки = ТипЗнч(Ссылка);
		Если ТипСсылки = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Контрагент");
		ИначеЕсли ТипСсылки = Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов")
			Или ТипСсылки = Тип("СправочникСсылка.ЛицензииПоставщиковАлкогольнойПродукции") Тогда
			Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Владелец");
		КонецЕсли;

	КонецЕсли;

	Возврат Контрагент;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли