#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриКопировании")
Процедура бг_ПриКопировании(ОбъектКопирования)
	
	бг_КодSAP 								  = "";
	бг_EDI_ИД 								  = "";	
	бг_EDI_Наименование 					  = "";
	бг_GLNПолучателя 						  = ""; 
	бг_Код 									  = "";
	бг_КодКлиентаSY 						  = "";
	бг_КодПроизводителейИМаркировщиковИмпорта = "";
	бг_КППКрупнейшегоНалогоплательщика 		  = "";
	бг_НаименованиеКонтрагентаВБанкеФакторе   = "";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
