#Область ПрограммныйИнтерфейс

&После("ОпределитьОбъектыСКомандамиОтчетов")
Процедура бг_ОпределитьОбъектыСКомандамиОтчетов(Объекты)
	
	Объекты.Добавить(Метаданные.Документы.битОтражениеФактаПоПриходномуОрдеру);
	Объекты.Добавить(Метаданные.Документы.битОтражениеФактаПоРасходномуОрдеру);
	Объекты.Добавить(Метаданные.Документы.битОтчетОПроизводствеЕГАИС);
	Объекты.Добавить(Метаданные.Документы.битПереупаковка);
	Объекты.Добавить(Метаданные.Документы.битПоступлениеДенежныхСредствОтРозничногоПокупателя);
	
КонецПроцедуры

#КонецОбласти
