#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ")
Функция бг_ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект)

	СтруктураЗаполненияЦены = Новый Структура;
	СтруктураЗаполненияЦены.Вставить("Дата",       Объект.Дата);
#Вставка
	// требуется чтобы цены брались на дату отгрузки
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента")
		И Объект.НеОтгружатьЧастями 
		И ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		СтруктураЗаполненияЦены.Вставить("Дата", Объект.ДатаОтгрузки);
	КонецЕсли;
#КонецВставки
	СтруктураЗаполненияЦены.Вставить("Валюта",     Объект.Валюта);
	СтруктураЗаполненияЦены.Вставить("Соглашение", Объект.Соглашение);
	СтруктураЗаполненияЦены.Вставить("Партнер",    Объект.Партнер);
	СтруктураЗаполненияЦены.Вставить("Ссылка",     Объект.Ссылка);

	Возврат СтруктураЗаполненияЦены;

КонецФункции

#КонецОбласти