
&ИзменениеИКонтроль("МенеджерОбъектаПоСсылке")
Функция бг_МенеджерОбъектаПоСсылке(Ссылка)

	ИмяОбъекта = Ссылка.Метаданные().Имя;
	ТипСсылки = ТипЗнч(Ссылка);

	Если Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Справочники[ИмяОбъекта];
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Документы[ИмяОбъекта];

	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат БизнесПроцессы[ИмяОбъекта];

	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовХарактеристик[ИмяОбъекта];

	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыСчетов[ИмяОбъекта];

	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовРасчета[ИмяОбъекта];

	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Задачи[ИмяОбъекта];

	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыОбмена[ИмяОбъекта];

	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Перечисления[ИмяОбъекта];
	Иначе
		#Вставка
		Для Каждого Справочник Из Метаданные.Справочники Цикл
			Если Справочник.Имя = ИмяОбъекта Тогда 	
				Возврат	Справочники[ИмяОбъекта];
			КонецЕсли;	
		КонецЦикла;
		#КонецВставки
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&ИзменениеИКонтроль("НоваяСборка")
Функция бг_НоваяСборка(ТекущаяСборка)
	
	Если СтрНайти("8.3.22.1672,8.3.22.1603", ТекущаяСборка) Тогда
		Возврат "8.3.22.1709";
		
	ИначеЕсли СтрНайти("8.3.21.1607,8.3.21.1508,8.3.21.1484", ТекущаяСборка) Тогда
#Удаление
		Возврат "8.3.21.1624";
#КонецУдаления
#Вставка
		Возврат "8.3.21.1622";
#КонецВставки
		
	ИначеЕсли СтрНайти("8.3.20.2076,8.3.20.2039", ТекущаяСборка) Тогда
		Возврат "8.3.20.2184";
		
	ИначеЕсли СтрНайти("8.3.19.1665,8.3.19.1659", ТекущаяСборка) Тогда
		Возврат "8.3.19.1726";
		
	ИначеЕсли СтрНайти("8.3.18.1902,8.3.18.1894", ТекущаяСборка) Тогда
		Возврат "8.3.18.1959";
		
	ИначеЕсли СтрНайти("8.3.17.2733,8.3.17.2665,8.3.17.2757", ТекущаяСборка) Тогда
		Возврат "8.3.17.2760";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции
