
&ИзменениеИКонтроль("ТекстОтраженияВРеглУчете")
Функция бг_ТекстОтраженияВРеглУчете() Экспорт

	ТекстыОтражения = Новый Массив;
	//++ Локализация

#Область ТекстРезервыПоСомнительнымДолгамСКлиентом
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности покупателя за счет резервов (Дт <63> :: Кт <62.1>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Резервы.СуммаРегл КАК Сумма,
	|	Резервы.СуммаУпр КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПустаяСсылка) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	Резервы.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	Резервы.Подразделение КАК ПодразделениеДт,
	|	Резервы.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам) КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	Резервы.РасчетныйДокумент КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Резервы.СуммаРегл - Резервы.ПостояннаяРазница - Резервы.ВременнаяРазница КАК СуммаНУДт,
	|	Резервы.ПостояннаяРазница КАК СуммаПРДт,
	|	Резервы.ВременнаяРазница КАК СуммаВРДт,
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)
	|	КОНЕЦ КАК ВидСчетаКт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	// Валютная сумма целиком отражается в первой проводке резерва.
	|	
	|	ВЫБОР КОГДА РезервыПервые.Ссылка ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Расчеты.Предоплата + Расчеты.Долг КОНЕЦ КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности покупателя за счет резервов по сомнительным долгам"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаВнеоборотныеАктивы
	|	ПО
	|		Операция.УдалитьСтатьяРасходов = СтатьиНаВнеоборотныеАктивы.Ссылка
	|		И СтатьиНаВнеоборотныеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО
	|		Операция.УдалитьСтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО 
	|		ОбъектыСтроительства.Ссылка = Операция.УдалитьАналитикаРасходов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоАналитике КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК РезервыПервые
	|	ПО
	|		Резервы.Ссылка = РезервыПервые.Ссылка
	|		И Резервы.НомерСтроки = РезервыПервые.НомерСтроки
	|ГДЕ
	|	Операция.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеДебиторскойЗадолженностиРасчетыСКлиентомСтарое
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности покупателя на расходы, прочие активы Дт <91.2, Прочие счета> :: Кт <62.1>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр - ЕСТЬNULL(Резервы.СуммаУпр, 0) КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	ДоходыРасходы.Статья КАК АналитикаУчетаДт,
	|	ДоходыРасходы.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ДоходыРасходы.Подразделение КАК ПодразделениеДт,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		ИНАЧЕ Расчеты.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельностиДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДоходыРасходы.Статья
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДоходыРасходы.АналитикаРасходов 
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|		КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка)
	|		ТОГДА ОбъектыСтроительства.СпособСтроительства
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаНУДт,
	|	-ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) КАК СуммаПРДт,
	|	-ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаВРДт,
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)
	|	КОНЕЦ КАК ВидСчетаКт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР КОГДА Резервы.Ссылка ЕСТЬ NULL ТОГДА Расчеты.Предоплата + Расчеты.Долг ИНАЧЕ 0 КОНЕЦ КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА ""Списание задолженности покупателя на прочие активы""
	|		ИНАЧЕ ""Списание задолженности покупателя на расходы""
	|	КОНЕЦ КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.КорректировкаЗадолженности.ДоходыРасходыАктивыПассивы КАК ДоходыРасходы
	|	ПО 
	|		ДокументыКОтражению.Ссылка = ДоходыРасходы.Ссылка 
	|		И ДоходыРасходы.НомерСтроки = 1
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|	ПО
	|		ДоходыРасходы.Статья = СтатьиРасходов.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|		И Расчеты.СтарыйАлгоритм
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО
	|		ОбъектыСтроительства.Ссылка = ДоходыРасходы.АналитикаРасходов
	|		И СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|ГДЕ
	|	Операция.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеДебиторскойЗадолженностиРасчетыСКлиентомНаСтатьиАктивовПассивовСтарое
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности покупателя на прочие активы пассивы ( :: Кт <62.1>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр - ЕСТЬNULL(Резервы.СуммаУпр, 0) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	Расчеты.Валюта КАК ВалютаДт,
	|	ДоходыРасходы.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НастройкиСчетовУчета.СчетУчета КАК СчетДт,
	|
	|	НастройкиСчетовУчета.Субконто1 КАК СубконтоДт1,
	|	НастройкиСчетовУчета.Субконто2 КАК СубконтоДт2,
	|	НастройкиСчетовУчета.Субконто3 КАК СубконтоДт3,
	|
	|	ВЫБОР КОГДА Резервы.Ссылка ЕСТЬ NULL ТОГДА Расчеты.Предоплата + Расчеты.Долг ИНАЧЕ 0 КОНЕЦ КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаНУДт,
	|	-ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) КАК СуммаПРДт,
	|	-ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаВРДт,
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)
	|	КОНЕЦ КАК ВидСчетаКт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР КОГДА Резервы.Ссылка ЕСТЬ NULL ТОГДА Расчеты.Предоплата + Расчеты.Долг ИНАЧЕ 0 КОНЕЦ КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности покупателя на активы\пассивы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.КорректировкаЗадолженности.ДоходыРасходыАктивыПассивы КАК ДоходыРасходы
	|	ПО 
	|		ДокументыКОтражению.Ссылка = ДоходыРасходы.Ссылка 
	|		И ДоходыРасходы.НомерСтроки = 1
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
	|	ПО
	|		ДоходыРасходы.Статья = СтатьиАктивовПассивов.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.НастройкиСчетовУчетаПрочихОпераций КАК НастройкиСчетовУчета
	|	ПО
	|		ДоходыРасходы.НастройкаСчетовУчета = НастройкиСчетовУчета.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|		И Расчеты.СтарыйАлгоритм
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|	
	|ГДЕ
	|	Операция.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстРезервыПоСомнительнымДолгамСПоставщиком
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности поставщика за счет резервов (Дт <63> :: Кт <60.2>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Резервы.СуммаРегл КАК Сумма,
	|	Резервы.СуммаУпр КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПустаяСсылка) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	Резервы.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	Резервы.Подразделение КАК ПодразделениеДт,
	|	Резервы.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам) КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	Резервы.РасчетныйДокумент КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Резервы.СуммаРегл - Резервы.ПостояннаяРазница - Резервы.ВременнаяРазница КАК СуммаНУДт,
	|	Резервы.ПостояннаяРазница КАК СуммаПРДт,
	|	Резервы.ВременнаяРазница КАК СуммаВРДт,
	|
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)
	|	КОНЕЦ КАК ВидСчетаКт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР КОГДА Резервы.Ссылка ЕСТЬ NULL ТОГДА Расчеты.Предоплата + Расчеты.Долг ИНАЧЕ 0 КОНЕЦ КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности поставщика за счет резервов по сомнительным долгам"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоАналитике КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК РезервыПервые
	|	ПО
	|		Резервы.Ссылка = РезервыПервые.Ссылка
	|		И Резервы.НомерСтроки = РезервыПервые.НомерСтроки
	|ГДЕ
	|	Операция.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеДебиторскойЗадолженностиРасчетыСПоставщикомСтарое
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности поставщика на расходы (Дт <91.2, Прочие счета> :: Кт <60.2>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр - ЕСТЬNULL(Резервы.СуммаУпр, 0) КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДоходыРасходы.Статья
	|	КОНЕЦ КАК АналитикаУчетаДт,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДоходыРасходы.Подразделение
	|	КОНЕЦ КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ДоходыРасходы.Подразделение КАК ПодразделениеДт,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		ИНАЧЕ Расчеты.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДоходыРасходы.Статья
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДоходыРасходы.АналитикаРасходов
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|		КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка)
	|		ТОГДА ОбъектыСтроительства.СпособСтроительства
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаНУДт,
	|	-ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) КАК СуммаПРДт,
	|	-ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаВРДт,
	|
	|
	|	ВЫБОР
	|		КОГДА Расчеты.ДолгРегл <> 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)
	|	КОНЕЦ КАК ВидСчетаКт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР КОГДА Резервы.Ссылка ЕСТЬ NULL ТОГДА Расчеты.Предоплата + Расчеты.Долг ИНАЧЕ 0 КОНЕЦ КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|		ТОГДА ""Списание задолженности поставщика на прочие активы""
	|		ИНАЧЕ ""Списание задолженности поставщика на расходы""
	|	КОНЕЦ КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.КорректировкаЗадолженности.ДоходыРасходыАктивыПассивы КАК ДоходыРасходы
	|	ПО 
	|		ДокументыКОтражению.Ссылка = ДоходыРасходы.Ссылка 
	|		И ДоходыРасходы.НомерСтроки = 1
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|	ПО
	|		ДоходыРасходы.Статья = СтатьиРасходов.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|		И Расчеты.СтарыйАлгоритм
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО
	|		ОбъектыСтроительства.Ссылка = ДоходыРасходы.АналитикаРасходов
	|		И СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|ГДЕ
	|	Операция.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеДебиторскойЗадолженностиРасчетыСПоставщикомНаСтатьиАктивовПассивовСтарое
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности поставщика на прочие активы пассивы (:: Кт <60.2>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр - ЕСТЬNULL(Резервы.СуммаУпр, 0) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	Расчеты.Валюта КАК ВалютаДт,
	|	ДоходыРасходы.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НастройкиСчетовУчета.СчетУчета КАК СчетДт,
	|
	|	НастройкиСчетовУчета.Субконто1 КАК СубконтоДт1,
	|	НастройкиСчетовУчета.Субконто2 КАК СубконтоДт2,
	|	НастройкиСчетовУчета.Субконто3 КАК СубконтоДт3,
	|
	|	ВЫБОР КОГДА Резервы.Ссылка ЕСТЬ NULL ТОГДА Расчеты.Предоплата + Расчеты.Долг ИНАЧЕ 0 КОНЕЦ КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаНУДт,
	|	-ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) КАК СуммаПРДт,
	|	-ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаВРДт,
	|
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)
	|	КОНЕЦ КАК ВидСчетаКт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР КОГДА Резервы.Ссылка ЕСТЬ NULL ТОГДА Расчеты.Предоплата + Расчеты.Долг ИНАЧЕ 0 КОНЕЦ КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности поставщика на активы\пассивы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.КорректировкаЗадолженности.ДоходыРасходыАктивыПассивы КАК ДоходыРасходы
	|	ПО 
	|		ДокументыКОтражению.Ссылка = ДоходыРасходы.Ссылка 
	|		И ДоходыРасходы.НомерСтроки = 1
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
	|	ПО
	|		ДоходыРасходы.Статья = СтатьиАктивовПассивов.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.НастройкиСчетовУчетаПрочихОпераций КАК НастройкиСчетовУчета
	|	ПО
	|		ДоходыРасходы.НастройкаСчетовУчета = НастройкиСчетовУчета.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|		И Расчеты.СтарыйАлгоритм
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|
	|ГДЕ 
	|	Операция.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеКредиторскойЗадолженностиРасчетыСКлиентомСтарое
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности перед покупателем в доходы (Дт <62.2> :: Кт <91.1>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр КАК СуммаУУ,
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)
	|	КОНЕЦ КАК ВидСчетаДт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	Расчеты.Предоплата + Расчеты.Долг КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДоходыРасходы.Статья КАК АналитикаУчетаКт,
	|	ДоходыРасходы.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ДоходыРасходы.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	ДоходыРасходы.Статья КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности перед покупателем в доходы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.КорректировкаЗадолженности.ДоходыРасходыАктивыПассивы КАК ДоходыРасходы
	|	ПО 
	|		ДокументыКОтражению.Ссылка = ДоходыРасходы.Ссылка 
	|		И ДоходыРасходы.НомерСтроки = 1
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|		И Расчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиДоходов КАК СтатьиДоходов
	|	ПО
	|		ДоходыРасходы.Статья = СтатьиДоходов.Ссылка
	|
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеКредиторскойЗадолженностиРасчетыСКлиентомНаСтатьиАктивовПассивовСтарое
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности перед покупателем в прочие активы пассивы (Дт <62.2> :: )
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр КАК СуммаУУ,
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)
	|	КОНЕЦ КАК ВидСчетаДт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	Расчеты.Предоплата + Расчеты.Долг КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	Расчеты.Валюта КАК ВалютаКт,
	|	ДоходыРасходы.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НастройкиСчетовУчета.СчетУчета КАК СчетКт,
	|
	|	НастройкиСчетовУчета.Субконто1 КАК СубконтоКт1,
	|	НастройкиСчетовУчета.Субконто2 КАК СубконтоКт2,
	|	НастройкиСчетовУчета.Субконто3 КАК СубконтоКт3,
	|
	|	Расчеты.Предоплата + Расчеты.Долг КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности перед покупателем в активы/пассивы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.КорректировкаЗадолженности.ДоходыРасходыАктивыПассивы КАК ДоходыРасходы
	|	ПО 
	|		ДокументыКОтражению.Ссылка = ДоходыРасходы.Ссылка 
	|		И ДоходыРасходы.НомерСтроки = 1
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
	|	ПО
	|		ДоходыРасходы.Статья = СтатьиАктивовПассивов.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.НастройкиСчетовУчетаПрочихОпераций КАК НастройкиСчетовУчета
	|	ПО
	|		ДоходыРасходы.НастройкаСчетовУчета = НастройкиСчетовУчета.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|		И Расчеты.СтарыйАлгоритм
	|
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеКредиторскойЗадолженностиРасчетыСПоставщикомСтарое
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности перед поставщиком в доходы (Дт <60.1> :: Кт <91.1>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр КАК СуммаУУ,
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)
	|	КОНЕЦ КАК ВидСчетаДт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	Расчеты.Предоплата + Расчеты.Долг КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДоходыРасходы.Статья КАК АналитикаУчетаКт,
	|	ДоходыРасходы.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ДоходыРасходы.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	ДоходыРасходы.Статья КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности перед поставщиком в доходы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.КорректировкаЗадолженности.ДоходыРасходыАктивыПассивы КАК ДоходыРасходы
	|	ПО 
	|		ДокументыКОтражению.Ссылка = ДоходыРасходы.Ссылка 
	|		И ДоходыРасходы.НомерСтроки = 1
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|		И Расчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиДоходов КАК СтатьиДоходов
	|	ПО
	|		ДоходыРасходы.Статья = СтатьиДоходов.Ссылка
	|	
	|ГДЕ 
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеКредиторскойЗадолженностиРасчетыСПоставщикомНаСтатьиАктивовПассивовСтарое
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание задолженности перед поставщиком в прочие активы пассивы (Дт <60.1> :: )
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр КАК СуммаУУ,
	|
	|	ВЫБОР КОГДА Расчеты.ДолгРегл <> 0 ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)
	|	КОНЕЦ КАК ВидСчетаДт,
	|
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	Расчеты.Предоплата + Расчеты.Долг КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	Расчеты.Валюта КАК ВалютаКт,
	|	ДоходыРасходы.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НастройкиСчетовУчета.СчетУчета КАК СчетКт,
	|
	|	НастройкиСчетовУчета.Субконто1 КАК СубконтоКт1,
	|	НастройкиСчетовУчета.Субконто2 КАК СубконтоКт2,
	|	НастройкиСчетовУчета.Субконто3 КАК СубконтоКт3,
	|
	|	Расчеты.Предоплата + Расчеты.Долг КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности перед поставщиком в активы/пассивы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.КорректировкаЗадолженности.ДоходыРасходыАктивыПассивы КАК ДоходыРасходы
	|	ПО 
	|		ДокументыКОтражению.Ссылка = ДоходыРасходы.Ссылка 
	|		И ДоходыРасходы.НомерСтроки = 1
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|		И Расчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
	|	ПО
	|		ДоходыРасходы.Статья = СтатьиАктивовПассивов.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.НастройкиСчетовУчетаПрочихОпераций КАК НастройкиСчетовУчета
	|	ПО
	|		ДоходыРасходы.НастройкаСчетовУчета = НастройкиСчетовУчета.Ссылка
	|	
	|ГДЕ 
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеВУбытокЗадолженностиЗабалансСКлиентом
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание в убыток задолженности неплатежеспособных дебиторов клиентов (Дт <007>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СписаннаяВУбытокЗадолженностьДебиторов) КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Расчеты.Предоплата + Расчеты.Долг КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание в убыток задолженности неплатежеспособных дебиторов"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам)
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеВУбытокЗадолженностиЗабалансСПоставщиком
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание в убыток задолженности неплатежеспособных дебиторов поставщиков (Дт <007>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл КАК Сумма,
	|	Расчеты.ПредоплатаУпр + Расчеты.ДолгУпр КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СписаннаяВУбытокЗадолженностьДебиторов) КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Расчеты.Предоплата + Расчеты.Долг КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание в убыток задолженности неплатежеспособных дебиторов"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаЗадолженности КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|	ПО
	|		Операция.Ссылка = Расчеты.Ссылка
	|		И Расчеты.ПредоплатаРегл + Расчеты.ДолгРегл <> 0
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам)
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти


#Область ТекстДебиторскаяЗадолженностьРасчетыСПоставщикомРасходы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Начисление/Списание задолженности поставщика на расходы (Дт <91.2> :: Кт <60.2>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.СуммаРегл
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -Расчеты.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаРегл, 0) КАК Сумма,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.СуммаУпр
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -Расчеты.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаУпр, 0) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	РегистрПрочиеРасходы.СтатьяРасходов КАК АналитикаУчетаДт,
	|	РегистрПрочиеРасходы.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	РегистрПрочиеРасходы.Подразделение КАК ПодразделениеДт,
	|	РегистрПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	РегистрПрочиеРасходы.СтатьяРасходов КАК СубконтоДт1,
	|	РегистрПрочиеРасходы.АналитикаРасходов КАК СубконтоДт2,
	|	РегистрПрочиеРасходы.ТипЗатрат КАК СубконтоДт3,
	|
	|	ВЫБОР
	|		КОГДА НЕ Резервы.Ссылка ЕСТЬ NULL
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.Сумма
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -Расчеты.Сумма
	|		ИНАЧЕ Расчеты.Сумма
	|	КОНЕЦ КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ВЫБОР
	|		КОГДА НЕ РегистрПрочиеРасходы.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -Расчеты.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|		ИНАЧЕ Расчеты.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|	КОНЕЦ КАК СуммаНУДт,
	|	ВЫБОР
	|		КОГДА РегистрПрочиеРасходы.ПринятиеКНалоговомуУчету
	|		ТОГДА -ЕСТЬNULL(Резервы.ПостояннаяРазница, 0)
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -Расчеты.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|		ИНАЧЕ Расчеты.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|	КОНЕЦ КАК СуммаПРДт,
	|	-ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаВРДт,
	|
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаКт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР
	|		КОГДА НЕ Резервы.Ссылка ЕСТЬ NULL ИЛИ НовыеРасчеты.НесколькоСтатей И РегистрПрочиеРасходы.НомерСтроки <> 1
	|		ТОГДА 0
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -Расчеты.Сумма
	|		ИНАЧЕ Расчеты.Сумма
	|	КОНЕЦ КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности)
	|			И Расчеты.ДокументОбъектаРасчетов ССЫЛКА Справочник.Претензии
	|		ТОГДА ""Выставлена претензия поставщику""
	|		КОГДА Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности)
	|		ТОГДА ""Начислена дебиторская задолженность""
	|		ИНАЧЕ ""Списание задолженности поставщика на расходы""
	|	КОНЕЦ КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеРасходы КАК РегистрПрочиеРасходы
	|	ПО
	|		Расчеты.Ссылка = РегистрПрочиеРасходы.Регистратор
	|		И РегистрПрочиеРасходы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСПоставщикамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|
	|ГДЕ
	|	(Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|	И Расчеты.НастройкаХозОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстДебиторскаяЗадолженностьРасчетыСПоставщикомПрочиеАктивыПассивы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Начисление/Списание задолженности поставщика на прочие активы/пассивы (Дт <Прочие счета> :: Кт <60.2>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаРегл, 0) КАК Сумма,
	|	ВЫБОР
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаУпр, 0) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	ПрочиеАктивыПассивы.Статья КАК АналитикаУчетаДт,
	|	ПрочиеАктивыПассивы.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ПрочиеАктивыПассивы.Подразделение КАК ПодразделениеДт,
	|	ПрочиеАктивыПассивы.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ПрочиеАктивыПассивы.СчетУчета КАК СчетДт,
	|
	|	ПрочиеАктивыПассивы.Субконто1 КАК СубконтоДт1,
	|	ПрочиеАктивыПассивы.Субконто2 КАК СубконтоДт2,
	|	ПрочиеАктивыПассивы.Субконто3 КАК СубконтоДт3,
	|
	|	ВЫБОР
	|		КОГДА НЕ Резервы.Ссылка ЕСТЬ NULL
	|		ТОГДА 0
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаСНДС
	|		ИНАЧЕ Расчеты.Сумма
	|	КОНЕЦ КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ВЫБОР
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаСНДС
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаНУДт,
	|	-ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) КАК СуммаПРДт,
	|	-ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаВРДт,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаКт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР
	|		КОГДА НЕ Резервы.Ссылка ЕСТЬ NULL ИЛИ НЕ ПрочиеАктивыПассивы.ТолькоАктивыПассивы
	|			ИЛИ НовыеРасчеты.НесколькоСтатей И ПрочиеАктивыПассивы.НомерСтроки <> 1
	|		ТОГДА 0
	|		КОГДА Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности)
	|		ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ * Расчеты.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности поставщика на активы\пассивы"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ПО
	|		Расчеты.Ссылка = ПрочиеАктивыПассивы.Регистратор
	|		И ПрочиеАктивыПассивы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСПоставщикамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|
	|ГДЕ
	|	(Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|	И Расчеты.НастройкаХозОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстЗадолженностьРасчетыСПоставщикомДоходы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Отражение задолженности перед поставщиком в доходы (Дт <60.1> :: Кт <91.1>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеДоходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеДоходы.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаДт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И РегистрПрочиеДоходы.НомерСтроки <> 1
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ * Расчеты.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	РегистрПрочиеДоходы.СтатьяДоходов КАК АналитикаУчетаКт,
	|	РегистрПрочиеДоходы.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	РегистрПрочиеДоходы.Подразделение КАК ПодразделениеКт,
	|	РегистрПрочиеДоходы.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	РегистрПрочиеДоходы.СтатьяДоходов КАК СубконтоКт1,
	|	РегистрПрочиеДоходы.АналитикаДоходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	ВЫБОР
	|		КОГДА НЕ РегистрПрочиеДоходы.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеДоходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК СуммаНУКт,
	|	ВЫБОР
	|		КОГДА РегистрПрочиеДоходы.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеДоходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКредиторскойЗадолженности)
	|		ТОГДА ""Списание задолженности перед поставщиком в доходы""
	|		КОГДА Расчеты.ДокументОбъектаРасчетов ССЫЛКА Справочник.Претензии
	|		ТОГДА ""Выставлена претензия поставщику""
	|		ИНАЧЕ ""Начислена дебиторская задолженность""
	|	КОНЕЦ КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеДоходы КАК РегистрПрочиеДоходы
	|	ПО
	|		Расчеты.Ссылка = РегистрПрочиеДоходы.Регистратор
	|		И РегистрПрочиеДоходы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСПоставщикамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|
	|ГДЕ
	|	(Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|	И Расчеты.НастройкаХозОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКредиторскойЗадолженности))";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстЗадолженностьРасчетыСПоставщикомПрочиеАктивыПассивы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Отражение задолженности перед поставщиком в прочие активы/пассивы (Дт <60.1> :: Кт <Прочие счета>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаДт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И ПрочиеАктивыПассивы.НомерСтроки <> 1 ИЛИ НЕ ПрочиеАктивыПассивы.ТолькоАктивыПассивы
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ * Расчеты.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	ПрочиеАктивыПассивы.Статья КАК АналитикаУчетаКт,
	|	ПрочиеАктивыПассивы.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ПрочиеАктивыПассивы.Подразделение КАК ПодразделениеКт,
	|	ПрочиеАктивыПассивы.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	ПрочиеАктивыПассивы.СчетУчета КАК СчетКт,
	|
	|	ПрочиеАктивыПассивы.Субконто1 КАК СубконтоКт1,
	|	ПрочиеАктивыПассивы.Субконто2 КАК СубконтоКт2,
	|	ПрочиеАктивыПассивы.Субконто3 КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКредиторскойЗадолженности)
	|		ТОГДА ""Списание задолженности перед поставщиком в активы/пассивы""
	|		КОГДА Расчеты.ДокументОбъектаРасчетов ССЫЛКА Справочник.Претензии
	|		ТОГДА ""Выставлена претензия поставщику""
	|		ИНАЧЕ ""Начислена дебиторская задолженность""
	|	КОНЕЦ КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ПО
	|		Расчеты.Ссылка = ПрочиеАктивыПассивы.Регистратор
	|		И ПрочиеАктивыПассивы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСПоставщикамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|
	|ГДЕ
	|	(Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|	И Расчеты.НастройкаХозОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКредиторскойЗадолженности))";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстЗадолженностьРасчетыСКлиентомРасходы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Начисление/Списание задолженности покупателя на расходы (Дт <91.2> :: Кт <62>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаРегл, 0) КАК Сумма,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаУпр, 0) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	РегистрПрочиеРасходы.СтатьяРасходов КАК АналитикаУчетаДт,
	|	РегистрПрочиеРасходы.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	РегистрПрочиеРасходы.Подразделение КАК ПодразделениеДт,
	|	РегистрПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	РегистрПрочиеРасходы.СтатьяРасходов КАК СубконтоДт1,
	|	РегистрПрочиеРасходы.АналитикаРасходов КАК СубконтоДт2,
	|	РегистрПрочиеРасходы.ТипЗатрат КАК СубконтоДт3,
	|
	|	ВЫБОР
	|		КОГДА Резервы.Ссылка ЕСТЬ NULL
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.Сумма
	|		ИНАЧЕ Расчеты.Сумма
	|	КОНЕЦ КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ВЫБОР
	|		КОГДА НЕ РегистрПрочиеРасходы.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|		ИНАЧЕ Расчеты.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|	КОНЕЦ КАК СуммаНУДт,
	|	ВЫБОР
	|		КОГДА РегистрПрочиеРасходы.ПринятиеКНалоговомуУчету
	|		ТОГДА -ЕСТЬNULL(Резервы.ПостояннаяРазница, 0)
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеРасходы.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|		ИНАЧЕ Расчеты.СуммаРегл - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0)
	|	КОНЕЦ КАК СуммаПРДт,
	|	-ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаВРДт,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаКт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР
	|		КОГДА НЕ Резервы.Ссылка ЕСТЬ NULL ИЛИ НовыеРасчеты.НесколькоСтатей И РегистрПрочиеРасходы.НомерСтроки <> 1
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ * Расчеты.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности) И Расчеты.ДокументОбъектаРасчетов ССЫЛКА Справочник.Претензии
	|		ТОГДА ""Получена претензия от клиента""
	|		КОГДА Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности)
	|		ТОГДА ""Начислена кредиторская задолженность""
	|		ИНАЧЕ ""Списание задолженности покупателя на расходы""
	|	КОНЕЦ КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеРасходы КАК РегистрПрочиеРасходы
	|	ПО
	|		Расчеты.Ссылка = РегистрПрочиеРасходы.Регистратор
	|		И РегистрПрочиеРасходы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСКлиентамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|
	|ГДЕ
	|	(Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|	И Расчеты.НастройкаХозОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстЗадолженностьРасчетыСКлиентомПрочиеАктивыПассивы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Начисление/Списание задолженности покупателя на активы/пассивы (Дт <Прочие счета> :: Кт <62>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаРегл, 0) КАК Сумма,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаУпр, 0) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	ПрочиеАктивыПассивы.Статья КАК АналитикаУчетаДт,
	|	ПрочиеАктивыПассивы.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ПрочиеАктивыПассивы.Подразделение КАК ПодразделениеДт,
	|	ПрочиеАктивыПассивы.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ПрочиеАктивыПассивы.СчетУчета КАК СчетДт,
	|
	|	ПрочиеАктивыПассивы.Субконто1 КАК СубконтоДт1,
	|	ПрочиеАктивыПассивы.Субконто2 КАК СубконтоДт2,
	|	ПрочиеАктивыПассивы.Субконто3 КАК СубконтоДт3,
	|
	|	ВЫБОР
	|		КОГДА Резервы.Ссылка ЕСТЬ NULL
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаСНДС
	|		ИНАЧЕ Расчеты.Сумма
	|	КОНЕЦ КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ - ЕСТЬNULL(Резервы.СуммаРегл, 0) + ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) + ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаНУДт,
	|	-ЕСТЬNULL(Резервы.ПостояннаяРазница, 0) КАК СуммаПРДт,
	|	-ЕСТЬNULL(Резервы.ВременнаяРазница, 0) КАК СуммаВРДт,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаКт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Расчеты.Валюта КАК ВалютаКт,
	|	Расчеты.Подразделение КАК ПодразделениеКт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	Расчеты.Контрагент КАК СубконтоКт1,
	|	Расчеты.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	ВЫБОР
	|		КОГДА НЕ Резервы.Ссылка ЕСТЬ NULL ИЛИ НЕ ПрочиеАктивыПассивы.ТолькоАктивыПассивы
	|			ИЛИ НовыеРасчеты.НесколькоСтатей И ПрочиеАктивыПассивы.НомерСтроки <> 1
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ * Расчеты.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности) И Расчеты.ДокументОбъектаРасчетов ССЫЛКА Справочник.Претензии
	|		ТОГДА ""Получена претензия от клиента""
	|		КОГДА Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности)
	|		ТОГДА ""Начислена кредиторская задолженность""
	|		ИНАЧЕ ""Списание задолженности покупателя на активы\пассивы""
	|	КОНЕЦ КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ПО
	|		Расчеты.Ссылка = ПрочиеАктивыПассивы.Регистратор
	|		И ПрочиеАктивыПассивы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РезервыПоСомнительнымДолгам_ПоОбъектамРасчета КАК Резервы
	|	ПО
	|		Расчеты.Ссылка = Резервы.Ссылка
	|		И Расчеты.ОбъектРасчетов = Резервы.ОбъектРасчетов
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСКлиентамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|
#Вставка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности КАК Корректировка
	|	ПО ДокументыКОтражению.Ссылка = Корректировка.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.битФакторинг КАК Факторинг
	|	ПО Корректировка.бг_Основание = Факторинг.Ссылка
	|		И Факторинг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бг_ВидыОперацийФакторинга.ОплатаДебиторомФактору)
#КонецВставки
	|ГДЕ
#Вставка
	|	Факторинг.Ссылка ЕСТЬ NULL И
#КонецВставки
	|	(Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|	И Расчеты.НастройкаХозОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеДебиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам))";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеКредиторскойЗадолженностиРасчетыСКлиентомДоходы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Отражение задолженности покупателя в доходы (Дт <62> :: Кт <91.1>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеДоходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеДоходы.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаДт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И РегистрПрочиеДоходы.НомерСтроки <> 1
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ * Расчеты.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	РегистрПрочиеДоходы.СтатьяДоходов КАК АналитикаУчетаКт,
	|	РегистрПрочиеДоходы.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	РегистрПрочиеДоходы.Подразделение КАК ПодразделениеКт,
	|	РегистрПрочиеДоходы.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	РегистрПрочиеДоходы.СтатьяДоходов КАК СубконтоКт1,
	|	РегистрПрочиеДоходы.АналитикаДоходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	ВЫБОР
	|		КОГДА НЕ РегистрПрочиеДоходы.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеДоходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК СуммаНУКт,
	|	ВЫБОР
	|		КОГДА РегистрПрочиеДоходы.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА РегистрПрочиеДоходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности перед покупателем в доходы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеДоходы КАК РегистрПрочиеДоходы
	|	ПО
	|		Расчеты.Ссылка = РегистрПрочиеДоходы.Регистратор
	|		И РегистрПрочиеДоходы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСКлиентамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|
	|ГДЕ
	|	(Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|	И Расчеты.НастройкаХозОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКредиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности))
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстНачислениеДебиторскойЗадолженностиРасчетыСКлиентомРасходы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Отражение задолженности покупателя в расходы (Дт <62> :: Кт <91.2>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА -РегистрПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА -РегистрПрочиеРасходы.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаДт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И РегистрПрочиеРасходы.НомерСтроки <> 1
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ * Расчеты.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаКт,
	|	РегистрПрочиеРасходы.СтатьяРасходов КАК АналитикаУчетаКт,
	|	РегистрПрочиеРасходы.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	РегистрПрочиеРасходы.Подразделение КАК ПодразделениеКт,
	|	РегистрПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|
	|	РегистрПрочиеРасходы.СтатьяРасходов КАК СубконтоКт1,
	|	РегистрПрочиеРасходы.АналитикаРасходов КАК СубконтоКт2,
	|	РегистрПрочиеРасходы.ТипЗатрат КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	ВЫБОР
	|		КОГДА НЕ РегистрПрочиеРасходы.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА -РегистрПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК СуммаНУКт,
	|	ВЫБОР
	|		КОГДА РегистрПрочиеРасходы.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА -РегистрПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности перед покупателем в расходы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеРасходы КАК РегистрПрочиеРасходы
	|	ПО
	|		Расчеты.Ссылка = РегистрПрочиеРасходы.Регистратор
	|		И РегистрПрочиеРасходы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСКлиентамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|
	|ГДЕ
	|	Расчеты.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности)
	|	И (Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

#Область ТекстСписаниеКредиторскойЗадолженностиРасчетыСКлиентомПрочиеАктивыПассивы
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Отражение задолженности покупателя в прочие активы/пассивы (Дт <62> :: Кт <Прочие счета>)
	|
	|	Расчеты.Ссылка КАК Ссылка,
	|	Расчеты.Период КАК Период,
	|	Расчеты.ОрганизацияАналитики КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаРегл
	|		ИНАЧЕ Расчеты.СуммаРегл
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей
	|		ТОГДА ПрочиеАктивыПассивы.СуммаУпр
	|		ИНАЧЕ Расчеты.СуммаУпр
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И НЕ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		ИНАЧЕ Расчеты.ВидСчета
	|	КОНЕЦ КАК ВидСчетаДт,
	|	Расчеты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Расчеты.Валюта КАК ВалютаДт,
	|	Расчеты.Подразделение КАК ПодразделениеДт,
	|	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|
	|	Расчеты.Контрагент КАК СубконтоДт1,
	|	Расчеты.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	ВЫБОР
	|		КОГДА НовыеРасчеты.НесколькоСтатей И ПрочиеАктивыПассивы.НомерСтроки <> 1 ИЛИ НЕ ПрочиеАктивыПассивы.ТолькоАктивыПассивы
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ * Расчеты.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	ПрочиеАктивыПассивы.Статья КАК АналитикаУчетаКт,
	|	ПрочиеАктивыПассивы.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ПрочиеАктивыПассивы.Подразделение КАК ПодразделениеКт,
	|	ПрочиеАктивыПассивы.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	ПрочиеАктивыПассивы.СчетУчета КАК СчетКт,
	|
	|	ПрочиеАктивыПассивы.Субконто1 КАК СубконтоКт1,
	|	ПрочиеАктивыПассивы.Субконто2 КАК СубконтоКт2,
	|	ПрочиеАктивыПассивы.Субконто3 КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание задолженности перед покупателем в активы/пассивы"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиНоваяАрхитектура КАК Расчеты
	|	ПО
	|		ДокументыКОтражению.Ссылка = Расчеты.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиПоДокументам КАК НовыеРасчеты
	|	ПО
	|		Расчеты.Ссылка = НовыеРасчеты.Ссылка
	|		И Расчеты.ОбъектРасчетов = НовыеРасчеты.ОбъектРасчетов
	|		И НЕ НовыеРасчеты.СтарыйАлгоритм
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВТДанныеПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ПО
	|		Расчеты.Ссылка = ПрочиеАктивыПассивы.Регистратор
	|		И ПрочиеАктивыПассивы.ИдентификаторФинЗаписи = Расчеты.ИдентификаторФинЗаписи
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасчетыСКлиентамиНоваяАрхитектура КАК РасчетыПоПретензиям
	|	ПО ДокументыКОтражению.Ссылка = РасчетыПоПретензиям.Ссылка
	|		И НовыеРасчеты.НесколькоСтатей
	|		И РасчетыПоПретензиям.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|		И Расчеты.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|
	|ГДЕ
	|	(Расчеты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами) ИЛИ РасчетыПоПретензиям.Ссылка ЕСТЬ NULL ИЛИ НЕ НовыеРасчеты.НесколькоСтатей)
	|	И Расчеты.НастройкаХозОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКредиторскойЗадолженности),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности))
	|";
	ТекстыОтражения.Добавить(ТекстЗапроса);
#КонецОбласти

	ТекстыОтражения.Добавить(ТекстПереносАвансаСДолгаРасходыПоставщики()); // Перенос аванса (Дт <60.2> :: Кт <60.1>)
	ТекстыОтражения.Добавить(ТекстПереносАвансаСДолгаДоходыПоставщики()); // Перенос аванса (Дт <60.1> :: Кт <60.2>)
	ТекстыОтражения.Добавить(ТекстПереносАвансаСДолгаДоходыКлиенты()); // Перенос аванса (Дт <62.2> :: Кт <62.1>)
	ТекстыОтражения.Добавить(ТекстПереносАвансаСДолгаРасходыКлиенты()); // Перенос аванса (Дт <62.1> :: Кт <62.2>)
	
	//-- Локализация
	Возврат СтрСоединить(ТекстыОтражения, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
КонецФункции
