#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список, "Организация", Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Параметры.Организация));
	КонецЕсли;
	
	Если Параметры.Свойство("Перевозчик") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список, "Перевозчик", Параметры.Перевозчик, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Параметры.Перевозчик));
	КонецЕсли;
	
	Если Параметры.Свойство("Склад") Тогда
		Склад = Параметры.Склад;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список, "Склад", Склад, ВидСравненияКомпоновкиДанных.ВИерархии, , ЗначениеЗаполнено(Склад));
	КонецЕсли;
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.СписокДата.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список, "Автомобиль", Автомобиль, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Автомобиль));
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список, "Водитель", Водитель, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Водитель));
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список, "Склад", Склад, ВидСравненияКомпоновкиДанных.ВИерархии, , ЗначениеЗаполнено(Склад));
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВыбранныеЗначения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбраннаяСтрока);
	ОповеститьОВыборе(ВыбранныеЗначения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФорм

&НаКлиенте
Процедура Выбрать(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ОповеститьОВыборе(ВыделенныеСтроки);
КонецПроцедуры

#КонецОбласти



