Функция ТипТранспортногоСредства(ДанныеОбъекта) Экспорт
	
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	ТипТранспортногоСредства = адаптер_РаботаСДаннымиИБ.ПолучитьСсылку("Справочник.ТипыТранспортныхСредств", ДанныеОбъекта.Идентификатор);
	Если Не ОбщегоНазначения.СсылкаСуществует(ТипТранспортногоСредства) Тогда
		ТипТранспортногоСредстваОбъект = Справочники.ТипыТранспортныхСредств.СоздатьЭлемент();
		ТипТранспортногоСредстваОбъект.УстановитьНовыйКод();
	Иначе
		ТипТранспортногоСредстваОбъект = ТипТранспортногоСредства.ПолучитьОбъект(); 
	КонецЕсли;
	
	КоличествоКГВТоннах = 1000;
	ТипТранспортногоСредстваОбъект.Наименование = ДанныеОбъекта.Наименование;
	Если ЗначениеЗаполнено(ДанныеОбъекта.Грузоподъемность) Тогда
		ТипТранспортногоСредстваОбъект.ГрузоподъемностьВТоннах = ДанныеОбъекта.Грузоподъемность / КоличествоКГВТоннах;
	КонецЕсли;
	
	ТипТранспортногоСредстваОбъект.ВместимостьВКубическихМетрах = ДанныеОбъекта.ОбъемКузова;
	ТипТранспортногоСредстваОбъект.Записать();
	
	Возврат ТипТранспортногоСредстваОбъект.Ссылка;
	
КонецФункции

