#Область ПрограммныйИнтерфейс

Функция НайтиСсылкуПоЗагружаемымДанным(СтруктураОбъекта) Экспорт
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	Если СтруктураОбъекта = Неопределено Тогда
		Возврат Справочники.бг_КлассыГрузоподъемностиТС.ПустаяСсылка();
	КонецЕсли;
	
	Результат = адаптер_РаботаСДаннымиИБ.НайтиСсылкуПоЗагружаемымДанным(СтруктураОбъекта);
	
	Если ЗначениеЗаполнено(Результат) И ОбщегоНазначения.СсылкаСуществует(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Наименование") И Не ПустаяСтрока(СтруктураОбъекта.Наименование) Тогда
		Результат = Справочники.бг_КлассыГрузоподъемностиТС.НайтиПоНаименованию(СтруктураОбъекта.Наименование, Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
