
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа И ЭтоНовый() Тогда
		бг_ДатаСоздания = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли; 
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура бг_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если Не ЭтоГруппа Тогда
		бг_Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&После("ОчиститьНеиспользуемыеРеквизиты")
Процедура бг_ОчиститьНеиспользуемыеРеквизиты()
	Если НЕ ЭтоГруппа Тогда
		Если НЕ СкидкиНаценкиПовтИсп
			.бг_НакоплениеСкидкиДоступно(ЭтотОбъект.СпособПримененияСкидки, ЭтотОбъект.СпособПредоставления)
			Тогда
				ЭтотОбъект.бг_Накопительная = Ложь;
		КонецЕсли;
		Если НЕ СкидкиНаценкиПовтИсп
			.бг_ОграничениеСкидкиДоступно(ЭтотОбъект.СпособПримененияСкидки, ЭтотОбъект.СпособПредоставления)
			Тогда
				ЭтотОбъект.бг_ОграничениеСкидки = 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
