
&После("ДобавитьКомандыПечати")
Процедура бг_ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.бг_ПечатьОС";	
	КомандаПечати.Идентификатор = "ОС3_Модернизация_Георгиевский";
	КомандаПечати.Представление = НСтр("ru = 'Акт о модернизации ОС (ОС-3) ООО ""Георгиевский""';
										|en = 'FA acceptance certificate (FA-3) LLC ""Georgievsky""'");
	КомандаПечати.ФункциональныеОпции = "ИспользоватьРеглУчет";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.бг_ПечатьОС";
	КомандаПечати.Идентификатор = "ОС3_Дооборудование_Георгиевский";
	КомандаПечати.Представление = НСтр("ru = 'Акт о дооборудовании ОС (ОС-3) ООО ""Георгиевский""';
										|en = 'FA acceptance certificate (FA-3) LLC ""Georgievsky""'");
	КомандаПечати.ФункциональныеОпции = "ИспользоватьРеглУчет";	
		
КонецПроцедуры
