
Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт

	Перем адаптер_обработчикиСобытийСтандартный;
	адаптер_обработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_обработчикиСобытийСтандартный");
	
	ДанныеОбъекта = адаптер_обработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения);
	
	РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];
	
	Если НЕ РеквизитыОбъекта.ЭтоГруппа Тогда
		
		РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Родитель, "НомерИзвещения, ДатаВыдачиИзвещения");
		РеквизитыОбъекта.Вставить("НомерИзвещения", РеквизитыРодителя.НомерИзвещения);	
		РеквизитыОбъекта.Вставить("ДатаВыдачиИзвещения", РеквизитыРодителя.ДатаВыдачиИзвещения);	
		
	КонецЕсли; 
	
	Возврат ДанныеОбъекта;

КонецФункции
