#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не НаименованиеУникально() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Наименование не уникально'"),,,, Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаименованиеУникально()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бг_ОсновныеНаименованияНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бг_ОсновныеНаименованияНоменклатуры КАК бг_ОсновныеНаименованияНоменклатуры
		|ГДЕ
		|	бг_ОсновныеНаименованияНоменклатуры.Наименование = &Наименование
		|	И бг_ОсновныеНаименованияНоменклатуры.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции  

#КонецОбласти
